[{"symbol": "MSFT", "date": "2026-01-15 11:00:00", "title": "MICROSOFT EXPANDS ITS COMMITMENT TO EDUCATION WITH ELEVATE FOR EDUCATORS PROGRAM AND NEW AI-POWERED TOOLS", "text": "EMPOWERING EDUCATION SYSTEMS, EDUCATORS AND STUDENTS WITH RESPONSIBLE AI TOOLS IN MICROSOFT 365 COPILOT APP AND GLOBAL PROGRAMS THAT STRENGTHEN EDUCATOR CONFIDENCE AND SUPPORT LEARNING AND CAREER PATHWAYS REDMOND, WASH., JAN. 15, 2026 /PRNEWSWIRE/ -- MICROSOFT CORP. ON THURSDAY ANNOUNCED MICROSOFT ELEVATE FOR EDUCATORS, A NEW COMPREHENSIVE PROGRAM CONNECTING EDUCATORS WITH COMMUNITY, RESOURCES AND IN-DEMAND CREDENTIALS AND NEW AI-POWERED CAPABILITIES AT NO ADDITIONAL COST TO HELP SCHOOLS WORLDWIDE PREPARE EDUCATORS AND STUDENTS FOR AN AI-DRIVEN FUTURE."}, {"symbol": "MSFT", "date": "2026-01-15 09:05:00", "title": "THE MEDIA TRUST EXPANDS DIGITAL TRUST AND SAFETY SOLUTIONS WITH MICROSOFT OWNED AND OPERATED PUBLISHERS", "text": "MCLEAN, VA.--(BUSINESS WIRE)--THE MEDIA TRUST WILL PROVIDE REAL-TIME THREAT DETECTION AND MITIGATION TO PROTECT MICROSOFT'S PROPERTIES FROM MALWARE, REDIRECTS, AND MALICIOUS ADS."}, {"symbol": "MSFT", "date": "2026-01-14 09:00:00", "title": "RUBICON CARBON TO SUPPLY MICROSOFT WITH TWO MILLION TONNES OF CARBON REMOVAL CREDITS FROM KIJANI FORESTRY PROJECT", "text": "MARINA DEL REY, CALIF.--(BUSINESS WIRE)--RUBICON CARBON, A VERTICALLY INTEGRATED CARBON CREDIT INVESTMENT AND MANAGEMENT FIRM, SIGNED AN AGREEMENT TO DELIVER TWO MILLION HIGH-QUALITY AFFORESTATION, REFORESTATION, AND REVEGETATION (ARR) CREDITS TO MICROSOFT OVER NINE YEARS. THE CREDITS WILL BE SOURCED THROUGH 2035 FROM KIJANI FORESTRY'S SMALLHOLDER FARMER FORESTRY PROJECT, WHICH IS ONE OF THE FIRST TO BE APPROVED UNDER UGANDA'S CLIMATE CHANGE MECHANISMS REGULATIONS. THE SMALLHOLDER FARMER FOREST."}, {"symbol": "MSFT", "date": "2026-01-14 08:00:00", "title": "MICROSOFT SELECTS EYELIT TECHNOLOGIES TO POWER LAB TRACEABILITY AND QUALITY INITIATIVES", "text": "HOLMDEL, N.J.--(BUSINESS WIRE)--EYELIT TECHNOLOGIES (EYELIT), A LEADER IN OPTIMIZED PLANNING, SCHEDULING, AND EXECUTION SYSTEMS FOR MANUFACTURERS, TODAY ANNOUNCED THAT MICROSOFT HAS SELECTED ITS MANUFACTURING OPERATIONS MANAGEMENT (MOM) SOLUTION SUITE TO SUPPORT TRACEABILITY AND QUALITY ACROSS MULTIPLE LABS AROUND THE GLOBE. ANCHORED BY EYELIT'S MES AND QMS MODULES, THE IMPLEMENTATION IS DESIGNED TO ADDRESS COMPLEX SEMICONDUCTOR AND SPECIALTY PROCESSING WORKFLOWS AT SCALE. EYELIT'S MOM SOLUTION."}, {"symbol": "MSFT", "date": "2026-01-13 15:43:00", "title": "SYMPHONYAI LAUNCHES NEXT-GENERATION CINDE MERCHANDISING AGENTS, BRINGING AGENTIC AI INTO CORE MERCHANDISING DECISIONS, POWERED BY MICROSOFT FOUNDRY AND AZURE", "text": "NEW YORK--(BUSINESS WIRE)-- #AIINNOVATION--SYMPHONYAI, A GLOBAL LEADER IN VERTICAL AI PRODUCT PLATFORMS, TODAY ANNOUNCED THE LAUNCH OF THE NEXT GENERATION OF CINDE MERCHANDISING AGENTS, INTRODUCING A NEW CLASS OF MERCHANDISING AGENTS THAT EMBED AGENTIC AI DIRECTLY INTO WEEKLY, PROMOTIONAL, LAUNCH, AND RESET WORKFLOWS. PURPOSE-BUILT FOR MERCHANTS, THE CINDE MERCHANDISING AGENTS BRING AUTONOMOUS, ROLE-BASED INTELLIGENCE TO THE DECISIONS THAT DRIVE IN-STORE MERCHANDISING MARGIN: THE MERCHANT PLANNER – WEEKLY SALE."}, {"symbol": "MSFT", "date": "2026-01-13 15:35:00", "title": "SYMPHONYAI LAUNCHES NEW INDUSTRIAL AI APPS PURPOSE-BUILT FOR THE CPG FOOD AND BEVERAGE INDUSTRY, POWERED BY MICROSOFT AZURE", "text": "NEW YORK--(BUSINESS WIRE)-- #AIINNOVATION--SYMPHONYAI, THE GLOBAL LEADER IN VERTICAL AI PRODUCT PLATFORMS, TODAY ANNOUNCED EIGHT NEW INDUSTRIAL AI APPLICATIONS PURPOSE-BUILT FOR THE UNIQUE OPERATIONAL DEMANDS OF CPG & FOOD AND BEVERAGE MANUFACTURERS, MARKING ONE OF THE MOST TARGETED EXPANSIONS OF IRIS FOUNDRY TO DATE. UNLIKE GENERIC \"MANUFACTURING AI,\" THESE APPS ARE ENGINEERED AROUND HIGH-SPEED LINES, THERMAL VARIABILITY, CIP/SIP COMPLEXITY, MICRO-STOPPAGES, DRIFT CONDITIONS, AND ROBOTICS. BY COMBINING SY."}, {"symbol": "MSFT", "date": "2026-01-13 08:45:00", "title": "ESW LAUNCHES COPILOT ASCEND™, A MICROSOFT AI TRAINING PROGRAM DESIGNED TO BUILD REAL WORKFORCE CAPABILITY", "text": "NEW YORK, JAN. 13, 2026 (GLOBE NEWSWIRE) -- ESW TODAY ANNOUNCED THE LAUNCH OF COPILOT ASCEND™, A PROPRIETARY MICROSOFT COPILOT AND AI TRAINING PROGRAM DESIGNED TO HELP ORGANIZATIONS CONFIDENTLY ADOPT AI ACROSS THEIR WORKFORCE. THE PROGRAM FOCUSES ON PRACTICAL SKILL DEVELOPMENT, REAL-WORLD WORKFLOWS, AND ROLE-BASED ENABLEMENT SO EMPLOYEES CAN TURN MICROSOFT COPILOT INTO EVERYDAY PRODUCTIVITY GAINS."}, {"symbol": "MSFT", "date": "2026-01-08 10:00:00", "title": "MICROSOFT PROPELS RETAIL FORWARD WITH AGENTIC AI CAPABILITIES THAT POWER INTELLIGENT AUTOMATION FOR EVERY RETAIL FUNCTION", "text": "BUILT FOR THE FULL RETAIL VALUE CHAIN, MICROSOFT'S AGENTIC AI STREAMLINES CRITICAL WORKFLOWS TO ACCELERATE DECISIONS AND OUTCOMES  BY AUGMENTING HUMAN EXPERTISE ACROSS THE ENTERPRISE REDMOND, WASH., JAN. 8, 2026 /PRNEWSWIRE/ -- MICROSOFT CORP. ON THURSDAY ANNOUNCED AGENTIC AI SOLUTIONS DESIGNED TO BRING INTELLIGENT AUTOMATION TO EVERY PART OF THE RETAIL BUSINESS."}, {"symbol": "MSFT", "date": "2026-01-08 01:30:00", "title": "TOMTOM ENHANCES MAPS AND NAVIGATION WITH MICROSOFT AZURE INTEGRATION", "text": "LAS VEGAS, JAN. 08, 2026 (GLOBE NEWSWIRE) -- TOMTOM (TOM2), THE LOCATION TECHNOLOGY SPECIALIST, TODAY ANNOUNCED ITS CONTINUED COLLABORATION WITH MICROSOFT TO ENHANCE ITS MAPS AND NAVIGATION PRODUCTS. TOMTOM IS ENHANCING ITS AUTOMOTIVE NAVIGATION SOLUTIONS, INCLUDING THE TOMTOM AUTOMOTIVE NAVIGATION APPLICATION AND TOMTOM AI AGENT, THROUGH INTEGRATION OF AZURE OPENAI IN MICROSOFT FOUNDRY MODELS, AZURE COSMOS DB AND AZURE KUBERNETES SERVICE."}, {"symbol": "MSFT", "date": "2026-01-07 08:00:00", "title": "CLICKSHARE LAUNCHES ITS FIRST WIRELESS ROOM SYSTEM BUNDLES CERTIFIED FOR MICROSOFT TEAMS WITH SENNHEISER", "text": "KORTRIJK, BELGIUM--(BUSINESS WIRE)--BARCO, A GLOBAL LEADER IN MEETING ROOM TECHNOLOGY, TODAY ANNOUNCED THE LAUNCH OF NEW CLICKSHARE HUB ROOM SYSTEM BUNDLES, DEVELOPED IN PARTNERSHIP WITH SENNHEISER AND OFFICIALLY CERTIFIED FOR MICROSOFT TEAMS. THIS CERTIFICATION HIGHLIGHTS BARCO AND MICROSOFT'S SHARED COMMITMENT TO DELIVERING ADVANCED MEETING ROOM SOLUTIONS. AS ONE OF THE FIRST WIRELESS ROOM SYSTEMS BUILT ON THE MICROSOFT DEVICE ECOSYSTEM PLATFORM (MDEP), THE CERTIFIED BUNDLES PAIR CLICKSHARE H."}, {"symbol": "MSFT", "date": "2026-01-06 16:25:00", "title": "CORRECTING AND REPLACING PROFITMIND AVAILABLE IN THE MICROSOFT MARKETPLACE – SPRING 2026", "text": "PITTSBURGH--(BUSINESS WIRE)--PROFITMIND, THE AGENTIC AI DECISION INTELLIGENCE PLATFORM BUILT FOR RETAIL TEAMS, ANNOUNCED IT WILL BE AVAILABLE IN THE MICROSOFT MARKETPLACE."}, {"symbol": "MSFT", "date": "2026-01-06 09:36:00", "title": "PROFITMIND NOW AVAILABLE IN THE MICROSOFT MARKETPLACE", "text": "PITTSBURGH--(BUSINESS WIRE)--PROFITMIND, THE AGENTIC AI DECISION INTELLIGENCE PLATFORM BUILT FOR RETAIL TEAMS, ANNOUNCED IT WILL BE AVAILABLE IN THE MICROSOFT MARKETPLACE."}, {"symbol": "MSFT", "date": "2026-01-06 03:05:00", "title": "CALLTOWER WINS 2025 BIG AWARDS FOR BUSINESS FOR OPERATOR CONNECT FOR MICROSOFT TEAMS", "text": "BUSINESS INTELLIGENCE GROUP RECOGNIZES CALLTOWER'S INNOVATION, IMPACT, AND EXCELLENCE IN GLOBAL COMMUNICATION SOLUTIONS BUSINESS INTELLIGENCE GROUP RECOGNIZES CALLTOWER'S INNOVATION, IMPACT, AND EXCELLENCE IN GLOBAL COMMUNICATION SOLUTIONS"}, {"symbol": "MSFT", "date": "2025-12-18 09:00:00", "title": "COGNIZANT AND MICROSOFT EXPAND PARTNERSHIP TO ADVANCE AI TRANSFORMATION AND FRONTIER FIRM EXPERIENCES", "text": "THE COLLABORATION WILL CO-INNOVATE TO DELIVER AI-POWERED SOLUTIONS, COMBINING MICROSOFT'S TRUSTED CLOUD WITH COGNIZANT'S INDUSTRY PLATFORMS TO HELP ORGANIZATIONS REDEFINE WORK AND SCALE INNOVATION. TEANECK, N.J."}, {"symbol": "MSFT", "date": "2025-12-18 04:00:00", "title": "REPLY RECOGNIZED AS A MICROSOFT AZURE EXPERT MANAGED SERVICES PROVIDER FOR THE SIXTH CONSECUTIVE YEAR", "text": "TURIN, ITALY--(BUSINESS WIRE)--REPLY [EXM, STAR: REY] ANNOUNCED TODAY IT HAS BEEN RECOGNIZED ONCE AGAIN AS A MICROSOFT AZURE EXPERT MANAGED SERVICES PROVIDER (MSP). THE RENEWAL REAFFIRMS REPLY'S PROVEN EXPERTISE AND CONSISTENT TRACK RECORD IN DELIVERING HIGH-QUALITY CLOUD SOLUTIONS AND SERVICES ON THE MICROSOFT AZURE PLATFORM, POWERED BY THE DEEP TECHNICAL EXPERTISE OF ITS SPECIALIZED COMPANIES – CLUSTER REPLY, SOLIDSOFT REPLY AND VALOREM REPLY. THE AZURE EXPERT MSP PROGRAM IS DESIGNED BY MICRO."}, {"symbol": "MSFT", "date": "2025-12-17 16:30:00", "title": "PROSPEROPS ACHIEVES MICROSOFT AZURE IP CO-SELL STATUS", "text": "AZURE CUSTOMERS CAN NOW BURN DOWN MICROSOFT AZURE CONSUMPTION COMMITMENT CREDITS WHILE OPTIMIZING CLOUD COSTS WITH PROSPEROPS AUSTIN, TEXAS / ACCESS NEWSWIRE / DECEMBER 17, 2025 / PROSPEROPS, A LEADING MULTI-CLOUD FINOPS AUTOMATION PLATFORM, TODAY ANNOUNCED IT HAS ACHIEVED MICROSOFT AZURE IP CO-SELL STATUS. AS A RESULT, ORGANIZATIONS PROCURING PROSPEROPS THROUGH THE AZURE MARKETPLACE CAN STREAMLINE BILLING AND NOW APPLY PURCHASES TOWARD THEIR MICROSOFT AZURE CONSUMPTION COMMITMENTS (MACCS), ALONG WITH OTHER BENEFITS."}, {"symbol": "MSFT", "date": "2025-12-17 08:00:00", "title": "ECOVADIS WINS MICROSOFT LOCAL PARTNER AWARD FY25 IN AI TRANSFORMATION - SCALE CATEGORY", "text": "NEW YORK & PARIS--(BUSINESS WIRE)--ECOVADIS WINS MICROSOFT LOCAL PARTNER AWARD FY25 IN AI TRANSFORMATION - SCALE CATEGORY."}, {"symbol": "MSFT", "date": "2025-12-09 13:11:00", "title": "JLENS AND ADL APPLAUD MICROSOFT SHAREHOLDERS' VOTE TO REJECT BDS-ALIGNED PROPOSAL 9 AT ANNUAL MEETING", "text": "NEW YORK--(BUSINESS WIRE)--JLENS, A REGISTERED INVESTMENT ADVISOR AFFILIATED WITH ADL (THE ANTI-DEFAMATION LEAGUE), WELCOMES THE VOTE BY MICROSOFT CORPORATION (“MICROSOFT” OR THE “COMPANY”) (NASDAQ: MSFT) SHAREHOLDERS AGAINST PROPOSAL 9 AT THE COMPANY'S 2025 ANNUAL SHAREHOLDER MEETING. THIS SHAREHOLDER RESOLUTION, ALIGNED WITH THE BOYCOTT, DIVESTMENT AND SANCTIONS (“BDS”) MOVEMENT, CALLED FOR CONFLICT-SPECIFIC HUMAN RIGHTS DUE DILIGENCE TARGETING ISRAEL. CONSISTENT WITH THE BOARD OF DIRECTORS'."}, {"symbol": "MSFT", "date": "2025-12-09 08:00:00", "title": "ATHENAHEALTH COLLABORATES WITH MICROSOFT TO OFFER MICROSOFT DRAGON COPILOT AS AMBIENT NOTES OPTION, ENHANCING CHOICE AND FLEXIBILITY FOR AMBULATORY CLINICIANS", "text": "BOSTON--(BUSINESS WIRE)--ATHENAHEALTH, A LEADING PROVIDER OF NETWORK-ENABLED SOFTWARE AND SERVICES FOR HEALTHCARE PRACTICES AND SYSTEMS NATIONWIDE, TODAY ANNOUNCED A PARTNERSHIP WITH MICROSOFT. MICROSOFT DRAGON COPILOT IS JOINING ATHENAONE'S AMBIENT NOTES, A FULLY-INTEGRATED AI-DRIVEN AMBIENT SOLUTION THAT SIMPLIFIES DOCUMENTATION FOR AMBULATORY CLINICIANS. AVAILABLE IN THE FIRST HALF OF 2026, MICROSOFT DRAGON COPILOT WILL BE EMBEDDED DIRECTLY INTO ATHENAONE AS THE LATEST AMBIENT MODEL FOR CLIN."}, {"symbol": "MSFT", "date": "2025-12-05 10:40:00", "title": "M365CON.NET ANNOUNCES DEEP DIVE MICROSOFT CONVENTION — FEATURING NEW SPONSOR XSP", "text": "A MULTI-WEEK IMMERSIVE LEARNING EXPERIENCE FOR MICROSOFT 365 ENTHUSIASTS A MULTI-WEEK IMMERSIVE LEARNING EXPERIENCE FOR MICROSOFT 365 ENTHUSIASTS"}, {"symbol": "MSFT", "date": "2025-12-03 09:30:00", "title": "CENTRILOGIC ACHIEVES ALL SIX MICROSOFT AI CLOUD PARTNER DESIGNATIONS, DEMONSTRATING DEEP EXPERTISE ACROSS MICROSOFT'S AI CLOUD SERVICES PORTFOLIO", "text": "TORONTO, DEC. 03, 2025 (GLOBE NEWSWIRE) -- CENTRILOGIC, A GLOBAL PROVIDER OF IT TRANSFORMATION SOLUTIONS, HAS SUCCESSFULLY ACHIEVED ALL SIX MICROSOFT AI CLOUD PARTNER PROGRAM SOLUTION DESIGNATIONS, VALIDATING ITS DEEP EXPERTISE AND PROVEN SUCCESS IN DELIVERING COMPREHENSIVE AI AND CLOUD SOLUTIONS THAT HELP BUSINESSES MODERNIZE, INNOVATE, AND GROW."}, {"symbol": "MSFT", "date": "2025-12-03 08:00:00", "title": "SYLLABLE AI NOW AVAILABLE IN THE MICROSOFT MARKETPLACE", "text": "MOUNTAIN VIEW, CALIF.--(BUSINESS WIRE)-- #AI--SYLLABLE AI NOW AVAILABLE IN THE MICROSOFT MARKETPLACE. MICROSOFT CUSTOMERS CAN NOW USE SYLLABLE'S AGENTIC AI PLATFORM THROUGH MICROSOFT MARKETPLACE."}, {"symbol": "MSFT", "date": "2025-12-03 05:30:00", "title": "ESW INTRODUCES COPILOT ORBIT™, MICROSOFT AI AUTOMATION SERVICES FOR SMALL AND MID-SIZED COMPANIES", "text": "AS COMPANIES INCREASINGLY ADOPT AI, MANY STRUGGLE TO MOVE BEYOND PROOF-OF-CONCEPT TOOLS TO FULL-SCALE AUTOMATION. COPILOT ORBIT ADDRESSES THAT CHALLENGE BY"}, {"symbol": "MSFT", "date": "2025-12-02 17:56:00", "title": "MICROSOFT ANNOUNCES QUARTERLY DIVIDEND", "text": "REDMOND, WASH. , DEC. 2, 2025 /PRNEWSWIRE/ -- MICROSOFT CORP. ON TUESDAY ANNOUNCED THAT ITS BOARD OF DIRECTORS DECLARED A QUARTERLY DIVIDEND OF $0.91 PER SHARE."}, {"symbol": "MSFT", "date": "2025-12-02 10:18:00", "title": "NATIONAL 4-H COUNCIL AND MICROSOFT EXTEND $10M PARTNERSHIP TO EXPAND AI EDUCATION FOR RURAL YOUTH AND EDUCATORS", "text": "WASHINGTON, D.C., DEC. 02, 2025 (GLOBE NEWSWIRE) -- FOR EIGHT YEARS, NATIONAL 4-H COUNCIL AND MICROSOFT HAVE CLOSED THE DIGITAL DIVIDE IN RURAL COMMUNITIES. THIS COLLABORATION HAS A TRACK RECORD OF TURNING VISION INTO ACTION — FROM THE 4-H TECH CHANGEMAKERS INITIATIVE THAT EXPANDED DIGITAL SKILLS IN RURAL COMMUNITIES, TO REACHING 1.4 MILLION YOUTH WITH THE AI FOUNDATIONS CURRICULUM THROUGH MINECRAFT EDUCATION IN 2024. THIS INVESTMENT REAFFIRMS BOTH ORGANIZATIONS' SHARED MISSION TO PREPARE YOUNG PEOPLE FOR AN AI-POWERED WORLD THROUGH MICROSOFT MINECRAFT EDUCATION."}, {"symbol": "MSFT", "date": "2025-12-02 09:08:00", "title": "FOCAL STRENGTHENS COMMITMENT TO CANADIAN ADVISORS WITH MICROSOFT'S CANADIAN DATA CENTRE STORAGE", "text": "TORONTO--(BUSINESS WIRE)--THIS MOVE REINFORCES FOCAL'S COMMITMENT TO SECURITY, PRIVACY AND COMPLIANCE AND ENSURES CLIENT DATA REMAINS SECURELY HOUSED WITHIN CANADIAN BORDERS."}, {"symbol": "MSFT", "date": "2025-12-02 09:03:00", "title": "SYNCRO AND CYBERDRAIN LAUNCH SNAPSHOT, A FREE MICROSOFT TENANT SECURITY ASSESSMENT FOR MSPS", "text": "TAMPA, FLA.--(BUSINESS WIRE)-- #MSP--SYNCRO AND CYBERDRAIN ANNOUNCED A JOINTLY DEVELOPED SOLUTION TO SIMPLIFY MICROSOFT 365 SECURITY ASSESSMENTS."}, {"symbol": "MSFT", "date": "2025-12-02 08:01:00", "title": "LITERA EXPANDS MICROSOFT 365 ECOSYSTEM WITH SHAREPOINT INTEGRATION, ENABLING LAWYERS TO DRAFT, COMPARE, AND MANAGE CONTENT WITHIN EXISTING WORKFLOW", "text": "CHICAGO--(BUSINESS WIRE)-- #AI--LITERA ONE UNIFIES SHAREPOINT, IMANAGE, NETDOCUMENTS, ONEDRIVE, AND MICROSOFT 365 TO DELIVER A CONNECTED, AI-POWERED LEGAL CONTENT EXPERIENCE."}, {"symbol": "MSFT", "date": "2025-12-01 09:00:00", "title": "MARVELL EXTENDS COLLABORATION WITH MICROSOFT, EXPANDING AZURE GLOBAL CLOUD SECURITY SERVICES IN EUROPE", "text": "SANTA CLARA, CALIF.--(BUSINESS WIRE)---- $MRVL #AI--MARVELL TECHNOLOGY, INC. (NASDAQ: MRVL), A LEADER IN DATA INFRASTRUCTURE SEMICONDUCTOR SOLUTIONS, TODAY ANNOUNCED THAT MICROSOFT EXPANDED THE USE CASES FOR ITS CLOUD-BASED SECURITY OFFERINGS POWERED BY MARVELL® LIQUIDSECURITY® HARDWARE SECURITY MODULES (HSMS) FOR CUSTOMERS IN EUROPE, ADDING TO EXISTING CLOUD-BASED SECURITY OFFERINGS IN ASIA AND NORTH AMERICA. THE ANNOUNCEMENT FOLLOWS TWO NEW EUROPEAN CERTIFICATIONS AWARDED TO MARVELL FOR LIQUIDSECURITY EARL."}, {"symbol": "MSFT", "date": "2025-11-26 09:00:00", "title": "RLWRLD PARTNERS WITH MICROSOFT TO ACCELERATE GLOBAL INNOVATION IN INDUSTRIAL ROBOTICS AI", "text": "THE PARTNERSHIP LEVERAGES MICROSOFT AZURE TO SCALE ROBOTICS AI MODEL DEVELOPMENT AND PERFORMANCE, WITH JOINT PROOF-OF-CONCEPT DEPLOYMENTS AND MARKET EXPANSION PLANNED ACROSS MANUFACTURING, LOGISTICS, AND HOSPITALITY SECTORS IN ASIA. THE PARTNERSHIP LEVERAGES MICROSOFT AZURE TO SCALE ROBOTICS AI MODEL DEVELOPMENT AND PERFORMANCE, WITH JOINT PROOF-OF-CONCEPT DEPLOYMENTS AND MARKET EXPANSION PLANNED ACROSS MANUFACTURING, LOGISTICS, AND HOSPITALITY SECTORS IN ASIA."}, {"symbol": "MSFT", "date": "2025-11-25 12:49:00", "title": "STANDARDS + EXCELERATE COPILOTS FROM STANDARDS CORE NOW AVAILABLE IN THE MICROSOFT MARKETPLACE", "text": "HOUSTON, NOV. 25, 2025 (GLOBE NEWSWIRE) -- STANDARDS CORE LLC TODAY ANNOUNCED THE AVAILABILITY OF STANDARDS + EXCELERATE COPILOTS IN THE MICROSOFT MARKETPLACE. THESE ADD-INS FOR MICROSOFT WORD AND MICROSOFT EXCEL EMPOWER TECHNICAL AND LEGAL DOCUMENTS WITH SAFE, REDUNDANT, SELF-VERIFYING, AND ITERATIVE AI."}, {"symbol": "MSFT", "date": "2025-11-25 03:00:00", "title": "UNICEPTA LAUNCHES INTEGRATION WITH MICROSOFT 365 COPILOT TO SIMPLIFY REPUTATION INTELLIGENCE", "text": "THE INTEGRATION EMPOWERS STAKEHOLDERS TO ACT ON INSIGHTS INSTANTLY, REDUCING COMPLEXITY AND ACCELERATING REPUTATION MANAGEMENT. COLOGNE, GERMANY AND NEW YORK , NOV. 25, 2025 /PRNEWSWIRE/ -- UNICEPTA, A GLOBAL MEDIA INTELLIGENCE PROVIDER WITHIN THE MARKETING CLOUD, PART OF STAGWELL (NASDAQ: STGW), TODAY ANNOUNCED THE LAUNCH OF AN INTEGRATION WITH MICROSOFT 365 COPILOT TO MAKE ITS REPUTATION AND MEDIA INTELLIGENCE CAPABILITIES DIRECTLY ACCESSIBLE WITHIN COPILOT."}, {"symbol": "MSFT", "date": "2025-11-24 09:16:00", "title": "ADVANCE®AI JOINS THE MICROSOFT FOR STARTUPS PEGASUS PROGRAM TO BUILD FAST AND SCALE SMART", "text": "LONDON--(BUSINESS WIRE)--ADVANCE®AI, A LEADING INNOVATOR IN PHARMACEUTICAL-SPECIFIC AI SOLUTIONS, IS EXCITED TO ANNOUNCE OUR ACCEPTANCE INTO THE MICROSOFT FOR STARTUPS PEGASUS PROGRAM. THIS COLLABORATION PROVIDES ADVANCE®AI WITH ACCESS TO POWERFUL AI TOOLS, MICROSOFT EXPERTISE, AND A GLOBAL CUSTOMER NETWORK TO HELP SCALE FASTER AND SMARTER. “JOINING THE MICROSOFT FOR STARTUPS PEGASUS PROGRAM IS A GAME-CHANGER,” SAID GARY PAGE, CEO OF ADVANCE®AI. “WE'RE BUILDING THE FUTURE OF FIELD-BASED HEALTHC."}, {"symbol": "MSFT", "date": "2025-11-24 08:00:00", "title": "SENZING ENTITY RESOLUTION AI NOW AVAILABLE ON MICROSOFT MARKETPLACE FOR RISK & FRAUD DETECTION AND KYC", "text": "LAS VEGAS--(BUSINESS WIRE)-- #ENTITYRESOLUTION--SENZING, DEVELOPERS OF INDUSTRY-LEADING ENTITY RESOLUTION TECHNOLOGY, TODAY ANNOUNCED THE ARRIVAL OF THE SENZING® AI FOR ENTITY RESOLUTION ON THE MICROSOFT MARKETPLACE. DELIVERED AS AN SDK, SENZING ENTITY RESOLUTION ENABLES STREAMLINED DEPLOYMENT ON THE AZURE CLOUD PLATFORM TO ENHANCE RISK AND FRAUD DETECTION AND KNOW YOUR CUSTOMER (KYC) INITIATIVES WITH THE WORLD'S MOST ADVANCED ENTITY RESOLUTION. THE SENZING SDK PROVIDES FLEXIBLE DEPLOYMENT CHOICES FOR AZURE. FOR L."}, {"symbol": "MSFT", "date": "2025-11-20 16:15:00", "title": "C3 AI DEEPENS NATIVE INTEGRATIONS ACROSS MICROSOFT COPILOT, FABRIC, AND AZURE AI FOUNDRY", "text": "REDWOOD CITY, CALIF.--(BUSINESS WIRE)--C3 AI (NYSE: AI), THE ENTERPRISE AI APPLICATION SOFTWARE COMPANY, TODAY ANNOUNCED THE AVAILABILITY OF EXPANDED INTEGRATIONS ACROSS MICROSOFT COPILOT, MICROSOFT FABRIC, AND AZURE AI FOUNDRY, ENABLING CUSTOMERS TO UNIFY REASONING, DATA, AND MODEL OPERATIONS IN A SINGLE ENTERPRISE AI SYSTEM RUNNING ON THE MICROSOFT CLOUD. THESE ENHANCEMENTS BUILD ON YEARS OF COLLABORATION BETWEEN C3 AI AND MICROSOFT AND MAKE IT EASIER FOR CUSTOMERS TO DEPLOY, MANAGE, AND SCAL."}, {"symbol": "MSFT", "date": "2025-11-20 12:00:00", "title": "CREDO AI NOW AVAILABLE IN MICROSOFT MARKETPLACE", "text": "SAN FRANCISCO--(BUSINESS WIRE)--CREDO AI TODAY ANNOUNCED THAT ITS AI GOVERNANCE PLATFORM OF THE SAME NAME IS NOW AVAILABLE IN THE MICROSOFT MARKETPLACE, THE UNIFIED ONLINE DESTINATION FOR CUSTOMERS TO BUY TRUSTED CLOUD SOLUTIONS, AI APPS, AND AGENTS TO MEET THEIR BUSINESS NEEDS. CREDO AI CUSTOMERS CAN NOW DISCOVER AND DEPLOY TRUSTED SOLUTIONS THROUGH MICROSOFT MARKETPLACE, WITH SMOOTH INTEGRATION AND STREAMLINED MANAGEMENT ACROSS MICROSOFT AZURE AND OTHER MICROSOFT PRODUCTS. THIS MILESTONE DEEP."}, {"symbol": "MSFT", "date": "2025-11-20 06:15:00", "title": "OPTIONS EXPANDS MICROSOFT CLOUD SOLUTION PARTNER (CSP) DIRECT BILL CAPABILITIES TO LATIN AMERICA AND THE CARIBBEAN REGION, MARKING SIXTH GLOBAL REGION OF COVERAGE", "text": "NEW YORK & LONDON & HONG KONG--(BUSINESS WIRE)--OPTIONS EXPANDS MICROSOFT CLOUD SOLUTION PARTNER (CSP) DIRECT BILL CAPABILITIES TO LATIN AMERICA AND THE CARIBBEAN REGION."}, {"symbol": "MSFT", "date": "2025-11-20 05:00:00", "title": "EX-MICROSOFT PRIVACY HEAD JULIE BRILL AND MIT'S DANIEL WEITZNER JOIN ETHYCA BOARD TO ADVANCE CONTEXT-AWARE DATA INFRASTRUCTURE FOR AI", "text": "NEW YORK--(BUSINESS WIRE)--ETHYCA, THE ENTERPRISE SOFTWARE COMPANY BUILDING CONTEXT-AWARE DATA INFRASTRUCTURE FOR THE AI ERA, TODAY ANNOUNCED THE APPOINTMENT OF JULIE BRILL, EXPERT-IN-RESIDENCE AT HARVARD, FORMER CHIEF PRIVACY OFFICER AT MICROSOFT, AND FORMER COMMISSIONER OF THE U.S. FEDERAL TRADE COMMISSION, AND DANIEL WEITZNER, DIRECTOR OF MIT'S INTERNET POLICY RESEARCH INITIATIVE AND FORMER U.S. DEPUTY CHIEF TECHNOLOGY OFFICER, TO ITS BOARD OF DIRECTORS. BRILL AND WEITZNER JOIN ETHYCA AT A M."}, {"symbol": "MSFT", "date": "2025-11-19 10:39:00", "title": "M365 SHOW DEBUTS A NEW MICRO-PODCAST FORMAT FOR MICROSOFT 365 PROFESSIONALS WITH TWO DAILY EPISODES ALONGSIDE INDEPENDENT CREATOR MIRKO PETERS", "text": "THE INDEPENDENT MICROSOFT 365 PODCAST SURPASSES 300 EPISODES AND 100,000 LINKEDIN FOLLOWERS, OPENING DOORS FOR STRUCTURED GUEST INTAKE AND SPONSORSHIP. THE INDEPENDENT MICROSOFT 365 PODCAST SURPASSES 300 EPISODES AND 100,000 LINKEDIN FOLLOWERS, OPENING DOORS FOR STRUCTURED GUEST INTAKE AND SPONSORSHIP."}, {"symbol": "MSFT", "date": "2025-11-19 09:16:00", "title": "INTELEPEER SUPERCHARGES AI PLATFORM WITH MICROSOFT AZURE COSMOS DB FOR ENTERPRISE-GRADE PERFORMANCE", "text": "DANIA BEACH, FLA.--(BUSINESS WIRE)--INTELEPEER, AN END-TO-END CONVERSATIONAL AND AGENTIC AI PLATFORM PROVIDER, TODAY ANNOUNCED IT HAS INTEGRATED ADVANCED CAPABILITIES OF MICROSOFT AZURE COSMOS DB INTO ITS CONVERSATIONAL AND AGENTIC AI PLATFORM, GIVING MULTI-LOCATION HEALTHCARE ORGANIZATIONS AND MEDICAL PRACTICES ENTERPRISE-GRADE PERFORMANCE AND SCALABILITY FOR DELIVERING SUPERIOR PATIENT EXPERIENCES. THE RESULT OF A COLLABORATIVE EFFORT BY ENGINEERING TEAMS AT INTELEPEER AND MICROSOFT, THE INTE."}, {"symbol": "MSFT", "date": "2025-11-19 08:40:00", "title": "CRASHPLAN DEEPENS COLLABORATION WITH MICROSOFT TO STRENGTHEN ENTERPRISE DATA RESILIENCE", "text": "MINNEAPOLIS--(BUSINESS WIRE)--CRASHPLAN EXPANDS MICROSOFT PARTNERSHIP WITH M365 ARCHIVING, AI-SEARCH INNOVATION, AND WILL SHOWCASE THESE ADVANCEMENTS AT MICROSOFT IGNITE 2025."}, {"symbol": "MSFT", "date": "2025-11-19 08:30:00", "title": "KASISTO POWERS AI FOR BANKING ACROSS THE MICROSOFT ENTERPRISE ECOSYSTEM", "text": "NEW YORK--(BUSINESS WIRE)-- #AIFORBANKING--KASISTO, A LEADER IN BANKING AI, TODAY ANNOUNCED THAT ITS KAIGENTIC PLATFORM IS ONE OF THE FIRST AGENTIC PLATFORMS INTEGRATED WITH MICROSOFT AGENT 365, ENABLING FINANCIAL INSTITUTIONS TO DEPLOY INTELLIGENT, COMPLIANT BANKING AI AGENTS ACROSS THE MICROSOFT ENTERPRISE ECOSYSTEM. THE INTEGRATION ALLOWS BANKS USING MICROSOFT 365 TO MANAGE DOMAIN SPECIFIC AI AGENTS THAT TRANSFORM CUSTOMER ENGAGEMENT, ELEVATE EMPLOYEE PRODUCTIVITY, AND DRIVE OPERATIONAL EFFICIENCY WITHIN TH."}, {"symbol": "MSFT", "date": "2025-11-19 02:14:00", "title": "ATOS ANNOUNCES THE AVAILABILITY OF AUTONOMOUS DATA & AI ENGINEER, AN AGENTIC AI SOLUTION ON MICROSOFT AZURE, POWERED BY THE ATOS POLARIS AI PLATFORM", "text": "PRESS RELEASE ATOS ANNOUNCES THE AVAILABILITY OF AUTONOMOUS DATA & AI ENGINEER, AN AGENTIC AI SOLUTION ON MICROSOFT AZURE, POWERED BY THE ATOS POLARIS AI PLATFORM THE AGENTIC AI SOLUTIONS WILL BE ON LIVE DEMO AT THE ATOS BOOTH AT MICROSOFT IGNITE, TAKING PLACE IN SAN FRANCISCO FROM NOVEMBER 18 TO 21 PARIS, FRANCE – NOVEMBER 18, 2025 – ATOS, A GLOBAL LEADER IN AI-POWERED DIGITAL TRANSFORMATION AND A MICROSOFT FRONTIER PARTNER FOR AI TECHNOLOGIES, TODAY ANNOUNCES THE AVAILABILITY OF AN AGENTIC AI SOLUTION: AUTONOMOUS DATA AND AI ENGINEER TO AUGMENT THE CAPABILITIES AND VELOCITY OF DATA AND AI ENGINEERING TEAMS. THIS SOLUTION IS POWERED BY THE ATOS POLARIS AI PLATFORM, INTEGRATED WITH AZURE'S ADVANCED CLOUD AND AI CAPABILITIES, LAUNCHED EARLIER THIS YEAR, ENABLING COMPREHENSIVE SYSTEMS OF AI AGENTS WORKING AUTONOMOUSLY TO ORCHESTRATE COMPLEX WORKFLOWS."}, {"symbol": "MSFT", "date": "2025-11-18 17:00:00", "title": "KORE.AI SELECTED AS LAUNCH PARTNER FOR MICROSOFT AGENT 365 TO ACCELERATE ENTERPRISE AI ADOPTION", "text": "ORLANDO, FLA.--(BUSINESS WIRE)--KORE.AI, A GLOBAL LEADER IN ENTERPRISE AGENTIC AI PLATFORMS AND SOLUTIONS, TODAY ANNOUNCED THAT IT WILL BE A RELEASE PARTNER FOR MICROSOFT AGENT 365, UNVEILED AT MICROSOFT IGNITE 2025 IN SAN FRANCISCO. AS PART OF THIS COLLABORATION, KORE.AI GAINED EARLY ACCESS TO INTEGRATE WITH THE MICROSOFT AGENT 365 ECOSYSTEM, ACCELERATING THE ADOPTION OF AI AGENTS IN DAILY WORK. THE INTEGRATION BRINGS KORE.AI'S AI FOR WORK SOLUTION AND AI AGENTS BUILT ON KORE.AI AGENT PLATFORM."}, {"symbol": "MSFT", "date": "2025-11-18 16:39:00", "title": "ESRI INTRODUCES LATEST ARCGIS INTEGRATIONS FOR MICROSOFT FABRIC", "text": "REDLANDS, CALIF.--(BUSINESS WIRE)--ESRI, THE GLOBAL LEADER IN LOCATION INTELLIGENCE, TODAY ANNOUNCED GENERAL AVAILABILITY OF ARCGIS GEOANALYTICS FOR MICROSOFT FABRIC. ALSO NOW IN PUBLIC PREVIEW IS ARCGIS MAPS FOR MICROSOFT FABRIC, A MAPPING TOOL ENABLING USERS TO EASILY ADD CONTEXT WITH BUSINESS, LIFESTYLE, DEMOGRAPHIC, AND ENVIRONMENTAL DATA TO ENRICH ENTERPRISE DATA IN MICROSOFT ONELAKE. “THIS INTEGRATION MAKES SOME OF ESRI'S CORE CAPABILITIES ACCESSIBLE FOR DATA PROFESSIONALS DIRECTLY FROM T."}, {"symbol": "MSFT", "date": "2025-11-18 16:30:00", "title": "ASTERA LABS' LEO CXL SMART MEMORY CONTROLLERS ON MICROSOFT AZURE M-SERIES VIRTUAL MACHINES OVERCOME THE MEMORY WALL", "text": "SAN JOSE, CALIF., NOV. 18, 2025 (GLOBE NEWSWIRE) -- ASTERA LABS, INC. (NASDAQ: ALAB), A LEADER IN SEMICONDUCTOR-BASED CONNECTIVITY SOLUTIONS FOR RACK-SCALE AI INFRASTRUCTURE, TODAY ANNOUNCED ITS LEO CXL SMART MEMORY CONTROLLERS ENABLE CUSTOMERS TO EVALUATE COMPUTE EXPRESS LINK® (CXL®) MEMORY EXPANSION CAPABILITIES FOR THEIR SPECIFIC WORKLOADS IN THE AZURE M-SERIES VIRTUAL MACHINES (VMS) PREVIEW."}, {"symbol": "MSFT", "date": "2025-11-18 16:00:00", "title": "TANIUM SECURITY TRIAGE AGENT AND TANIUM SECURITY TRIAGE AGENT WITH IDENTITY INSIGHTS NOW GENERALLY AVAILABLE IN MICROSOFT SECURITY COPILOT", "text": "ORLANDO, FLA.--(BUSINESS WIRE)--ORLANDO WORLD CENTER MARRIOTT – TANIUM, A LEADER IN AUTONOMOUS IT, ANNOUNCED TODAY THE GENERAL AVAILABILITY OF TANIUM SECURITY TRIAGE AGENT AND TANIUM SECURITY TRIAGE AGENT WITH IDENTITY INSIGHTS IN MICROSOFT SECURITY COPILOT. \"AGENTIC AI IS TRANSFORMING THE WORKFLOWS USED BY SECURITY OPERATIONS TO RESPOND, PRIORITIZE AND ACT,” SAID DAN VARGA, VICE PRESIDENT OF ENGINEERING AT TANIUM. “THROUGH OUR COLLABORATION WITH MICROSOFT, WE'VE BUILT A NEW CLASS OF AI-DRIVEN."}, {"symbol": "MSFT", "date": "2025-11-18 15:30:00", "title": "REPLY AT MICROSOFT IGNITE 2025: SHOWCASING AI INNOVATION, COPILOT EXPERIENCES, AND INTELLIGENT ENTERPRISE SOLUTIONS", "text": "CHICAGO--(BUSINESS WIRE)--REPLY [EXM, STAR: REY] IS TAKING PART IN MICROSOFT IGNITE 2025, A PREMIER EVENT FOR TECHNOLOGY PROFESSIONALS AND DECISION-MAKERS HOSTED BY MICROSOFT, HELD FROM NOVEMBER 18 TO 21 IN SAN FRANCISCO, CALIFORNIA. A TRUSTED MICROSOFT PARTNER SINCE 1996, REPLY EMPOWERS ORGANIZATIONS TO INNOVATE WITH MICROSOFT TECHNOLOGIES, DRIVING AGILITY, INTELLIGENCE, AND SUSTAINABLE GROWTH. WITH MORE THAN 2,000 MICROSOFT CERTIFICATIONS ACROSS ITS NETWORK OF COMPANIES – INCLUDING BUSINESS E."}, {"symbol": "MSFT", "date": "2025-11-18 15:07:00", "title": "VAST DATA PARTNERS WITH MICROSOFT TO POWER THE NEXT WAVE OF AGENTIC AI", "text": "MICROSOFT AZURE CUSTOMERS WILL GAIN ACCESS TO THE VAST AI OS, BUILT FOR THE DEMANDS OF AGENTIC AI IN HYBRID AND MULTI-CLOUD ENVIRONMENTS MICROSOFT AZURE CUSTOMERS WILL GAIN ACCESS TO THE VAST AI OS, BUILT FOR THE DEMANDS OF AGENTIC AI IN HYBRID AND MULTI-CLOUD ENVIRONMENTS"}, {"symbol": "MSFT", "date": "2025-11-18 15:05:00", "title": "ONESTREAM DEEPENS STRATEGIC ALLIANCE WITH MICROSOFT TO ACCELERATE AI ADOPTION AND VALUE FOR OFFICE OF THE CFO", "text": "ONESTREAM'S SENSIBLEAI™  AGENTS TO INTEGRATE WITH MICROSOFT'S TRUSTED CLOUD AND PRODUCTIVITY PLATFORMS, TRANSFORMING HOW FINANCE TEAMS WORK SAN FRANCISCO , NOV. 18, 2025 /PRNEWSWIRE/ -- ANNOUNCED TODAY AT MICROSOFT IGNITE 2025, ONESTREAM (NASDAQ: OS)—A LEADING ENTERPRISE FINANCE MANAGEMENT PLATFORM THAT MODERNIZES THE OFFICE OF THE CFO BY UNIFYING CORE FINANCE AND OPERATIONAL FUNCTIONS—HAS ENTERED INTO A STRATEGIC ALLIANCE WITH MICROSOFT, UNDERSCORING A SHARED COMMITMENT TO ACCELERATING THE ADOPTION OF ARTIFICIAL INTELLIGENCE (AI) ACROSS ENTERPRISE FINANCE TEAMS. THIS INTEGRATION BRINGS TOGETHER ONESTREAM'S FI NANCIALLY INTELLIGENT SENSIBLEAI™ AGENT TECHNOLOGY WITH MICROSOFT 365 AND AZURE TO DELIVER VALUE FOR FINANCE LEADERS."}, {"symbol": "MSFT", "date": "2025-11-18 15:05:00", "title": "CHECK POINT SOFTWARE COLLABORATES WITH MICROSOFT TO DELIVER ENTERPRISE-GRADE AI SECURITY FOR MICROSOFT COPILOT STUDIO", "text": "CHECK POINT SOFTWARE BRINGS ENTERPRISE-GRADE AI SECURITY TO MICROSOFT COPILOT STUDIO, HELPING ORGANIZATIONS SAFELY BUILD AND DEPLOY GENERATIVE-AI AGENTS."}, {"symbol": "MSFT", "date": "2025-11-18 15:05:00", "title": "NEW RELIC INTRODUCES AGENTIC AI INTEGRATIONS WITH MICROSOFT AZURE TO REDUCE MTTR AND BOOST DEVELOPER PRODUCTIVITY", "text": "SAN FRANCISCO--(BUSINESS WIRE)--MICROSOFT IGNITE—NEW RELIC, THE INTELLIGENT OBSERVABILITY COMPANY, ANNOUNCED NEW AGENTIC INTEGRATIONS WITH MICROSOFT AZURE THAT DELIVER NEW RELIC'S INTELLIGENT OBSERVABILITY INSIGHTS DIRECTLY TO THE AZURE SRE AGENT AND MICROSOFT FOUNDRY. THE INNOVATIONS — DELIVERED BY NEW RELIC'S AI MODEL CONTEXT PROTOCOL (MCP) SERVER AND AZURE MONITOR — MEET CUSTOMERS WHERE THEY WORK AND ADDRESS THE CORE CHALLENGES THAT DEVELOPERS, DEVOPS, AND SITE RELIABILITY ENGINEERS (SRES) F."}, {"symbol": "MSFT", "date": "2025-11-18 15:01:00", "title": "QUANTEXA ANNOUNCES GENERAL AVAILABILITY OF QUANTEXA UNIFY FOR MICROSOFT FABRIC", "text": "LONDON, NOV. 18, 2025 (GLOBE NEWSWIRE) -- QUANTEXA, THE GLOBAL PIONEER IN DECISION INTELLIGENCE (DI), TODAY ANNOUNCED THE GENERAL AVAILABILITY OF QUANTEXA UNIFY FOR MICROSOFT FABRIC, MARKING A MAJOR MILESTONE IN HELPING ENTERPRISES BUILD CONNECTED, HIGH-QUALITY DATA ESTATES TO UNLOCK THE FULL POTENTIAL OF ANALYTICS AND AI. QUANTEXA UNIFY FOR MICROSOFT FABRIC IS AVAILABLE NOW ON THE MICROSOFT MARKETPLACE."}, {"symbol": "MSFT", "date": "2025-11-18 15:00:00", "title": "SECURE NETWORK SUPERVISOR BY AVIATRIX® NOW GENERALLY AVAILABLE IN MICROSOFT SECURITY COPILOT", "text": "SANTA CLARA, CALIF., NOV. 18, 2025 (GLOBE NEWSWIRE) -- AVIATRIX ® TODAY ANNOUNCED THE GENERAL AVAILABILITY OF ITS SECURE NETWORK SUPERVISOR IN MICROSOFT SECURITY COPILOT.   “AI IS THE FORCE MULTIPLIER FOR DEFENDERS, AND WHEN PARTNERS BRING THEIR AGENTIC INNOVATION INTO THE SECURITY COPILOT ECOSYSTEM, THE IMPACT IS EXPONENTIAL. TOGETHER, WE'RE NOT JUST BUILDING TOOLS—WE'RE CREATING A NEW ERA OF INTELLIGENT, COLLABORATIVE CYBER DEFENSE,” SAID VASU JAKKAL, CORPORATE VICE PRESIDENT, MICROSOFT SECURITY."}, {"symbol": "MSFT", "date": "2025-11-18 15:00:00", "title": "VARONIS ANNOUNCES NEW MICROSOFT PURVIEW DSPM INTEGRATION", "text": "MIAMI AND SAN FRANCISCO, NOV. 18, 2025 (GLOBE NEWSWIRE) -- IGNITE 2025 – VARONIS SYSTEMS, INC. (NASDAQ: VRNS), ANNOUNCES ITS DSPM INTEGRATION WITH MICROSOFT PURVIEW. BY INTEGRATING VARONIS SIGNALS INTO PURVIEW, DATA SECURITY TEAMS GAIN UNIFIED VISIBILITY INTO SENSITIVE DATA ACROSS THIRD-PARTY PLATFORMS LIKE SALESFORCE ALONGSIDE THEIR MICROSOFT DATA."}, {"symbol": "MSFT", "date": "2025-11-18 15:00:00", "title": "NERDIO ANNOUNCES SUPPORT FOR MICROSOFT AZURE VIRTUAL DESKTOP FOR HYBRID ENVIRONMENTS TO HELP ON-PREMISES VDI USERS MODERNIZE", "text": "CHICAGO, IL, NOV. 18, 2025 (GLOBE NEWSWIRE) -- NERDIO, THE AUTOMATED END-USER COMPUTING (EUC) PLATFORM TRANSFORMING HOW ORGANIZATIONS DEPLOY AND MANAGE MICROSOFT CLOUD TECHNOLOGIES, TODAY ANNOUNCED SUPPORT FOR THE NEWLY REVEALED MICROSOFT AZURE VIRTUAL DESKTOP FOR HYBRID ENVIRONMENTS."}, {"symbol": "MSFT", "date": "2025-11-18 15:00:00", "title": "CRIBL EXPANDS COLLABORATION WITH MICROSOFT, SIMPLIFIES REAL-TIME INSIGHTS WITH DEDICATED MICROSOFT FABRIC REAL-TIME INTELLIGENCE INTEGRATION", "text": "CRIBL LISTED AS A NEW DATA SOURCE WITHIN MICROSOFT FABRIC, ACCELERATING TIME-TO-VALUE AND ENABLING CUSTOMERS TO EASILY ONBOARD AND OPTIMIZE DATA FOR REAL-TIME ANALYSIS CRIBL LISTED AS A NEW DATA SOURCE WITHIN MICROSOFT FABRIC, ACCELERATING TIME-TO-VALUE AND ENABLING CUSTOMERS TO EASILY ONBOARD AND OPTIMIZE DATA FOR REAL-TIME ANALYSIS"}, {"symbol": "MSFT", "date": "2025-11-18 15:00:00", "title": "NEXLA PARTNERS WITH MICROSOFT TO SUPERCHARGE MICROSOFT 365 COPILOT WITH ACCESS TO 500-PLUS ENTERPRISE DATA SOURCES", "text": "NEW INTEGRATION ENABLES MICROSOFT 365 COPILOT USERS TO SEAMLESSLY CONNECT AND LEVERAGE A WIDE ARRAY OF THIRD-PARTY AND INTERNAL DATA, ACCELERATING ENTERPRISE AI PRODUCTIVITY AND UNLOCKING RICHER BUSINESS INSIGHTS NEW INTEGRATION ENABLES MICROSOFT 365 COPILOT USERS TO SEAMLESSLY CONNECT AND LEVERAGE A WIDE ARRAY OF THIRD-PARTY AND INTERNAL DATA, ACCELERATING ENTERPRISE AI PRODUCTIVITY AND UNLOCKING RICHER BUSINESS INSIGHTS"}, {"symbol": "MSFT", "date": "2025-11-18 15:00:00", "title": "DEVREV LAUNCHES INTEGRATION WITH MICROSOFT FABRIC TO HELP ENTERPRISES UNIFY DATA FOR AI WORKFLOWS", "text": "SAN FRANCISCO--(BUSINESS WIRE)--DEVREV, AN AI-NATIVE ENTERPRISE SOFTWARE COMPANY TRANSFORMING HOW TEAMS COLLABORATE, TODAY ANNOUNCED THE AVAILABILITY OF A NEW INTEGRATION BETWEEN ITS AI TEAMMATE, COMPUTER, AND MICROSOFT FABRIC, MICROSOFT'S AI-POWERED DATA PLATFORM. THIS INTEGRATION ALLOWS ORGANIZATIONS TO ENHANCE DEVREV'S CUSTOMER AND PRODUCT DATA WITH THEIR ENTERPRISE DATA FROM MICROSOFT ONELAKE—FABRIC'S UNIFIED DATA LAKE—CREATING A UNIFIED SOURCE OF TRUTH FOR AI-DRIVEN INSIGHTS AND CUSTOMER-F."}, {"symbol": "MSFT", "date": "2025-11-18 15:00:00", "title": "COHESITY ACCELERATES SIGNIFICANT GROWTH AND MOMENTUM IN AI-POWERED DATA SECURITY THROUGH MICROSOFT PARTNERSHIP", "text": "SANTA CLARA, CALIF.--(BUSINESS WIRE)-- #AI--COHESITY, THE LEADER IN AI-POWERED DATA SECURITY, TODAY ANNOUNCED EXCEPTIONAL GROWTH AND INNOVATION MILESTONES IN COLLABORATION WITH MICROSOFT, REFLECTING THEIR SHARED MISSION TO HELP ORGANIZATIONS STRENGTHEN RESILIENCE, ACCELERATE RECOVERY, AND UNLOCK THE POWER OF GENERATIVE AI AT SCALE. IN FISCAL YEAR 2025 (AUGUST 2024 – JULY 2025), COHESITY'S BUSINESS WITH MICROSOFT EXPANDED RAPIDLY, REFLECTING DEEP JOINT INNOVATION AND SHARED CUSTOMER SUCCESS ACROSS THE."}, {"symbol": "MSFT", "date": "2025-11-18 15:00:00", "title": "CLICKHOUSE STRENGTHENS COLLABORATION WITH MICROSOFT THROUGH MICROSOFT ONELAKE INTEGRATION FOR SEAMLESS DATA INTEROPERABILITY", "text": "SAN FRANCISCO--(BUSINESS WIRE)-- #CLICKHOUSE--CLICKHOUSE INC., THE COMPANY BEHIND ONE OF THE WORLD'S FASTEST AND MOST POPULAR REAL-TIME ANALYTICS DATABASES, TODAY ANNOUNCED THE AVAILABILITY OF A POWERFUL NEW INTEGRATION WITH MICROSOFT ONELAKE, THE UNIFIED DATA LAKE OF MICROSOFT FABRIC. THIS INTEGRATION ENABLES ORGANIZATIONS TO HARNESS THE SCALE, GOVERNANCE, AND SIMPLICITY OF ONELAKE WITH THE SPEED AND FLEXIBILITY OF CLICKHOUSE FOR REAL-TIME, LARGE-SCALE ANALYTICAL WORKLOADS. LEARN MORE IN OUR TECHNICAL POST."}, {"symbol": "MSFT", "date": "2025-11-18 15:00:00", "title": "CYERA SECURES THE AGENTIC AI ERA IN COLLABORATION WITH MICROSOFT PURVIEW, SENTINEL, ENTRA, AND COPILOT STUDIO", "text": "NEW YORK--(BUSINESS WIRE)--CYERA, AN INDUSTRY-LEADING AI AND DATA SECURITY COMPANY, TODAY ANNOUNCED AN EXPANDED COLLABORATION WITH MICROSOFT TO SECURE AGENTIC AI. THIS BOTH DEEPENS AND BROADENS DATA INTELLIGENCE FOR CUSTOMERS OF MICROSOFT PURVIEW, MICROSOFT SENTINEL, MICROSOFT ENTRA, AND COPILOT STUDIO, AND WOULD BE AVAILABLE IN THE MICROSOFT SECURITY STORE. TOGETHER WITH MICROSOFT, CYERA'S UNIFIED DSP AND AI GUARDIAN PRODUCTS DELIVER A DATA-CENTRIC FOUNDATION THAT HELPS ORGANIZATIONS IDENTIFY."}, {"symbol": "MSFT", "date": "2025-11-18 15:00:00", "title": "CITRIX SHOWCASES SECURE WORK INNOVATIONS AT MICROSOFT IGNITE", "text": "FORT LAUDERDALE, FLA.--(BUSINESS WIRE)--TODAY, CITRIX, A BUSINESS UNIT OF CLOUD SOFTWARE GROUP, INC., A PREMIER SECURE APPLICATION ACCESS PROVIDER, ANNOUNCED TWO NEW CAPABILITIES DESIGNED TO SIMPLIFY AND OPTIMIZE HOW ORGANIZATIONS SECURE THE WORK. TIMED FOR RELEASE AT MICROSOFT IGNITE 2025 CONFERENCE, THESE INNOVATIONS DEEPEN CITRIX'S COLLABORATION WITH MICROSOFT AND EXTEND THE POWER OF THE CITRIX® PLATFORM. CITRIX SUPPORT FOR MICROSOFT ENTRA SINGLE SIGN-ON FOR VIRTUAL WORKSPACES CITRIX NOW BRI."}, {"symbol": "MSFT", "date": "2025-11-18 14:05:00", "title": "ZACKS INVESTMENT RESEARCH BRINGS AI-READY EQUITY RESEARCH TO MICROSOFT 365 COPILOT", "text": "FINANCIAL PROFESSIONALS CAN NOW POWER THEIR WORK AND DELIVER INSTANT INSIGHTS USING ZACKS' PROPRIETARY EQUITY RESEARCH AND DATA WITH MICROSOFT 365 COPILOT. FINANCIAL PROFESSIONALS CAN NOW POWER THEIR WORK AND DELIVER INSTANT INSIGHTS USING ZACKS' PROPRIETARY EQUITY RESEARCH AND DATA WITH MICROSOFT 365 COPILOT."}, {"symbol": "MSFT", "date": "2025-11-18 13:07:00", "title": "NEW RSA AGENT FOR ADMIN THREATS NOW GENERALLY AVAILABLE IN MICROSOFT SECURITY COPILOT", "text": "SAN FRANCISCO--(BUSINESS WIRE)--RSA SECURITY TODAY ANNOUNCED THE GENERAL AVAILABILITY OF ITS RSA ADVISOR FOR ADMIN THREATS AGENT IN MICROSOFT SECURITY COPILOT. “AI IS THE FORCE MULTIPLIER FOR DEFENDERS, AND WHEN PARTNERS BRING THEIR AGENTIC INNOVATION INTO THE SECURITY COPILOT ECOSYSTEM, THE IMPACT IS EXPONENTIAL. TOGETHER, WE'RE NOT JUST BUILDING TOOLS—WE'RE CREATING A NEW ERA OF INTELLIGENT, COLLABORATIVE CYBER DEFENSE.” - VASU JAKKAL, CORPORATE VICE PRESIDENT, MICROSOFT SECURITY. “WE ACCELER."}, {"symbol": "MSFT", "date": "2025-11-18 12:00:00", "title": "ZENITY ANNOUNCES INLINE PREVENTION FOR MICROSOFT FOUNDRY AND GENERAL AVAILABILITY FOR CAPABILITIES IN MICROSOFT COPILOT STUDIO", "text": "NEW YORK--(BUSINESS WIRE)-- #AIAGENTSECURITYSUMMIT--ZENITY, A LEADING END-TO-END SECURITY AND GOVERNANCE PLATFORM FOR AI AGENTS, TODAY ANNOUNCED AN INLINE PREVENTION SOLUTION FOR MICROSOFT FOUNDRY, CREATED TO MEET ENTERPRISE SECURITY AND COMPLIANCE NEEDS. THIS LAUNCH ALSO MARKS THE GENERAL AVAILABILITY OF ZENITY'S INLINE PREVENTION CAPABILITIES FOR MICROSOFT COPILOT STUDIO, ENABLING ORGANIZATIONS TO IMPLEMENT REAL-TIME CONTROLS ON AGENTS BUILT, DEPLOYED AND OPERATED ACROSS THE MICROSOFT AGENTIC STACK. MICROSOFT FOUNDRY."}, {"symbol": "MSFT", "date": "2025-11-18 11:31:00", "title": "GLEAN INTEGRATES WITH MICROSOFT AGENT 365 TO DELIVER ENTERPRISE-READY AI WHERE MICROSOFT 365 USERS WORK", "text": "PALO ALTO, CALIF.--(BUSINESS WIRE)--WORK AI LEADER GLEAN TODAY ANNOUNCED AN INTEGRATION WITH MICROSOFT AGENT 365, BRINGING GLEAN'S SECURE, ENTERPRISE-GRADE AI DIRECTLY INTO THE DAILY FLOW OF WORK FOR MICROSOFT 365 USERS. AS A LAUNCH PARTNER FOR AGENT 365, GLEAN ENABLES ENTERPRISES TO DELIVER CONTEXT-RICH ASSISTANCE ACROSS THE MICROSOFT 365 APPS LIKE OUTLOOK, WORD, TEAMS, AND MORE, TRANSFORMING HOW EMPLOYEES FIND INFORMATION, AUTOMATE TASKS, AND ACT WITH CONFIDENCE. BY INTEGRATING GLEAN WITH AGE."}, {"symbol": "MSFT", "date": "2025-11-18 11:30:00", "title": "SOPHOS INTEGRATES ADVANCED CYBER INTELLIGENCE INTO MICROSOFT SECURITY COPILOT AND MICROSOFT 365 COPILOT", "text": "SOPHOS INTEGRATES INTELIX THREAT INTELLIGENCE INTO MICROSOFT SECURITY COPILOT AND 365 COPILOT, EMPOWERING GLOBAL DEFENDERS WITH AI-DRIVEN CYBERSECURITY."}, {"symbol": "MSFT", "date": "2025-11-18 11:30:00", "title": "SOPHOS RECOGNIZED WITH MICROSOFT VERIFIED SMALL AND MEDIUM BUSINESS (SMB) SOLUTION STATUS", "text": "OXFORD, UNITED KINGDOM, NOV. 18, 2025 (GLOBE NEWSWIRE) -- SOPHOS , A GLOBAL LEADER OF INNOVATIVE SECURITY SOLUTIONS FOR DEFEATING CYBERATTACKS, TODAY ANNOUNCED ITS INTEGRATION WITH MICROSOFT DEFENDER FOR BUSINESS, MICROSOFT DEFENDER FOR ENDPOINT, AND THAT ITS SOPHOS MDR FOR MICROSOFT ENVIRONMENTS SOLUTION HAS ACHIEVED MICROSOFT VERIFIED SMALL & MEDIUM BUSINESS (SMB) SOLUTION STATUS THROUGH THE MICROSOFT INTELLIGENT SECURITY ASSOCIATION (MISA). MICROSOFT'S VERIFIED SMB SOLUTION STATUS HIGHLIGHTS THE CRUCIAL ROLE OF PARTNER COLLABORATION IN PROTECTING SMALL AND MEDIUM BUSINESSES AGAINST INCREASING CYBERATTACKS."}, {"symbol": "MSFT", "date": "2025-11-18 10:59:00", "title": "PROOFPOINT SATORI™ EMERGING THREATS INTELLIGENCE AGENT NOW GENERALLY AVAILABLE FOR MICROSOFT SECURITY COPILOT", "text": "SUNNYVALE, CALIF.--(BUSINESS WIRE)--PROOFPOINT, INC., A LEADING CYBERSECURITY AND COMPLIANCE COMPANY, TODAY ANNOUNCED THE GENERAL AVAILABILITY OF ITS PROOFPOINT SATORI™ EMERGING THREATS INTELLIGENCE AGENT FOR MICROSOFT SECURITY COPILOT. “AI IS THE FORCE MULTIPLIER FOR DEFENDERS, AND WHEN PARTNERS BRING THEIR AGENTIC INNOVATION INTO THE SECURITY COPILOT ECOSYSTEM, THE IMPACT IS EXPONENTIAL. TOGETHER, WE'RE NOT JUST BUILDING TOOLS—WE'RE CREATING A NEW ERA OF INTELLIGENT, COLLABORATIVE CYBER DEFEN."}, {"symbol": "MSFT", "date": "2025-11-18 10:00:00", "title": "DEVOLUTIONS UNVEILS SECURE AI INTEGRATION IN REMOTE DESKTOP MANAGER AT MICROSOFT IGNITE", "text": "DEVOLUTIONS ANNOUNCED THE LAUNCH OF ITS MODEL CONTEXT PROTOCOL SERVER – A SECURE AUTOMATION LAYER THAT CONNECTS AI ASSISTANTS WITH REMOTE DESKTOP MANAGER."}, {"symbol": "MSFT", "date": "2025-11-18 09:00:00", "title": "BITTITAN SHOWCASES NEXT-GENERATION MIGRATION INNOVATION AT MICROSOFT IGNITE 2025", "text": "SAN FRANCISCO--(BUSINESS WIRE)--BITTITAN, A GLOBAL LEADER IN CLOUD MIGRATION AUTOMATION, TODAY ANNOUNCED A NEW PARTNERSHIP WITH POWERSYNCPRO AND TWO NEW SOLUTIONS: DIRECTORY SYNC AND MIGRATION AGENT, WITHIN THE BITTITAN MIGRATION PORTFOLIO. ALONGSIDE MIGRATIONWIZ®, THESE OFFERINGS ENABLE ORGANIZATIONS AND MANAGED SERVICE PROVIDERS TO MODERNIZE MICROSOFT 365 AND ENTRA ID ENVIRONMENTS, LAYING THE FOUNDATION FOR FUTURE INNOVATION AND AI ADOPTION. AS ENTERPRISES ACCELERATE CLOUD AND AI-DRIVEN PRODU."}, {"symbol": "MSFT", "date": "2025-11-18 09:00:00", "title": "QURE.AI PARTNERS WITH MICROSOFT TO INCREASE ACCESS TO ITS LUNG CANCER DETECTION AND MANAGEMENT SUITE IN THE U.S.", "text": "NEW YORK--(BUSINESS WIRE)--QURE.AI, A TIME100 MOST INFLUENTIAL COMPANY AND GLOBAL LEADER IN DIGITAL HEALTHCARE, TODAY ANNOUNCED ITS COLLABORATION WITH MICROSOFT. QURE.AI WILL ONBOARD ITS END-TO-END LUNG CANCER DETECTION, MEASUREMENT AND MANAGEMENT SUITE OF AI-POWERED SOLUTIONS ONTO THE PRECISION IMAGING NETWORK. THIS WILL STREAMLINE DEPLOYMENT OF QURE.AI SOLUTIONS TO HOSPITALS AND HEALTH SYSTEMS ACROSS THE USA, DRIVING DIGITAL HEALTHCARE TRANSFORMATION, IMPROVED TECH INTEGRATIONS AND ULTIMATELY."}, {"symbol": "MSFT", "date": "2025-11-18 09:00:00", "title": "NINJAONE NAMED MICROSOFT RMM PARTNER FOR WINDOWS 365 BUSINESS", "text": "AUSTIN, TEXAS--(BUSINESS WIRE)--NINJAONE®, THE AUTOMATED ENDPOINT MANAGEMENT PLATFORM, TODAY ANNOUNCED A COLLABORATION WITH MICROSOFT TO INTEGRATE NINJAONE'S REMOTE MONITORING AND MANAGEMENT (RMM) INTO THE WINDOWS 365 BUSINESS EDITION. THIS EDITION OF THE WINDOWS 365 CLOUD SOLUTION IS DESIGNED SPECIFICALLY FOR SMALL AND MEDIUM-SIZED BUSINESSES (SMBS) WITH UP TO 300 USERS, OFFERING A SIMPLE, COST-EFFECTIVE WAY TO PROVIDE SECURE, PERSONALIZED CLOUD PCS WITHOUT THE NEED FOR COMPLEX IT INFRASTRUCTU."}, {"symbol": "MSFT", "date": "2025-11-18 09:00:00", "title": "NINJAONE ANNOUNCES MICROSOFT INTUNE INTEGRATION TO SIMPLIFY ENDPOINT MANAGEMENT AND BOOST PRODUCTIVITY", "text": "AUSTIN, TEXAS--(BUSINESS WIRE)--NINJAONE®, THE AUTOMATED ENDPOINT MANAGEMENT PLATFORM, TODAY ANNOUNCED AN INTEGRATION WITH MICROSOFT INTUNE THAT STREAMLINES THE INGESTION OF INTUNE DEVICE DATA INTO NINJAONE, IMPROVING ENDPOINT VISIBILITY, MANAGEMENT, AND COMPLIANCE. THE INTEGRATION SIMPLIFIES IT, MAKING IT TEAMS AND MANAGED SERVICE PROVIDERS (MSPS) MORE EFFICIENT AND PRODUCTIVE. CURRENTLY AVAILABLE IN EARLY ACCESS, THE INTEGRATION WILL BE GENERALLY AVAILABLE BY THE END OF THE YEAR. IT TEAMS AND."}, {"symbol": "MSFT", "date": "2025-11-18 09:00:00", "title": "ATROPOS HEALTH LAUNCHES THE ATROPOS EVIDENCE™ AGENT WITH MICROSOFT TEAMS TO SURFACE PERSONALIZED EVIDENCE DURING MULTIDISCIPLINARY CARE TEAM COLLABORATIONS", "text": "PALO ALTO, CALIF.--(BUSINESS WIRE)--ATROPOS HEALTH, A PIONEER IN TRANSLATING REAL-WORLD CLINICAL DATA INTO PERSONALIZED REAL-WORLD EVIDENCE (RWE) AND INSIGHTS, TODAY ANNOUNCED THE ATROPOS EVIDENCE™ AGENT, AN EXPERT AGENT IN GENERATING RWE INTEGRATED WITH MICROSOFT TEAMS FOR THE DELIVERY OF PERSONALIZED EVIDENCE. MULTIDISCIPLINARY CARE TEAM MEMBERS CAN CALL THE ATROPOS EVIDENCE AGENT DURING A MICROSOFT TEAMS SESSION AND THE ATROPOS EVIDENCE AGENT WILL DELIVER PERSONALIZED RWE FOR CLINICAL DECISI."}, {"symbol": "MSFT", "date": "2025-11-18 07:00:00", "title": "PROTIVITI RECEIVES 2025-2026 MICROSOFT AI BUSINESS SOLUTIONS INNER CIRCLE AWARD", "text": "PROTIVITI IS HONORED BY MICROSOFT FOR OUTSTANDING ACHIEVEMENT AND INNOVATION MENLO PARK, CALIF. , NOV. 18, 2025 /PRNEWSWIRE/ -- GLOBAL CONSULTING FIRM PROTIVITI HAS BEEN SELECTED FOR THE AI BUSINESS SOLUTION'S 2025-2026 MICROSOFT INNER CIRCLE."}, {"symbol": "MSFT", "date": "2025-11-17 12:00:00", "title": "SPLASHTOP ENHANCES MICROSOFT® INTUNE® AND MICROSOFT® ENTRA® TO DELIVER GREATER SECURITY AND CONTROL IN HYBRID WORKSPACES", "text": "AT MICROSOFT IGNITETM 2025, SPLASHTOP SHOWCASES GROWING ADOPTION OF COMPLEMENTARY SOLUTIONS FOR MICROSOFT USERS, INCLUDING PASSWORDLESS AUTHENTICATION, REMOTE SUPPORT AND AUTONOMOUS ENDPOINT MANAGEMENT THAT MODERNIZE AND SECURE HYBRID ENVIRONMENTS. AT MICROSOFT IGNITETM 2025, SPLASHTOP SHOWCASES GROWING ADOPTION OF COMPLEMENTARY SOLUTIONS FOR MICROSOFT USERS, INCLUDING PASSWORDLESS AUTHENTICATION, REMOTE SUPPORT AND AUTONOMOUS ENDPOINT MANAGEMENT THAT MODERNIZE AND SECURE HYBRID ENVIRONMENTS."}, {"symbol": "MSFT", "date": "2025-11-17 10:32:00", "title": "AALO ATOMICS COLLABORATES WITH MICROSOFT TO ADVANCE AI-DRIVEN SOLUTIONS IN NUCLEAR", "text": "AUSTIN, TEXAS--(BUSINESS WIRE)--AALO ATOMICS, A LEADING INNOVATOR IN ADVANCED NUCLEAR ENERGY SYSTEMS, ANNOUNCES A SUCCESSFUL COLLABORATION WITH MICROSOFT ON GENERATIVE AI FOR PERMITTING, MARKING A MILESTONE IN APPLYING ARTIFICIAL INTELLIGENCE TO ACCELERATE CLEAN-ENERGY INFRASTRUCTURE DEVELOPMENT. THE INITIATIVE RAPIDLY ITERATED ON THE USE OF MICROSOFT'S GENERATIVE AI FOR ENERGY PERMITTING SOLUTION ACCELERATOR AND AI AGENTS TO STREAMLINE COMPLEX REGULATORY AND OPERATIONAL WORKFLOWS ACROSS AALO'S."}, {"symbol": "MSFT", "date": "2025-11-17 09:47:00", "title": "MICROSOFT'S XBOX PARTNERS WITH ESW TO EXPAND DESIGN LAB INTO 27 COUNTRIES", "text": "NEW YORK--(BUSINESS WIRE)--MICROSOFT'S XBOX DESIGN LAB HAS RELAUNCHED AND EXPANDED DISTRIBUTION INTO 27 COUNTRIES THROUGH ITS NEW PARTNERSHIP WITH ESW."}, {"symbol": "MSFT", "date": "2025-11-17 09:00:00", "title": "VARONIS RECOGNIZED AS A FINALIST FOR THE 2025 MICROSOFT PARTNER OF THE YEAR AWARD IN THE MARKETPLACE CATEGORY", "text": "MIAMI, NOV. 17, 2025 (GLOBE NEWSWIRE) -- VARONIS SYSTEMS, INC. (NASDAQ: VRNS), THE DATA SECURITY LEADER, ANNOUNCED IT HAS BEEN NAMED A FINALIST OF THE MARKETPLACE CATEGORY 2025 MICROSOFT PARTNER OF THE YEAR AWARD. THE COMPANY WAS HONORED AMONG A GLOBAL FIELD OF TOP MICROSOFT PARTNERS FOR DEMONSTRATING EXCELLENCE IN INNOVATION AND IMPLEMENTATION OF CUSTOMER SOLUTIONS BASED ON MICROSOFT TECHNOLOGY."}, {"symbol": "MSFT", "date": "2025-11-13 11:55:00", "title": "COGNIZANT TO ACQUIRE 3CLOUD, CREATING A LEADING FORCE IN MICROSOFT AZURE SERVICES AND ENTERPRISE AI TRANSFORMATION", "text": "ADVANCES COGNIZANT'S AI BUILDER STRATEGY, EMPOWERING CLIENTS TO RAPIDLY BUILD, DEPLOY, AND SCALE ENTERPRISE AI SOLUTIONS ON MODERN INFRASTRUCTURE GEARED TOWARDS AI-DRIVEN OPERATIONS. WILL COMBINE 3CLOUD'S AZURE, DATA AND AI, AND APP INNOVATION EXPERTISE WITH COGNIZANT'S GLOBAL SCALE, TECHNOLOGY FRAMEWORKS AND INDUSTRY EXPERTISE TO CREATE ONE OF THE LARGEST GLOBAL MICROSOFT PARTNERS."}, {"symbol": "MSFT", "date": "2025-11-13 09:00:00", "title": "CUEZEN RECOGNIZED AS 2025 MICROSOFT PARTNER OF THE YEAR AWARD FINALIST", "text": "SEATTLE & SINGAPORE--(BUSINESS WIRE)--CUEZEN, AN AI-POWERED PERSONALIZATION PLATFORM FOR HEALTH, TODAY ANNOUNCED IT HAS BEEN NAMED A FINALIST OF THE 2025 MICROSOFT FOR STARTUPS PARTNER OF THE YEAR AWARD. THE COMPANY WAS HONORED AMONG A GLOBAL FIELD OF TOP MICROSOFT PARTNERS FOR DEMONSTRATING EXCELLENCE IN INNOVATION AND IMPLEMENTATION OF CUSTOMER SOLUTIONS BASED ON MICROSOFT TECHNOLOGY. ACROSS THE WORLD, HEALTH ENTERPRISES ARE GRAPPLING WITH DECLINING MEMBER ENGAGEMENT, WIDENING CARE GAPS, AND."}, {"symbol": "MSFT", "date": "2025-11-13 09:00:00", "title": "TD SYNNEX RECOGNIZED AS THE WINNER OF 2025 MICROSOFT GLOBAL DEVICE PARTNER OF THE YEAR", "text": "FREMONT, CALIF. & CLEARWATER, FLA.--(BUSINESS WIRE)--TD SYNNEX (NYSE:SNX), A LEADING GLOBAL DISTRIBUTOR AND SOLUTIONS AGGREGATOR FOR THE IT ECOSYSTEM, TODAY ANNOUNCED IT HAS WON THE GLOBAL DEVICE 2025 MICROSOFT PARTNER OF THE YEAR AWARD. THE COMPANY WAS HONORED AMONG A GLOBAL FIELD OF TOP MICROSOFT PARTNERS FOR DEMONSTRATING EXCELLENCE IN INNOVATION AND IMPLEMENTATION OF CUSTOMER SOLUTIONS BASED ON MICROSOFT TECHNOLOGY. THE COMPANY ALSO EARNED FINALIST DESIGNATION FOR THE GLOBAL MICROSOFT DISTR."}, {"symbol": "MSFT", "date": "2025-11-13 08:00:00", "title": "DRUVA EXPANDS CYBER RESILIENCE FOR MICROSOFT AND AZURE ENVIRONMENTS", "text": "SANTA CLARA, CALIF.--(BUSINESS WIRE)--DRUVA, A LEADING PROVIDER OF DATA SECURITY, TODAY ANNOUNCED THE EXPANSION OF ITS MICROSOFT ECOSYSTEM COVERAGE WITH A SERIES OF NEW CAPABILITIES DESIGNED TO STRENGTHEN CYBER RESILIENCE AND SIMPLIFY PROTECTION FOR ENTERPRISE ENVIRONMENTS. THE NEW CAPABILITIES HELP ENTERPRISES ENSURE CLEAN AND TIMELY RECOVERY OF BUSINESS-CRITICAL MICROSOFT DATA WITH ZERO INFRASTRUCTURE COMPLEXITY. ENTERPRISES RELY ON MICROSOFT WORKLOADS TO POWER OPERATIONS, COLLABORATION, AND."}, {"symbol": "MSFT", "date": "2025-11-13 07:00:00", "title": "RSA ANNOUNCES NEW SOLUTION TO ENHANCE SECURITY FOR MICROSOFT ENTRA ID", "text": "BURLINGTON, MASS.--(BUSINESS WIRE)--RSA, THE SECURITY-FIRST IDENTITY LEADER, ANNOUNCED TODAY THAT RSA® ID PLUS FOR MICROSOFT, A NEW SOLUTION CATEGORY THAT PROVIDES AN ENHANCED SECURITY LAYER FOR MICROSOFT ENTRA ID, IS NOW GENERALLY AVAILABLE. NOW ON THE MICROSOFT AZURE MARKETPLACE, THE FIRST PRODUCT, RSA ID PLUS M1, INCLUDES KEY CAPABILITIES THAT DEFEND ORGANIZATIONS FROM EMERGING ATTACKS AND HELP THEM MAINTAIN OPERATIONAL CONTINUITY IN BOTH MICROSOFT AND NON-MICROSOFT ENVIRONMENTS. RSA ID PLUS."}, {"symbol": "MSFT", "date": "2025-11-12 17:01:00", "title": "MOVEWORKS RECOGNIZED AS A WINNER OF 2025 MICROSOFT AMERICAS PARTNER OF THE YEAR AWARDS", "text": "MOUNTAIN VIEW, CALIF.--(BUSINESS WIRE)--MOVEWORKS, THE AGENTIC AI ASSISTANT PLATFORM FOR THE ENTERPRISE, TODAY ANNOUNCED IT HAS WON THE 2025 AMERICAS PARTNER OF THE YEAR SDC EMERGING AWARD. THE COMPANY RECEIVED RECOGNITION AMONG A GROUP OF TOP MICROSOFT PARTNERS FOR DEMONSTRATING INNOVATION AND SUCCESSFULLY DELIVERING CUSTOMER SOLUTIONS USING MICROSOFT TECHNOLOGIES. THE MICROSOFT AMERICAS PARTNER OF THE YEAR AWARDS ACKNOWLEDGE MICROSOFT PARTNERS WHO HAVE CREATED AND DELIVERED EXCEPTIONAL MICROS."}, {"symbol": "MSFT", "date": "2025-11-12 15:30:00", "title": "VALOREM REPLY RECOGNIZED AS WINNER OF 2025 MICROSOFT INCLUSION CHANGEMAKER PARTNER OF THE YEAR", "text": "TURIN, ITALY--(BUSINESS WIRE)--VALOREM REPLY, THE REPLY GROUP COMPANY SPECIALIZING IN MICROSOFT TECHNOLOGIES AND AI-DRIVEN, CLOUD-NATIVE SOLUTIONS, ANNOUNCED TODAY IT HAS WON THE 2025 MICROSOFT INCLUSION CHANGEMAKER PARTNER OF THE YEAR AWARD. THE COMPANY WAS HONORED AMONG A GLOBAL FIELD OF TOP MICROSOFT PARTNERS FOR DEMONSTRATING EXCELLENCE IN INNOVATION AND IMPLEMENTATION OF CUSTOMER SOLUTIONS BASED ON MICROSOFT TECHNOLOGY. “WE'RE PROUD OF VALOREM REPLY FOR EARNING THIS RECOGNITION,” SAID FILI."}, {"symbol": "MSFT", "date": "2025-11-12 15:05:00", "title": "FAROS AI RECOGNIZED AS THE WINNER OF 2025 MICROSOFT FOR STARTUPS PARTNER OF THE YEAR", "text": "SAN MATEO, CALIF.--(BUSINESS WIRE)-- #AICODINGASSISTANTS--FAROS AI, THE AI TRANSFORMATION PARTNER FOR SOFTWARE ENGINEERING ORGANIZATIONS, TODAY ANNOUNCED IT HAS WON THE MICROSOFT FOR STARTUPS 2025 MICROSOFT PARTNER OF THE YEAR AWARD. FAROS AI WAS HONORED AMONG A GLOBAL FIELD OF TOP MICROSOFT PARTNERS FOR DEMONSTRATING EXCELLENCE IN INNOVATION AND IMPLEMENTATION OF CUSTOMER SOLUTIONS BASED ON MICROSOFT TECHNOLOGY. “THIS RECOGNITION REFLECTS THE POWER OF OUR COLLABORATION TO SOLVE ONE OF ENTERPRISE SOFTWARE DEVELOPMEN."}, {"symbol": "MSFT", "date": "2025-11-12 15:02:00", "title": "WILLOW RECOGNIZED AS A FINALIST FOR 2025 MICROSOFT EDUCATION PARTNER OF THE YEAR AWARD", "text": "SEATTLE--(BUSINESS WIRE)--WILLOW TECHNOLOGY CORPORATION LTD. (“WILLOW”), A LEADING OPERATIONAL AI COMPANY , TODAY ANNOUNCED IT HAS BEEN NAMED A FINALIST FOR THE 2025 MICROSOFT EDUCATION PARTNER OF THE YEAR AWARD. THE COMPANY WAS HONORED AMONG A GLOBAL FIELD OF TOP MICROSOFT PARTNERS FOR DEMONSTRATING EXCELLENCE IN INNOVATION AND IMPLEMENTATION OF CUSTOMER SOLUTIONS BASED ON MICROSOFT TECHNOLOGY. THE RECOGNITION HIGHLIGHTS WILLOW'S ROLE IN HELPING EDUCATIONAL INSTITUTIONS TRANSFORM HOW THEIR BUI."}, {"symbol": "MSFT", "date": "2025-11-12 15:00:00", "title": "TANIUM RECOGNIZED AS A WINNER OF 2025 MICROSOFT AMERICAS PARTNER OF THE YEAR AWARDS", "text": "EMERYVILLE, CALIF.--(BUSINESS WIRE)--TANIUM, A LEADER IN AUTONOMOUS ENDPOINT MANAGEMENT (AEM), TODAY ANNOUNCED IT HAS WON THE 2025 AMERICAS PARTNER OF THE YEAR SOFTWARE DEVELOPMENT COMPANY US AWARD, MARKING THE THIRD CONSECUTIVE YEAR OF EARNING A MICROSOFT PARTNER OF THE YEAR HONOR. TANIUM WAS RECOGNIZED FOR ITS CONTINUED INNOVATION AND FOR SUCCESSFULLY DELIVERING JOINT SOLUTIONS USING MICROSOFT TECHNOLOGIES TO SOLVE SOME OF THE BIGGEST SECURITY CHALLENGES FACED BY MUTUAL CUSTOMERS. TANIUM AND."}, {"symbol": "MSFT", "date": "2025-11-12 15:00:00", "title": "FIVETRAN NAMED WINNER OF THE 2025 MICROSOFT MARKETPLACE PARTNER OF THE YEAR AWARD", "text": "OAKLAND, CALIF.--(BUSINESS WIRE)--FIVETRAN, THE TRUSTED DATA FOUNDATION FOR THE AI ERA, TODAY ANNOUNCED IT HAS BEEN NAMED THE WINNER OF THE 2025 MICROSOFT MARKETPLACE PARTNER OF THE YEAR AWARD AND A FINALIST FOR THE 2025 MICROSOFT AMERICAS SDC (SOFTWARE DEVELOPMENT COMPANY) EMERGING PARTNER OF THE YEAR AWARD. FIVETRAN WAS HONORED AMONG LEADING MICROSOFT PARTNERS WORLDWIDE FOR ITS INNOVATION AND EXCELLENCE IN DELIVERING CUSTOMER SOLUTIONS BUILT ON MICROSOFT TECHNOLOGY. “THIS RECOGNITION REFLECTS."}, {"symbol": "MSFT", "date": "2025-11-12 15:00:00", "title": "ARROW ELECTRONICS RECOGNIZED AS 2025 MICROSOFT DISTRIBUTION PARTNER OF THE YEAR", "text": "CENTENNIAL, COLO.--(BUSINESS WIRE)--GLOBAL TECHNOLOGY SOLUTIONS PROVIDER ARROW ELECTRONICS HAS WON 2025 MICROSOFT DISTRIBUTOR PARTNER OF THE YEAR. THE COMPANY WAS HONORED AMONG A GLOBAL FIELD OF TOP MICROSOFT PARTNERS FOR DEMONSTRATING EXCELLENCE IN INNOVATION AND IMPLEMENTATION OF CUSTOMER SOLUTIONS BASED ON MICROSOFT TECHNOLOGY. ARROW WAS RECOGNIZED AS 2025 DISTRIBUTOR PARTNER OF THE YEAR FOR ITS ARROWSPHERE AI OFFERINGS, INCLUDING ARROWSPHERE ASSISTANT, THAT HELP ITS MICROSOFT CHANNEL PARTNE."}, {"symbol": "MSFT", "date": "2025-11-12 12:08:00", "title": "ADL AND JLENS RECOMMEND AGAINST BDS-ALIGNED SHAREHOLDER PROPOSAL AT MICROSOFT ANNUAL MEETING", "text": "NEW YORK--(BUSINESS WIRE)--JLENS, A REGISTERED INVESTMENT ADVISOR, AND ADL (THE ANTI-DEFAMATION LEAGUE), TODAY CALLED UPON SHAREHOLDERS OF MICROSOFT CORPORATION (NASDAQ: MSFT) TO VOTE AGAINST PROPOSAL 9, A SHAREHOLDER RESOLUTION THAT THEY BELIEVE REPRESENTS A POLITICALLY MOTIVATED, BDS-ALIGNED CAMPAIGN DESIGNED TO STIGMATIZE LAWFUL BUSINESS WITH ISRAEL AND EXPOSE MICROSOFT TO SIGNIFICANT FINANCIAL, LEGAL, AND REPUTATIONAL RISKS RATHER THAN PROMOTE GENUINE HUMAN RIGHTS OVERSIGHT. THE PROPOSAL IS."}, {"symbol": "MSFT", "date": "2025-11-12 09:03:00", "title": "MARC BROWN, FORMER MICROSOFT CVP, JOINS SYNCRO BOARD OF DIRECTORS AMID STRATEGIC ITSM INITIATIVES AND ACCELERATED GROWTH", "text": "TAMPA, FLA.--(BUSINESS WIRE)--MARC BROWN, FORMER MICROSOFT CVP, JOINS THE SYNCRO BOARD OF DIRECTORS AMID STRATEGIC ITSM INITIATIVES AND ACCELERATED GROWTH."}, {"symbol": "MSFT", "date": "2025-11-12 08:00:00", "title": "VASION WELCOMES CINDY WHITE CYBERSECURITY EXPERT AND FORMER MICROSOFT MARKETING LEADER AS CHIEF MARKETING OFFICER", "text": "ST. GEORGE, UTAH--(BUSINESS WIRE)-- #CMO--VASION, A LEADER IN SERVERLESS PRINTING AND AI-ENABLED AUTOMATION, TODAY ANNOUNCED THE APPOINTMENT OF CINDY WHITE AS CHIEF MARKETING OFFICER, EFFECTIVE OCTOBER 2025. AS ORGANIZATIONS ACCELERATE THEIR TRANSITION TO THE CLOUD, VASION IS REDEFINING WHAT'S POSSIBLE IN THE PRINT AND PROCESS AUTOMATION LANDSCAPE. VASION ENABLES TENS OF THOUSANDS OF GLOBAL CUSTOMERS TO START WITH INTELLIGENT PRINT AND MOVE TO PRINT INTELLIGENCE, REMOVING FRICTION, COST, AND RISK FROM."}, {"symbol": "MSFT", "date": "2025-11-10 08:09:00", "title": "INBRAIN NEUROELECTRONICS ANNOUNCES COLLABORATION WITH MICROSOFT TO ADVANCE AGENTIC AI FOR PRECISION NEUROLOGY AND BRAIN-COMPUTER INTERFACE THERAPEUTICS", "text": "BARCELONA, SPAIN--(BUSINESS WIRE)-- #BCI--INBRAIN NEUROELECTRONICS, A BRAIN-COMPUTER INTERFACE THERAPEUTICS (BCI-TX) COMPANY DEVELOPING GRAPHENE-BASED NEURAL TECHNOLOGIES, TODAY ANNOUNCED A STRATEGIC COLLABORATION WITH MICROSOFT TO EXPLORE THE USE OF AGENTIC ARTIFICIAL INTELLIGENCE (AI) POWERED BY MICROSOFT'S CLOUD AND DATA INFRASTRUCTURE TO ADVANCE REAL-TIME PRECISION NEUROLOGY AND NEXT-GENERATION BRAIN-COMPUTER INTERFACE (BCI) THERAPEUTICS. THE PARTNERSHIP WILL LEVERAGE MICROSOFT'S AZURE AI INFRASTR."}, {"symbol": "MSFT", "date": "2025-11-06 06:00:00", "title": "VENA SOLVES FP&A DATA FRAGMENTATION WITH SIX NEW MICROSOFT FABRIC DATA INTEGRATIONS", "text": "TORONTO--(BUSINESS WIRE)--VENA, THE ONLY AI-POWERED PLANNING PLATFORM BUILT FOR THE MICROSOFT TECHNOLOGY ECOSYSTEM, TODAY ANNOUNCED THE GENERAL AVAILABILITY OF SIX NEW PRE-BUILT, SECURE DATA CONNECTORS VIA MICROSOFT FABRIC. AMONG THEM IS THE ONLY PRE-BUILT MICROSOFT FABRIC CONNECTOR FOR MICROSOFT DYNAMICS 365 F&O (FINANCE AND OPERATIONS)—THE PREFERRED INTEGRATION METHOD FOR DYNAMICS F&O DATA WITHIN THE MICROSOFT ECOSYSTEM. THIS MAKES VENA THE ONLY FP&A PLATFORM ENABLING ORGANIZATION."}, {"symbol": "MSFT", "date": "2025-11-05 13:59:00", "title": "UPDATE - NAPSTER AMONG FIRST MICROSOFT PARTNERS TO DEPLOY AZURE AGENTIC AI FOR ENTERPRISES", "text": "BOCA RATON, FLA., NOV. 05, 2025 (GLOBE NEWSWIRE) -- NAPSTER (FORMERLY INFINITE REALITY), AN INNOVATION COMPANY POWERING THE NEXT GENERATION OF EMBODIED AND AGENTIC AI, TODAY ANNOUNCED THE NEXT STEP IN ITS STRATEGIC PARTNERSHIP WITH MICROSOFT AZURE, DELIVERING ENTERPRISE-GRADE AGENTIC AI TO AN EARLY PILOT CUSTOMER."}, {"symbol": "MSFT", "date": "2025-11-05 08:30:00", "title": "PROJECT C.U.R.E. BRIDGE THE GLOBAL HEALTHCARE DIVIDE WITH MISSION-DRIVEN INNOVATION WITH MICROSOFT", "text": "WORKING WITH MICROSOFT TO HELP SAVE LIVES AND PROVIDE MEDICAL RESOURCES AROUND THE WORLD. WORKING WITH MICROSOFT TO HELP SAVE LIVES AND PROVIDE MEDICAL RESOURCES AROUND THE WORLD."}]