[{"symbol": "AAPL", "date": "2026-01-16 15:23:00", "title": "SPARK® GREEN APPLE CANDY MAKES ITS NEW YEAR DEBUT", "text": "RICHARDSON, TEXAS--(BUSINESS WIRE)-- #ADVOCAREREHYDRATE--RING IN THE NEW YEAR WITH SPARK® GREEN APPLE CANDY, AVAILABLE FOR A LIMITED TIME AND BRINGING CRAVE‑WORTHY SWEET CANDY FLAVOR TO FUEL YOUR NEW YEAR. IF YOU LOVE GREEN APPLE-FLAVORED CANDY, THIS IS THE SPARK FLAVOR FOR YOU. SPARK GREEN APPLE CANDY COMBINES VIBRANT TASTE WITH ESSENTIAL VITAMINS, AMINO ACIDS, AND ENERGY SUPPORT THAT SPARK IS KNOWN FOR, HELPING YOU STAY ENERGIZED, FOCUSED, AND FEELING YOUR BEST AS YOU BEGIN NEW ROUTINES IN 2026. “SPARK GREEN APPL."}, {"symbol": "AAPL", "date": "2026-01-16 06:00:00", "title": "RAGNAROK: THE NEW WORLD RANKED NO.1 OF APPLE APP STORE IN TAIWAN, HONG KONG AND MACAU", "text": "SEOULD, SOUTH KOREA, JAN. 16, 2026 (GLOBE NEWSWIRE) -- GRAVITY CO., LTD. (NASDAQGM: GRVY) (“GRAVITY” OR “COMPANY”), A DEVELOPER AND PUBLISHER OF ONLINE AND MOBILE GAMES, ANNOUNCED THAT RAGNAROK: THE NEW WORLD (CHINESE TITLE: RO 仙境傳說： 世界之旅 ), THE FIRST OPEN-WORLD MMORPG MOBILE AND PC GAME, LAUNCHED IN TAIWAN, HONG KONG AND MACAU ON JANUARY 15, 2026 HAS ACHIEVED THE FIRST RANK IN BOTH FREE DOWNLOAD AND TOP GROSSING OF APPLE APP STORE OF ALL THREE REGIONS."}, {"symbol": "AAPL", "date": "2026-01-13 09:00:00", "title": "APPLE INTRODUCES APPLE CREATOR STUDIO, AN INSPIRING COLLECTION OF THE MOST POWERFUL CREATIVE APPS", "text": "CUPERTINO, CALIF.--(BUSINESS WIRE)--APPLE® TODAY UNVEILED APPLE CREATOR STUDIO, A GROUNDBREAKING COLLECTION OF POWERFUL CREATIVE APPS DESIGNED TO PUT STUDIO-GRADE POWER INTO THE HANDS OF EVERYONE, BUILDING ON THE ESSENTIAL ROLE MAC®, IPAD®, AND IPHONE® PLAY IN THE LIVES OF MILLIONS OF CREATORS AROUND THE WORLD. THE APPS INCLUDED WITH APPLE CREATOR STUDIO FOR VIDEO EDITING, MUSIC MAKING, CREATIVE IMAGING, AND VISUAL PRODUCTIVITY GIVE MODERN CREATORS THE FEATURES AND CAPABILITIES THEY NEED TO EXP."}, {"symbol": "AAPL", "date": "2026-01-08 09:20:00", "title": "HUYA REPORTS GOOSE GOOSE DUCK MOBILE RANKING NO. 1 ON APPLE'S FREE APP CHART IN CHINESE MAINLAND", "text": "GUANGZHOU, CHINA, JAN. 8, 2026 /PRNEWSWIRE/ -- HUYA INC. (\"HUYA\" OR THE \"COMPANY\") (NYSE: HUYA), A LEADING GAME-RELATED ENTERTAINMENT AND SERVICES PROVIDER, TODAY ANNOUNCED THE STRONG INITIAL MARKET PERFORMANCE OF GOOSE GOOSE DUCK MOBILE, CO-PUBLISHED BY HUYA AND KINGSOFT SHIYOU, FOLLOWING ITS OPEN BETA LAUNCH IN THE CHINESE MAINLAND ON JANUARY 7, 2026. NOTABLY, THE TITLE RECORDED OVER 5 MILLION NEW REGISTERED USERS WITHIN THE FIRST 24 HOURS OF LAUNCH."}, {"symbol": "AAPL", "date": "2026-01-06 11:10:00", "title": "\"B.U.I.L.T. D1FF3R3NT STUDIO PODCAST\" EARNS TOP 100 RANKING ON APPLE PODCASTS IN EDUCATION CATEGORY", "text": "HOSTED BY STUDENT-ATHLETE SUCCESS COACH RANDY NARCISO, THE PODCAST EXPLORES MINDSET, SYSTEMS, AND HABITS THAT SHAPE CHAMPIONS IN SCHOOL, SPORT, AND LIFE. LOS ANGELES, CALIFORNIA--(NEWSFILE CORP. - JANUARY 6, 2026) - THE B.U.I.L.T."}, {"symbol": "AAPL", "date": "2025-12-17 20:00:00", "title": "APPLE ANNOUNCES CHANGES TO IOS IN JAPAN", "text": "CUPERTINO, CALIF.--(BUSINESS WIRE)--APPLE® TODAY ANNOUNCED CHANGES IMPACTING IOS APPS IN JAPAN TO COMPLY WITH THE MOBILE SOFTWARE COMPETITION ACT (MSCA). THESE UPDATES CREATE NEW OPTIONS FOR DEVELOPERS TO DISTRIBUTE APPS ON ALTERNATIVE APP MARKETPLACES AND TO PROCESS APP PAYMENTS FOR DIGITAL GOODS AND SERVICES OUTSIDE OF APPLE IN-APP PURCHASE. ACROSS THESE CHANGES, APPLE HAS WORKED TO REDUCE NEW PRIVACY AND SECURITY RISKS THE LAW CREATES TO PROVIDE USERS IN JAPAN THE BEST AND SAFEST EXPERIENCE."}, {"symbol": "AAPL", "date": "2025-12-16 10:00:00", "title": "HEXNODE NAMED A LEADER IN IDC MARKETSCAPE: WORLDWIDE UEM SOFTWARE FOR APPLE DEVICES 2025/26 VENDOR ASSESSMENT", "text": "SAN FRANCISCO & LONDON--(BUSINESS WIRE)-- #APPLEDEVICEMANAGEMENT--HEXNODE UEM, THE ENTERPRISE SOFTWARE DIVISION OF MITSOGO INC., ANNOUNCES ITS INCLUSION IN FIVE OF THE IDC MARKETSCAPE: WORLDWIDE UNIFIED ENDPOINT MANAGEMENT SOFTWARE VENDOR ASSESSMENT REPORTS. THE LISTING OFFERS AN ASSESSMENT OF VENDORS IN THE UNIFIED ENDPOINT MANAGEMENT MARKET. HEXNODE HAS BEEN NAMED A LEADER IN THE “IDC MARKETSCAPE: WORLDWIDE UNIFIED ENDPOINT MANAGEMENT SOFTWARE FOR APPLE DEVICES 2025/26 VENDOR ASSESSMENT” (DOC #US53003225, DECEMBER 20."}, {"symbol": "AAPL", "date": "2025-12-10 09:05:00", "title": "ADDIGY APPLE MDM WINS COMPLIANCE SOLUTION OF THE YEAR", "text": "MIAMI--(BUSINESS WIRE)-- #ADDIGY--ADDIGY, THE LEADER IN APPLE DEVICE MANAGEMENT FOR IT TEAMS AND MANAGED SERVICE PROVIDERS (MSPS), TODAY ANNOUNCED IT HAS BEEN NAMED A BEST IN BIZ 2025 SILVER WINNER FOR MOST INNOVATIVE COMPLIANCE SOLUTION OF THE YEAR. THE COMPANY, WHICH ALSO RECENTLY RECEIVED MDM EXCELLENCE AND BEST ROI AWARDS FOR ITS MOBILE DEVICE MANAGEMENT PLATFORM, WAS HONORED FOR PROVIDING THE INDUSTRY'S ONLY REAL-TIME, ONE-CLICK BENCHMARKS THAT SLASH APPLE DEVICE COMPLIANCE TIME FROM MONTHS TO MINUT."}, {"symbol": "AAPL", "date": "2025-12-09 05:49:00", "title": "KLARNA NOW AVAILABLE ON APPLE PAY TO CUSTOMERS IN FRANCE AND ITALY", "text": "NEW YORK--(BUSINESS WIRE)--KLARNA, THE GLOBAL DIGITAL BANK AND FLEXIBLE PAYMENTS PROVIDER, HAS MADE ITS FLEXIBLE PAYMENT PRODUCTS AVAILABLE WHEN CHECKING OUT ON APPLE PAY IN FRANCE AND ITALY. MILLIONS OF ELIGIBLE SHOPPERS CAN NOW CHOOSE KLARNA AT CHECKOUT ONLINE AND IN-APP USING THEIR IPHONE AND IPAD, OR IN-STORE USING THEIR IPHONE, AND THIS INNOVATIVE CAPABILITY DELIVERS EVEN MORE CONVENIENCE, CONTROL, AND TRANSPARENCY TO EVEN MORE CUSTOMERS. THE CONTINUED EXPANSION FOLLOWS STRONG CONSUMER ADO."}, {"symbol": "AAPL", "date": "2025-12-08 10:46:00", "title": "\"LEADERSHIP MESSENGERS\" PODCAST HITS #58 IN THE WORLD ON APPLE PODCASTS IN SOCIETY AND CULTURE CATEGORY", "text": "HOSTED BY OVIDILIO (OVI) VASQUEZ, THE PODCAST OFFERS DEEP INSIGHTS FROM LEADERS IN EDUCATION, BUSINESS, AND BEYOND. SANTA ROSA, CALIFORNIA--(NEWSFILE CORP. - DECEMBER 8, 2025) - THE LEADERSHIP MESSENGERS PODCAST HAS REACHED A SIGNIFICANT MILESTONE, RANKING #58 IN THE SOCIETY AND CULTURE CATEGORY ON APPLE PODCASTS WORLDWIDE."}, {"symbol": "AAPL", "date": "2025-12-04 16:30:00", "title": "APPLE ANNOUNCES EXECUTIVE TRANSITIONS", "text": "CUPERTINO, CALIF.--(BUSINESS WIRE)--APPLE® TODAY ANNOUNCED THAT JENNIFER NEWSTEAD WILL BECOME APPLE'S GENERAL COUNSEL ON MARCH 1, 2026, FOLLOWING A TRANSITION OF DUTIES FROM KATE ADAMS, WHO HAS SERVED AS APPLE'S GENERAL COUNSEL SINCE 2017. SHE WILL JOIN APPLE AS SENIOR VICE PRESIDENT IN JANUARY, REPORTING TO CEO TIM COOK AND SERVING ON APPLE'S EXECUTIVE TEAM. IN ADDITION, LISA JACKSON, VICE PRESIDENT FOR ENVIRONMENT, POLICY, AND SOCIAL INITIATIVES, WILL RETIRE IN LATE JANUARY 2026. THE GOVERNME."}, {"symbol": "AAPL", "date": "2025-12-04 09:00:00", "title": "APPLE UNVEILS THE WINNERS OF THE 2025 APP STORE AWARDS", "text": "CUPERTINO, CALIF.--(BUSINESS WIRE)--APPLE® TODAY ANNOUNCED THE WINNERS OF THE 2025 APP STORE® AWARDS, RECOGNIZING 17 APPS AND GAMES FOR THEIR TECHNICAL INGENUITY AND LASTING CULTURAL IMPACT. THIS YEAR'S TALENTED GROUP OF WINNING DEVELOPERS DELIVERED REMARKABLE EXPERIENCES THAT EMPOWERED USERS TO ACHIEVE MORE, BRING THEIR IDEAS TO LIFE, AND IMMERSE THEMSELVES IN STUNNING WORLDS. THE WINNING APPS AND GAMES WERE HAND-SELECTED BY APP STORE EDITORS FROM A LIST OF 45 FINALISTS FOR DEMONSTRATING EXCEP."}, {"symbol": "AAPL", "date": "2025-12-04 07:12:00", "title": "RP1 ANNOUNCES DEVELOPER ACCESS TO THE SPATIAL INTERNET'S FIRST OPEN ECOSYSTEM", "text": "COLUMBUS, OHIO--(BUSINESS WIRE)---- $AAPL #3DBROWSER--SIX MONTHS AFTER UNVEILING THE WORLD'S FIRST METAVERSE BROWSER AT AWE 2025, RP1 IS OFFICIALLY OPENING ACCESS ON DECEMBER 8, 2025 FOR DEVELOPERS EVERYWHERE TO PLUG INTO THE OPEN SPATIAL INTERNET. RP1 WILL RELEASE THE FIRST PUBLIC SUITE OF TOOLS AND DOCUMENTATION, ALLOWING ANYONE TO BUILD AND SELF-HOST REAL-TIME 3D EXPERIENCES USING THEIR OWN SERVERS WHILE OWNING THEIR DATA AND CONTROLLING THEIR MONETIZATION. THIS PUTS THE POWER DIRECTLY IN THE HANDS OF CREATORS,."}, {"symbol": "AAPL", "date": "2025-12-01 17:10:00", "title": "JOHN GIANNANDREA TO RETIRE FROM APPLE", "text": "CUPERTINO, CALIF.--(BUSINESS WIRE)--APPLE® TODAY ANNOUNCED JOHN GIANNANDREA, APPLE'S SENIOR VICE PRESIDENT FOR MACHINE LEARNING AND AI STRATEGY, IS STEPPING DOWN FROM HIS POSITION AND WILL SERVE AS AN ADVISOR TO THE COMPANY BEFORE RETIRING IN THE SPRING OF 2026. APPLE ALSO ANNOUNCED THAT RENOWNED AI RESEARCHER AMAR SUBRAMANYA HAS JOINED APPLE AS VICE PRESIDENT OF AI, REPORTING TO CRAIG FEDERIGHI. SUBRAMANYA WILL BE LEADING CRITICAL AREAS, INCLUDING APPLE FOUNDATION MODELS, ML RESEARCH, AND AI S."}, {"symbol": "AAPL", "date": "2025-11-25 09:05:00", "title": "T-MOBILE UNWRAPS THE ULTIMATE APPLE BUNDLE — ALL ON US FOR BLACK FRIDAY", "text": "BELLEVUE, WASH.--(BUSINESS WIRE)--T-MOBILE (NASDAQ: TMUS) IS TAKING BLACK FRIDAY TO THE NEXT LEVEL, OFFERING NEARLY $2000 IN SAVINGS WITH AN APPLE BUNDLE AND EVEN MORE WAYS TO SAVE THIS SEASON. STARTING TOMORROW, NOV. 26, NEW AND EXISTING CUSTOMERS, INCLUDING BUSINESSES, CAN SCORE THE BRAND-NEW IPHONE 17 PRO, IPAD (A16) AND APPLE WATCH SE 3, ALL ON US. PLUS, FOR A LIMITED TIME, NEW T-MOBILE 5G HOME INTERNET CUSTOMERS CAN GET A MONTH ON US AND RECEIVE $300 BACK VIA VIRTUAL PREPAID MASTERCARD WHE."}, {"symbol": "AAPL", "date": "2025-11-24 06:00:00", "title": "TOLION HEALTH AI LAUNCHES TOLION BRAIN COACH: THE FIRST AI-POWERED PERSONALIZED MOBILE APP FOR BRAIN HEALTH AND LONGEVITY, NOW AVAILABLE ON THE APPLE APP STORE", "text": "BOSTON--(BUSINESS WIRE)-- #AI--TOLION HEALTH AI, A DIGITAL HEALTH COMPANY FOCUSED ON PERSONALIZED, PREDICTIVE, AND PREVENTIVE BRAIN HEALTH SOLUTIONS, HAS OFFICIALLY LAUNCHED ITS FLAGSHIP MOBILE APP, TOLION BRAIN COACH, POWERED BY TOLION AI, NOW AVAILABLE ON THE APPLE APP STORE IN THE UNITED STATES. TOLION'S LAUNCH MAKES ITS AI-POWERED TOLION BRAIN COACH FREE TO ALL, AIMING TO EXPAND ACCESS TO PROACTIVE BRAIN-HEALTH TOOLS BASED ON CURRENT NEUROSCIENCE. THE APP PROVIDES DAILY EVIDENCE-BASED TIPS FOR CO."}, {"symbol": "AAPL", "date": "2025-11-19 09:43:00", "title": "ECONERGY CONNECTS 52MW RESKO SOLAR PROJECT UNDER APPLE VPPA", "text": "TEL AVIV, ISRAEL AND WARSAW, POLAND, NOV. 19, 2025 (GLOBE NEWSWIRE) -- ECONERGY RENEWABLE ENERGY LTD. (TASE: ECNR), A LEADING EUROPEAN INDEPENDENT POWER PRODUCER (IPP), HAS SUCCESSFULLY CONNECTED ITS 52MW RESKO SOLAR PROJECT IN POLAND TO THE NATIONAL ELECTRICITY GRID."}, {"symbol": "AAPL", "date": "2025-11-18 11:47:00", "title": "\"BEHIND THE STORY PODCAST\" HITS TOP 33 IN APPLE PODCASTS' ARTS CATEGORY, OFFERING ENTREPRENEURS AND CREATORS A PLATFORM TO SHARE THEIR JOURNEYS", "text": "HOSTED BY JELANI GONZALEZ, THE PODCAST EXPLORES LEADERSHIP, IDENTITY, AND RESILIENCE IN THE WORLD OF BUSINESS AND BEYOND. NEW YORK, NEW YORK--(NEWSFILE CORP. - NOVEMBER 18, 2025) - BEHIND THE STORY PODCAST, A NEWLY LAUNCHED SHOW, HAS QUICKLY EARNED RECOGNITION BY REACHING THE TOP 33 IN THE ARTS CATEGORY ON APPLE PODCASTS, SHOWCASING ITS RESONANCE WITH ENTREPRENEURS, ARTISTS, AND BUSINESS LEADERS."}, {"symbol": "AAPL", "date": "2025-11-18 10:22:00", "title": "KLARNA NOW AVAILABLE ON APPLE PAY IN DENMARK, SPAIN, AND SWEDEN WITH FRANCE TO FOLLOW", "text": "NEW YORK--(BUSINESS WIRE)--KLARNA, THE GLOBAL DIGITAL BANK AND FLEXIBLE PAYMENTS PROVIDER, ANNOUNCED TODAY THAT ITS FLEXIBLE PAYMENT PRODUCTS ARE NOW AVAILABLE WHEN CHECKING OUT ON APPLE PAY IN DENMARK, SPAIN, SWEDEN. THE LAUNCH BRINGS EVEN GREATER FLEXIBILITY AND TRANSPARENCY TO APPLE PAY CUSTOMERS IN THESE COUNTRIES, WITH KLARNA AVAILABLE TO ELIGIBLE USERS CHECKING OUT ONLINE AND IN-APP WITH AN IPHONE OR IPAD, AND IN-STORE ON AN IPHONE. THE EXPANSION BUILDS ON SUCCESSFUL LAUNCHES OF THIS FEAT."}, {"symbol": "AAPL", "date": "2025-11-18 01:45:00", "title": "TRIFORK PARTNERS WITH LOFT DYNAMICS TO SCALE QUALIFIED PILOT TRAINING ON APPLE VISION PRO", "text": "PRESS RELEASE TRIFORK PARTNERS WITH LOFT DYNAMICS TO SCALE QUALIFIED PILOT TRAINING ON APPLE VISION PRO SAN FRANCISCO AND DÜBENDORF, SWITZERLAND — NOVEMBER 18, 2025 — LOFT DYNAMICS, THE PIONEER BEHIND THE WORLD'S FIRST EASA- AND FAA-QUALIFIED VIRTUAL REALITY FLIGHT SIMULATORS, ANNOUNCED A STRATEGIC PARTNERSHIP WITH TRIFORK, A GLOBAL TECHNOLOGY COMPANY AND LEADER IN SPATIAL COMPUTING. TOGETHER, THE COMPANIES ARE DEVELOPING AN INDUSTRY-DEFINING SOLUTION CALLED LOFTHOME, AN AT-HOME PILOT TRAINING KIT THAT EXTENDS LOFT DYNAMICS' QUALIFIED TRAINING ECOSYSTEM TO APPLE VISION PRO."}, {"symbol": "AAPL", "date": "2025-11-11 12:00:00", "title": "PRANA LABS SECURES $150K TO ADVANCE VAYU, ITS AI-GUIDED BREATHWORK AND MINDFUL TECHNOLOGY PLATFORM", "text": "VANCOUVER, BRITISH COLUMBIA--(BUSINESS WIRE)---- $AAPL #BREATHWORK--PRANA LABS INC., A VANCOUVER-BASED WELLNESS TECHNOLOGY COMPANY AND CREATOR OF THE AI-POWERED BREATHWORK PLATFORM VAYU, HAS SECURED $150,000 IN GROWTH FUNDING THROUGH NATIONAL INNOVATION PARTNERS. THE INVESTMENT FUELS PRANA LABS' MISSION TO MAKE MINDFUL TECHNOLOGY MORE ACCESSIBLE, MEASURABLE, AND HUMAN-CENTERED. FOUNDED BY DEEPALI RAITHTHA AND DHRUV ADHIA, PRANA LABS BLENDS NEUROSCIENCE, HAPTIC DESIGN, AND AI PERSONALIZATION TO CREATE EMBODIED WELLNE."}, {"symbol": "AAPL", "date": "2025-11-05 09:02:00", "title": "ADDIGY APPLE MDM ADDS PRESTIGIOUS G2 AND SOURCEFORGE AWARDS TO GROWING LIST OF ACCOLADES", "text": "MIAMI--(BUSINESS WIRE)-- #ADDIGY--ADDIGY APPLE MDM IS THE PREFERRED APPLE DEVICE MANAGEMENT PLATFORM, AS RANKED BY MSPS AND IT TEAMS IN G2, SOURCEFORGE AND CHANNEL PROGRAM AWARDS."}, {"symbol": "AAPL", "date": "2025-11-03 06:00:00", "title": "KRAFT MAC & CHEESE UNVEILS NEW APPLE PIE FLAVOR JUST IN TIME FOR THANKSGIVING", "text": "PITTSBURGH & CHICAGO--(BUSINESS WIRE)--KRAFT MAC & CHEESE IS GIVING FANS SOMETHING TO TALK ABOUT AT THE THANKSGIVING TABLE THIS YEAR. INTRODUCING: APPLE PIE FLAVORED KRAFT MAC & CHEESE. MAC & CHEESE AND APPLE PIE ARE TWO OF THE MOST ICONIC THANKSGIVING DISHES AND THIS YEAR, KRAFT MAC & CHEESE IS COMBINING THE TWO HOLIDAY CLASSICS INTO ONE SHOCKINGLY DELICIOUS AND UNFORGETTABLE DISH FOR A LIMITED TIME ONLY. TO ANNOUNCE THE NEW FLAVOR, KRAFT MAC & CHEESE HAS TEAMED UP WITH THE."}, {"symbol": "AAPL", "date": "2025-10-30 16:30:00", "title": "APPLE REPORTS FOURTH QUARTER RESULTS", "text": "CUPERTINO, CALIF.--(BUSINESS WIRE)--APPLE® TODAY ANNOUNCED FINANCIAL RESULTS FOR ITS FISCAL 2025 FOURTH QUARTER ENDED SEPTEMBER 27, 2025. THE COMPANY POSTED QUARTERLY REVENUE OF $102.5 BILLION, UP 8 PERCENT YEAR OVER YEAR. DILUTED EARNINGS PER SHARE WAS $1.85, UP 13 PERCENT YEAR OVER YEAR ON AN ADJUSTED BASIS.1 “TODAY, APPLE IS VERY PROUD TO REPORT A SEPTEMBER QUARTER REVENUE RECORD OF $102.5 BILLION, INCLUDING A SEPTEMBER QUARTER REVENUE RECORD FOR IPHONE AND AN ALL-TIME REVENUE RECORD FOR SER."}, {"symbol": "AAPL", "date": "2025-10-29 08:30:00", "title": "SELLYOURMAC EXPANDS TO CANADA, OFFERING CANADIANS A TRUSTED WAY TO SELL, REUSE, AND RECYCLE APPLE DEVICES", "text": "MISSISSAUGA, ONTARIO & CINCINNATI--(BUSINESS WIRE)--SELLYOURMAC.COM (SYM), A RECOMMERCE AND IT ASSET TRANSITION SERVICE COMPANY COMMITTED TO REUSING, REPURPOSING, AND RECYCLING USED APPLE PRODUCTS, TODAY ANNOUNCED THE LAUNCH OF SELLYOURMAC CANADA, NOW AVAILABLE AT WWW.SELLYOURMAC.CA. CANADIAN CUSTOMERS CAN NOW EASILY AND SECURELY SELL THEIR USED APPLE DEVICES FOR TOP VALUE WHILE CONTRIBUTING TO SUSTAINABILITY AND RESPONSIBLE E-WASTE MANAGEMENT. PART OF THE OTHER WORLD COMPUTING (OWC) FAMILY OF."}, {"symbol": "AAPL", "date": "2025-10-24 04:00:00", "title": "HAUSFELD & CO LLP: UK COMPETITION APPEAL TRIBUNAL RULES IN FAVOUR OF DR KENT: APPLE'S APP STORE PRACTICES BROKE UK AND EU LAW AND UK CONSUMERS AND BUSINESSES ARE OWED APPROXIMATELY £1.5 BILLION", "text": "LONDON--(BUSINESS WIRE)-- #BIGTECH--CAT UNANIMOUSLY RULES IN FAVOUR OF DR RACHAEL KENT IN LANDMARK APPLE CASE."}, {"symbol": "AAPL", "date": "2025-10-16 14:34:00", "title": "OTHER WORLD COMPUTING HELPS POWER THE FUTURE FOR MAC AND IPAD USERS FOLLOWING APPLE'S M5 CHIP ANNOUNCEMENTS", "text": "WOODSTOCK, ILL.--(BUSINESS WIRE)--OTHER WORLD COMPUTING (OWC®), A TRUSTED LEADER IN HIGH-PERFORMANCE STORAGE, MEMORY, CONNECTIVITY, SOFTWARE, AND ACCESSORIES THAT EMPOWER CREATIVE AND BUSINESS PROFESSIONALS TO MAXIMIZE PERFORMANCE, ENHANCE RELIABILITY, AND STREAMLINE WORKFLOWS, TODAY ANNOUNCED A LINEUP OF DOCKS AND DRIVES THAT HELP MAC AND IPAD USERS GET THE MOST FROM APPLE'S NEW M5 CHIP POWERED MACBOOK PRO AND IPAD PRO. WITH APPLE'S NEW M5-POWERED MACBOOK PRO LINEUP, THE DAWN OF ITS ALWAYS-ON,."}, {"symbol": "AAPL", "date": "2025-10-15 10:25:00", "title": "LOGITECH MUSE, THE DIGITAL PENCIL FOR APPLE VISION PRO, LAUNCHES OCTOBER 22ND", "text": "LAUSANNE, SWITZERLAND & SAN JOSE, CALIF.--(BUSINESS WIRE)-- #LOGITECH--LOGITECH (SIX: LOGN) (NASDAQ: LOGI) TODAY ANNOUNCED THE AVAILABILITY OF MUSE, A DIGITAL PENCIL FOR APPLE VISION PRO THAT ENHANCES THE WAY USERS WORK, CREATE, AND COLLABORATE. MUSE COMBINES CUTTING-EDGE TECHNOLOGY WITH EFFORTLESS FUNCTIONALITY TO OFFER USERS PRECISION AND NATURAL INTERACTION FOR SPATIAL COMPUTING. “MUSE UNLOCKS NEW WAYS FOR CREATIVE PROS TO DESIGN, ANNOTATE, AND NAVIGATE WITH PRECISION IN IMMERSIVE APPS,” SAID JOSEPH MIN."}, {"symbol": "AAPL", "date": "2025-10-15 09:00:00", "title": "APPLE INTRODUCES THE POWERFUL NEW IPAD PRO WITH THE M5 CHIP", "text": "CUPERTINO, CALIF.--(BUSINESS WIRE)--APPLE® TODAY INTRODUCED THE NEW IPAD PRO® FEATURING THE INCREDIBLY POWERFUL M5 CHIP. M5 UNLOCKS THE MOST ADVANCED IPAD® EXPERIENCE EVER, PACKING AN INCREDIBLE AMOUNT OF POWER AND AI PERFORMANCE INTO THE ULTRAPORTABLE DESIGN OF IPAD PRO. FEATURING A NEXT-GENERATION GPU WITH A NEURAL ACCELERATOR IN EACH CORE, M5 DELIVERS A BIG BOOST IN PERFORMANCE FOR IPAD PRO USERS, WHETHER THEY'RE WORKING ON CUTTING-EDGE PROJECTS OR TAPPING INTO AI FOR PRODUCTIVITY. THE NEW I."}, {"symbol": "AAPL", "date": "2025-10-15 09:00:00", "title": "APPLE VISION PRO UPGRADED WITH THE POWERFUL M5 CHIP AND COMFORTABLE DUAL KNIT BAND", "text": "CUPERTINO, CALIF.--(BUSINESS WIRE)--APPLE® TODAY INTRODUCED APPLE VISION PRO™ WITH THE POWERFUL M5 CHIP THAT DELIVERS A LEAP FORWARD IN PERFORMANCE, IMPROVED DISPLAY RENDERING, FASTER AI-POWERED WORKFLOWS, AND EXTENDED BATTERY LIFE. THE UPGRADED VISION PRO ALSO COMES WITH THE SOFT, CUSHIONED DUAL KNIT BAND TO HELP USERS ACHIEVE AN EVEN MORE COMFORTABLE FIT, AND VISIONOS® 26, WHICH UNLOCKS INNOVATIVE SPATIAL EXPERIENCES, INCLUDING WIDGETS, NEW PERSONAS, AN INTERACTIVE JUPITER ENVIRONMENT, AND NE."}, {"symbol": "AAPL", "date": "2025-10-15 09:00:00", "title": "APPLE UNLEASHES M5, THE NEXT BIG LEAP IN AI PERFORMANCE FOR APPLE SILICON", "text": "CUPERTINO, CALIF.--(BUSINESS WIRE)--APPLE® TODAY ANNOUNCED M5, DELIVERING THE NEXT BIG LEAP IN AI PERFORMANCE AND ADVANCES TO NEARLY EVERY ASPECT OF THE CHIP. BUILT USING THIRD-GENERATION 3-NANOMETER TECHNOLOGY, M5 INTRODUCES A NEXT-GENERATION 10-CORE GPU ARCHITECTURE WITH A NEURAL ACCELERATOR IN EACH CORE, ENABLING GPU-BASED AI WORKLOADS TO RUN DRAMATICALLY FASTER, WITH OVER 4X THE PEAK GPU COMPUTE PERFORMANCE COMPARED TO M4.1 THE GPU ALSO OFFERS ENHANCED GRAPHICS CAPABILITIES AND THIRD-GENERA."}, {"symbol": "AAPL", "date": "2025-10-15 09:00:00", "title": "APPLE UNVEILS NEW 14-INCH MACBOOK PRO POWERED BY THE M5 CHIP, DELIVERING THE NEXT BIG LEAP IN AI FOR THE MAC", "text": "CUPERTINO, CALIF.--(BUSINESS WIRE)--APPLE® TODAY UNVEILED A NEW 14-INCH MACBOOK PRO®, FEATURING THE INCREDIBLY POWERFUL APPLE M5 CHIP. WITH M5, THE 14-INCH MACBOOK PRO GETS EVEN FASTER, MORE CAPABLE, AND DELIVERS A HUGE LEAP IN AI PERFORMANCE. THE M5 CHIP FEATURES A NEXT-GENERATION GPU WITH A NEURAL ACCELERATOR IN EACH CORE, DELIVERING UP TO 3.5X THE AI PERFORMANCE1 AND UP TO 1.6X FASTER GRAPHICS2 THAN THE PREVIOUS GENERATION. M5 ALSO INCLUDES A FASTER AND MORE EFFICIENT CPU, AN ENHANCED NEURAL."}, {"symbol": "AAPL", "date": "2025-10-14 12:28:00", "title": "FOOD LION FEEDS' APPLE BAG CAMPAIGN DELIVERS 13.8 MILLION MEALS TO NOURISH NEIGHBORS", "text": "CUSTOMERS AND ASSOCIATES HELP FIGHT HUNGER WITH THE CAMPAIGN'S SECOND-LARGEST TOTAL SINCE 2014 CUSTOMERS AND ASSOCIATES HELP FIGHT HUNGER WITH THE CAMPAIGN'S SECOND-LARGEST TOTAL SINCE 2014"}, {"symbol": "AAPL", "date": "2025-10-14 04:01:00", "title": "APPLE HIT HIGHEST EVER THIRD QUARTER AS GLOBAL SMARTPHONE MARKET GREW 3% IN 3Q25 SAYS OMDIA", "text": "LONDON--(BUSINESS WIRE)-- #OMDIA--THE LATEST RESEARCH FROM OMDIA REVEALS THAT THE GLOBAL SMARTPHONE MARKET GREW 3% YEAR ON YEAR IN 3Q25, SIGNALING A RETURN TO GROWTH MOMENTUM DRIVEN BY MAJOR PRODUCT LAUNCHES DURING THE QUARTER. THE REBOUND WAS BOOSTED BY STRONG REPLACEMENT DEMAND AS WELL AS SEVERAL VENDORS PREPARING INVENTORIES ACROSS THE CHANNEL AHEAD OF A HECTIC 4Q25. SAMSUNG MAINTAINED THE POSITION FOR THE THIRD CONSECUTIVE QUARTER WITH A 19% MARKET SHARE, SUPPORTED BY SUSTAINED VOLUME STRENGTH OF IT."}, {"symbol": "AAPL", "date": "2025-10-08 08:00:00", "title": "EAGLE POINT AND APPLE BANK ESTABLISH NEWTON COMMERCIAL FINANCE, A NEW PLATFORM FOR INFRASTRUCTURE PROJECT AND EQUIPMENT FINANCING", "text": "GREENWICH, CONN. & NEW YORK--(BUSINESS WIRE)--EAGLE POINT CREDIT MANAGEMENT LLC (“EAGLE POINT”), A PRIVATE CREDIT INVESTMENT MANAGER AND APPLE BANK, A NEW YORK–BASED REGIONAL BANK PROVIDING CONSUMER, COMMERCIAL AND SMALL BUSINESS BANKING SERVICES, ANNOUNCED TODAY THE CREATION OF NEWTON COMMERCIAL FINANCE (“NEWTON”), AN INNOVATIVE EQUIPMENT FINANCE PLATFORM PROVIDING TAILORED SOLUTIONS TO COMPANIES WITH LIMITED ACCESS TO TRADITIONAL BANK FINANCING PROGRAMS. NEWTON WAS FOUNDED ON A DISCIPLINED AN."}, {"symbol": "AAPL", "date": "2025-10-01 11:01:00", "title": "MEDICAL ISIGHT LAUNCHES XRAIVIEW FOR APPLE VISION PRO", "text": "CLICK LINK TO VIEW APP : HTTPS://APPS.APPLE.COM/US/APP/XRAIVIEW/ID6478872655 LONDON, OCT. 01, 2025 (GLOBE NEWSWIRE) -- IN A FIRST FOR MEDICAL IMAGING ON APPLE VISION PRO, XRAIVIEW ENABLES RAW DICOM IMAGE FILES TO BE LOADED DIRECTLY FROM THE DEVICE OR ICLOUD AND SUPPORTS INDUSTRY-STANDARD DICOM AND DICOMWEB NETWORK PROTOCOLS, FOR A FASTER MORE SEAMLESS EXPERIENCE. BE IMMERSED IN 3D CINEMATIC VOLUMETRIC RENDERINGS WITH EXCEPTIONAL DETAIL OR EXPLORE ANATOMY USING 2D TRI-PLANAR VIEWS."}, {"symbol": "AAPL", "date": "2025-09-29 10:00:00", "title": "BOJANGLES WELCOMES FALL WITH NEW SALTED CARAMEL APPLE CRISP", "text": "CHARLOTTE, N.C.--(BUSINESS WIRE)--BOJANGLES IS USHERING IN ALL THE COZY FALL FLAVORS WITH ITS LATEST LIMITED-TIME COBBLER, THE SALTED CARAMEL APPLE CRISP. CRAFTED WITH WARM, COMFORTING INGREDIENTS AND A TOUCH OF SOUTHERN FLAIR, THIS ALL-NEW SEASONAL SWEET TREAT IS AVAILABLE NOW THROUGH THE END OF THE YEAR AT PARTICIPATING BOJANGLES LOCATIONS. THE SALTED CARAMEL APPLE CRISP FEATURES A WARM APPLE TOPPING, CINNAMON STREUSEL AND SALTED CARAMEL, SERVED OVER A BOJANGLES' MADE-FROM-SCRATCH BUTTERMILK."}, {"symbol": "AAPL", "date": "2025-09-25 16:03:00", "title": "PRINCETON BATTLEFIELD SOCIETY, AMERICAN BATTLEFIELD TRUST AND STATE OF NEW JERSEY PARTNER TO “REPLANT HISTORY” WITH CLARKE APPLE ORCHARD", "text": "PRINCETON, N.J.--(BUSINESS WIRE)--THE PRINCETON BATTLEFIELD SOCIETY (PBS), AMERICAN BATTLEFIELD TRUST (ABT), AND THE STATE OF NEW JERSEY ANNOUNCED TODAY THAT THEY WILL BEGIN REPLANTING THE APPLE ORCHARD THAT STOOD BEFORE THE WILLIAM CLARKE HOUSE IN RECOGNITION OF THE 250TH ANNIVERSARY OF THE BATTLE OF PRINCETON AND AS PART THE CONTINUING EFFORTS TO RESTORE THE HISTORIC SITE TO HOW THE HALLOWED GROUND LOOKED ON JANUARY 13, 1777. THE ORCHARD WAS THE INITIAL POINT OF CONTACT BETWEEN THE ARMIES AND."}, {"symbol": "AAPL", "date": "2025-09-25 08:00:00", "title": "MACS ARE EMERGING AS AI INFRASTRUCTURE: 96% OF CIOS PLAN MORE APPLE INVESTMENT AS AI AND CLOUD STRATEGIES CONVERGE", "text": "ATLANTA--(BUSINESS WIRE)-- #APPLE--MACSTADIUM, THE INDUSTRY LEADER IN MAC CLOUD SOLUTIONS, TODAY ANNOUNCED FINDINGS FROM ITS INAUGURAL CIO SURVEY ON THE EVOLVING ROLE OF APPLE IN THE ENTERPRISE. A NEW SURVEY, CONDUCTED BY CENSUSWIDE, OF U.S. CIOS SHOWS THAT APPLE MACS, LONG FAVORED BY DEVELOPERS AND EXECUTIVES, ARE NOW BEING ADOPTED AT SCALE FOR ENTERPRISE AI WORKLOADS. WITH 73% OF CIOS CITING AI PROCESSING AS THE TOP USE CASE, MACS ARE MOVING BEYOND CREATIVE AND APP DEVELOPMENT TO SERVE AS SECURE, ENER."}, {"symbol": "AAPL", "date": "2025-09-24 08:00:00", "title": "VOIP-PAL HAS FILED AND SERVED AMENDED ANTITRUST COMPLAINTS AGAINST APPLE, GOOGLE, AND SAMSUNG", "text": "WACO, TEXAS, SEPT. 24, 2025 (GLOBE NEWSWIRE) -- VOIP-PAL.COM INC. (OTCQB: VPLM) ANNOUNCED IT HAS FILED AND SERVED TWO AMENDED ANTITRUST LAWSUITS—ONE INDIVIDUAL AND ONE NATIONWIDE CLASS ACTION—AGAINST APPLE, GOOGLE, AND SAMSUNG."}, {"symbol": "AAPL", "date": "2025-09-23 07:28:00", "title": "THE ALL-NEW APPLE GINZA OPENS THIS FRIDAY, SEPTEMBER 26, IN TOKYO", "text": "TOKYO--(BUSINESS WIRE)--APPLE® TODAY ANNOUNCED THE GRAND REOPENING OF APPLE GINZA ON FRIDAY, SEPTEMBER 26, LOCATED IN THE VIBRANT GINZA DISTRICT WHERE APPLE'S RETAIL JOURNEY IN JAPAN BEGAN MORE THAN TWO DECADES AGO. OPENED IN 2003 AS APPLE'S FIRST STORE OUTSIDE THE U.S., APPLE GINZA NOW RETURNS IN AN ALL-NEW FOUR-STORY DESIGN THAT BRINGS TOGETHER THE BEST OF APPLE'S PRODUCTS, SERVICES, AND EXPERIENCES IN ONE BEAUTIFULLY REIMAGINED SPACE. “APPLE GINZA HOLDS A SPECIAL PLACE IN OUR HEARTS AS OUR V."}, {"symbol": "AAPL", "date": "2025-09-16 09:05:00", "title": "ADDIGY, DISRUPTIVE APPLE MDM PIONEER, ACCELERATES MOMENTUM WITH EXPANDED LEADERSHIP TEAM", "text": "MIAMI--(BUSINESS WIRE)-- #ADDIGY--TECH & CHANNEL VETERANS CHRIS RUDNICK AND DAN SAURITCH JOIN APPLE MDM LEADER, HEADING GTM TO SUPPORT HIGH DEMAND FOR DEVICE MANAGEMENT & SECURITY."}, {"symbol": "AAPL", "date": "2025-09-11 03:12:00", "title": "DARWIN STEPHENS FEATURED AS THE MOST TRUSTED REALTOR® IN TEXAS IN APPLE NEWS+", "text": "DALLAS, TX, SEPT. 11, 2025 (GLOBE NEWSWIRE) -- DARWIN STEPHENS DBA SELLING DALLAS AND THE CEO OF RADDR GROUP®, HAS BEEN FEATURED AS ONE OF THE TOP 10 MOST TRUSTED REALTOR® IN TEXAS IN APPLE NEWS+, UNDERSCORING HIS ROLE AS A TRUSTED FIGURE IN THE STATE'S COMPETITIVE REAL ESTATE MARKET. STEPHEN'S INCLUSION AT THE TOP OF THE TEXAS MARKET REFLECTS NOT ONLY HIS PROFESSIONAL ACCOMPLISHMENTS BUT ALSO THE IMPORTANCE OF CREDIBILITY AND CLIENT CONFIDENCE IN LUXURY REAL ESTATE TRANSACTIONS."}, {"symbol": "AAPL", "date": "2025-09-10 11:29:00", "title": "BOOST MOBILE TO OFFER ALL-NEW IPHONE 17, IPHONE AIR, IPHONE 17 PRO AND IPHONE 17 PRO MAX, APPLE WATCH SERIES 11, APPLE WATCH ULTRA 3 AND APPLE WATCH SE 3", "text": "THE LATEST IPHONE MODELS ARE AVAILABLE TO PRE-ORDER STARTING ON FRIDAY, SEPTEMBER 12, AND THE APPLE WATCH LINEUP IS NOW AVAILABLE TO PRE-ORDER. BOOST MOBILE OFFERING UP TO $1,000 OFF THE IPHONE 17 LINEUP WITH NO TRADE-IN REQUIRED."}, {"symbol": "AAPL", "date": "2025-09-09 14:10:00", "title": "APPLE UNVEILS IPHONE 17 PRO AND IPHONE 17 PRO MAX, THE MOST POWERFUL AND ADVANCED PRO MODELS EVER", "text": "CUPERTINO, CALIF.--(BUSINESS WIRE)--APPLE® TODAY INTRODUCED IPHONE 17® PRO AND IPHONE 17 PRO MAX WITH A STRIKING NEW DESIGN THAT DELIVERS A DRAMATIC LEAP IN PERFORMANCE. BOTH MODELS FEATURE A19 PRO, THE MOST POWERFUL AND EFFICIENT CHIP FOR IPHONE YET, ENABLING THE ADVANCED CAMERA SYSTEMS, NEXT-LEVEL MOBILE GAMING, AND APPLE INTELLIGENCE™. BUILT WITH AN APPLE-DESIGNED VAPOR CHAMBER THAT IS LASER-WELDED INTO A STRONG, LIGHT, AND THERMALLY CONDUCTIVE ALUMINUM UNIBODY, IPHONE 17 PRO AND IPHONE 17 P."}, {"symbol": "AAPL", "date": "2025-09-09 14:10:00", "title": "APPLE DEBUTS APPLE WATCH SERIES 11, FEATURING GROUNDBREAKING HEALTH INSIGHTS", "text": "CUPERTINO, CALIF.--(BUSINESS WIRE)--APPLE® TODAY INTRODUCED APPLE WATCH® SERIES 11, OFFERING THE MOST COMPREHENSIVE SET OF HEALTH FEATURES YET, LONGER BATTERY LIFE, AN EVEN MORE DURABLE COVER GLASS, AND 5G CELLULAR CAPABILITIES, ALL IN ITS THINNEST AND MOST COMFORTABLE DESIGN. APPLE WATCH SERIES 11 IS THE ULTIMATE HEALTH AND FITNESS COMPANION, EMPOWERING USERS WITH NOTIFICATIONS FOR SIGNS OF CHRONIC HIGH BLOOD PRESSURE — ALSO KNOWN AS HYPERTENSION — PLUS NEW INSIGHTS INTO SLEEP QUALITY WITH SLE."}, {"symbol": "AAPL", "date": "2025-09-09 14:10:00", "title": "INTRODUCING IPHONE AIR, A POWERFUL NEW IPHONE WITH A BREAKTHROUGH DESIGN", "text": "CUPERTINO, CALIF.--(BUSINESS WIRE)--APPLE® TODAY DEBUTED THE ALL-NEW IPHONE AIR™, THE THINNEST IPHONE® EVER MADE, WITH PRO PERFORMANCE. IPHONE AIR FEATURES A BREAKTHROUGH TITANIUM DESIGN THAT IS ELEGANT AND LIGHT YET STRONG, WITH AN INNOVATIVE INTERNAL ARCHITECTURE THAT ENABLES THE LATEST IPHONE EXPERIENCES. THE BACK OF IPHONE AIR IS NOW PROTECTED WITH CERAMIC SHIELD®, AND THE FRONT COVER USES CERAMIC SHIELD 2, DELIVERING 3X BETTER SCRATCH RESISTANCE, MAKING IPHONE AIR MORE DURABLE THAN ANY PRE."}, {"symbol": "AAPL", "date": "2025-09-09 14:10:00", "title": "APPLE DEBUTS IPHONE 17", "text": "CUPERTINO, CALIF.--(BUSINESS WIRE)--APPLE® TODAY ANNOUNCED IPHONE® 17, FEATURING THE NEW CENTER STAGE® FRONT CAMERA THAT TAKES SELFIES TO THE NEXT LEVEL; A POWERFUL 48MP FUSION MAIN CAMERA WITH AN OPTICAL-QUALITY 2X TELEPHOTO; AND A NEW 48MP FUSION ULTRA WIDE CAMERA THAT CAPTURES EXPANSIVE SCENES AND MACRO PHOTOGRAPHY IN MORE DETAIL. THE 6.3-INCH SUPER RETINA XDR® DISPLAY WITH PROMOTION® IS BIGGER AND BRIGHTER, ENABLING SUPERSMOOTH SCROLLING, IMMERSIVE GAMING, AND IMPROVED EFFICIENCY.1 AND WITH."}, {"symbol": "AAPL", "date": "2025-09-09 13:29:00", "title": "APPLE INTRODUCES APPLE WATCH SE 3", "text": "CUPERTINO, CALIF.--(BUSINESS WIRE)--APPLE® TODAY INTRODUCED THE NEXT GENERATION OF APPLE WATCH SE®, OFFERING REMARKABLE HEALTH, FITNESS, CONNECTIVITY, AND SAFETY FEATURES, AND THE POWERFUL CAPABILITIES OF THE S10 CHIP, AT AN INCREDIBLE VALUE. APPLE WATCH SE 3 DELIVERS A MORE ADVANCED SET OF HEALTH FEATURES THAN THE PREVIOUS GENERATION — INCLUDING SLEEP SCORE, RETROSPECTIVE OVULATION ESTIMATES, SLEEP APNEA NOTIFICATIONS, AND WRIST TEMPERATURE SENSING FOR RICHER VITALS APP DATA — PLUS A ROBUST SE."}, {"symbol": "AAPL", "date": "2025-09-09 13:29:00", "title": "INTRODUCING APPLE WATCH ULTRA 3", "text": "CUPERTINO, CALIF.--(BUSINESS WIRE)--APPLE® TODAY INTRODUCED APPLE WATCH ULTRA® 3 — THE MOST ADVANCED APPLE WATCH® — DELIVERING EXPANDED HEALTH, FITNESS, SAFETY, AND CONNECTIVITY FEATURES, AND SEAMLESSLY SHIFTING BETWEEN A POWERFUL SPORTS WATCH, AN ELEGANT SMARTWATCH, AND A COMPREHENSIVE HEALTH COMPANION. DESIGNED TO KEEP USERS MORE CONNECTED AND SAFER WHEREVER THEY ARE WITH BUILT-IN SATELLITE COMMUNICATIONS, APPLE WATCH ULTRA 3 ALLOWS USERS TO TEXT EMERGENCY SERVICES, MESSAGE FRIENDS AND FAMILY."}, {"symbol": "AAPL", "date": "2025-09-09 13:13:00", "title": "INTRODUCING AIRPODS PRO 3, THE ULTIMATE AUDIO EXPERIENCE", "text": "CUPERTINO, CALIF.--(BUSINESS WIRE)--APPLE® TODAY ANNOUNCED AIRPODS PRO® 3, TAKING THE MOST POPULAR HEADPHONES IN THE WORLD TO AN ENTIRELY NEW LEVEL. AIRPODS PRO 3 DELIVER UNBELIEVABLE SOUND QUALITY AND THE WORLD'S BEST IN-EAR ACTIVE NOISE CANCELLATION (ANC) — REMOVING UP TO 2X MORE NOISE THAN THE PREVIOUS-GENERATION AIRPODS PRO, AND 4X MORE THAN THE ORIGINAL AIRPODS PRO. THE UPDATED DESIGN HELPS AIRPODS PRO 3 FIT EVEN BETTER AND PROVIDES GREATER IN-EAR STABILITY DURING ACTIVITIES LIKE RUNNING,."}, {"symbol": "AAPL", "date": "2025-09-09 10:50:00", "title": "XION LAUNCHES APPLE ID LOGIN FOR BLOCKCHAIN, DROPPING WALLETS AND SEED PHRASES", "text": "NEW YORK, NY, SEPT. 09, 2025 (GLOBE NEWSWIRE) -- ONE-TAP LOGIN REPLACES COMPLEX CRYPTO, ALLOWING USERS TO SIGN IN LESS THAN A MINUTE"}, {"symbol": "AAPL", "date": "2025-09-08 16:20:00", "title": "CZR EXCHANGE OFFICIALLY LAUNCHES ON APPLE APP STORE WITH INTEGRATED CZR WALLET", "text": "NEXT-GENERATION TRADING PLATFORM BRINGS SECURE SELF-CUSTODY AND GLOBAL CRYPTO ACCESS TO IOS USERS NEXT-GENERATION TRADING PLATFORM BRINGS SECURE SELF-CUSTODY AND GLOBAL CRYPTO ACCESS TO IOS USERS"}, {"symbol": "AAPL", "date": "2025-09-03 10:47:00", "title": "SAUDIA INTRODUCES APPLE'S FIND MY SHARE ITEM LOCATION FEATURE TO ENHANCE BAGGAGE RECOVERY", "text": "SAUDIA HAS ANNOUNCED THE IMPLEMENTATION OF APPLE'S SHARE ITEM LOCATION FEATURE TO PRIVATELY AND SECURELY LOCATE LOST OR DELAYED BAGS CONTAINING AN AIRTAG."}, {"symbol": "AAPL", "date": "2025-09-03 09:05:00", "title": "NEW ADDIGY MDM SUITE DELIVERS INDUSTRY'S ONLY ZERO-TRUST SECURITY AND AUTOMATED, REAL-TIME COMPLIANCE FOR APPLE FLEETS", "text": "MIAMI--(BUSINESS WIRE)-- #ADDIGY--ADDIGY INTEGRATED ITS LEADING REMOTE MACOS MANAGEMENT MDM WITH SENTINELONE MDR AND EDR FOR COMPLETE, REAL-TIME SINGLE-PANE SECURITY FOR APPLE FLEETS."}, {"symbol": "AAPL", "date": "2025-09-01 01:30:00", "title": "APPLE HEBBAL OPENS THIS TUESDAY, SEPTEMBER 2, IN BENGALURU", "text": "BENGALURU, INDIA--(BUSINESS WIRE)--APPLE® TODAY PREVIEWED ITS NEWEST STORE IN INDIA, APPLE HEBBAL, LOCATED IN THE TECHNOLOGY CAPITAL OF BENGALURU. THE STORE WILL BE APPLE'S FIRST IN SOUTH INDIA AND THIRD IN THE COUNTRY, JOINING APPLE BKC IN MUMBAI AND APPLE SAKET IN DELHI AND THE APPLE STORE ONLINE. APPLE HEBBAL WILL BE A WELCOMING SPACE FOR CUSTOMERS TO SHOP APPLE'S FULL LINEUP OF PRODUCTS, EXPERIENCE THE BEST SERVICE AND SUPPORT, AND PARTICIPATE IN FREE TODAY AT APPLE SESSIONS TO DISCOVER AND."}, {"symbol": "AAPL", "date": "2025-08-27 09:07:00", "title": "COLLEGE FOR CREATIVE STUDIES LAUNCHES APPLE FOUNDATION PROGRAM, FREE CODING COURSES FOR DETROITERS", "text": "THE APPLE FOUNDATION PROGRAM AT CCS WILL WELCOME ITS FIRST COHORT IN OCTOBER 2025, OFFERING A FREE INTRODUCTORY APP DEVELOPMENT COURSE WITH ACCESS TO LAPTOPS AND ADDITIONAL DEVICES. THE APPLE FOUNDATION PROGRAM AT CCS WILL WELCOME ITS FIRST COHORT IN OCTOBER 2025, OFFERING A FREE INTRODUCTORY APP DEVELOPMENT COURSE WITH ACCESS TO LAPTOPS AND ADDITIONAL DEVICES."}, {"symbol": "AAPL", "date": "2025-08-19 17:07:00", "title": "APPLE INC. INVESTORS: PLEASE CONTACT THE PORTNOY LAW FIRM TO RECOVER YOUR LOSSES. AUGUST 19, 2025 DEADLINE TO FILE LEAD PLAINTIFF MOTION.", "text": "INVESTORS CAN CONTACT THE LAW FIRM AT NO COST TO LEARN MORE ABOUT RECOVERING THEIR LOSSES"}, {"symbol": "AAPL", "date": "2025-08-19 16:00:00", "title": "AAPL INVESTOR ALERT: BRONSTEIN, GEWIRTZ & GROSSMAN LLC ANNOUNCES THAT APPLE INC. INVESTORS WITH SUBSTANTIAL LOSSES HAVE OPPORTUNITY TO LEAD CLASS ACTION LAWSUIT", "text": "NEW YORK, AUG. 19, 2025 (GLOBE NEWSWIRE) -- ATTORNEY ADVERTISING -- BRONSTEIN, GEWIRTZ & GROSSMAN, LLC, A NATIONALLY RECOGNIZED LAW FIRM, NOTIFIES INVESTORS THAT A CLASS ACTION LAWSUIT HAS BEEN FILED AGAINST APPLE INC. (“APPLE” OR “THE COMPANY”) (NASDAQ: AAPL) AND CERTAIN OF ITS OFFICERS."}, {"symbol": "AAPL", "date": "2025-08-19 04:03:00", "title": "HTX KICKS OFF \"WEEKLY CHECK-IN & WIN\" EVENT WITH EXCITING PRIZES, INCLUDING THE NEW APPLE WATCH SERIES 10", "text": "PANAMA CITY, AUG. 19, 2025 (GLOBE NEWSWIRE) -- HTX, A LEADING GLOBAL CRYPTO EXCHANGE, IS EXCITED TO ANNOUNCE THE LAUNCH OF ITS NEW \"WEEKLY CHECK-IN & WIN\" CAMPAIGN, DESIGNED TO ADD MORE INTERACTIVE BENEFITS FOR ITS COMMUNITY. STARTING AUGUST 8, YOU CAN JOIN THE LUCKY DRAW FOR A CHANCE TO WIN EXCITING PRIZES, INCLUDING 1,888 USDT AND THE LATEST APPLE WATCH SERIES 10. SIMPLY COMPLETE A QUICK COMMUNITY CHECK-IN TASK TO QUALIFY!"}, {"symbol": "AAPL", "date": "2025-08-17 09:43:00", "title": "POMERANTZ LAW FIRM ANNOUNCES THE FILING OF A CLASS ACTION AGAINST APPLE INC. AND CERTAIN OFFICERS – AAPL", "text": "NEW YORK, AUG. 17, 2025 (GLOBE NEWSWIRE) -- POMERANTZ LLP ANNOUNCES THAT A CLASS ACTION LAWSUIT HAS BEEN FILED AGAINST APPLE INC. (“APPLE” OR THE “COMPANY”) (NASDAQ: AAPL) AND CERTAIN OFFICERS.   THE CLASS ACTION, FILED IN THE UNITED STATES DISTRICT COURT FOR THE NORTHERN DISTRICT OF CALIFORNIA, AND DOCKETED UNDER 25-CV-05197, IS ON BEHALF OF A CLASS CONSISTING OF ALL PERSONS AND ENTITIES OTHER THAN DEFENDANTS THAT PURCHASED OR OTHERWISE ACQUIRED APPLE SECURITIES BETWEEN JUNE 10, 2024 AND JUNE 9, 2025, BOTH DATES INCLUSIVE (THE “CLASS PERIOD”), SEEKING TO RECOVER DAMAGES CAUSED BY DEFENDANTS' VIOLATIONS OF THE FEDERAL SECURITIES LAWS AND TO PURSUE REMEDIES UNDER SECTIONS 10(B) AND 20(A) OF THE SECURITIES EXCHANGE ACT OF 1934 AND RULE 10B-5 PROMULGATED THEREUNDER, AGAINST THE COMPANY AND CERTAIN OF ITS TOP OFFICIALS."}, {"symbol": "AAPL", "date": "2025-08-17 07:23:00", "title": "AAPL LOSS ALERT: APPLE INC. INVESTORS WITH LOSSES ARE REMINDED OF THE AUGUST 19 CLASS ACTION DEADLINE – CONTACT BFA LAW (NASDAQ:AAPL)", "text": "NEW YORK, AUG. 17, 2025 (GLOBE NEWSWIRE) -- LEADING SECURITIES LAW FIRM BLEICHMAR FONTI & AULD LLP ANNOUNCES THAT A LAWSUIT HAS BEEN FILED AGAINST APPLE INC. (NASDAQ: AAPL) AND CERTAIN OF THE COMPANY'S SENIOR EXECUTIVES FOR POTENTIAL VIOLATIONS OF THE FEDERAL SECURITIES LAWS. IF YOU INVESTED IN APPLE, YOU ARE ENCOURAGED TO OBTAIN ADDITIONAL INFORMATION BY VISITING: HTTPS://WWW.BFALAW.COM/CASES-INVESTIGATIONS/APPLE-INC-CLASS-ACTION-LAWSUIT."}, {"symbol": "AAPL", "date": "2025-08-16 10:00:00", "title": "POMERANTZ LAW FIRM ANNOUNCES THE FILING OF A CLASS ACTION AGAINST APPLE INC. AND CERTAIN OFFICERS - AAPL", "text": "NEW YORK , AUG. 16, 2025 /PRNEWSWIRE/ -- POMERANTZ LLP ANNOUNCES THAT A CLASS ACTION LAWSUIT HAS BEEN FILED AGAINST APPLE INC. (\"APPLE\" OR THE \"COMPANY\") (NASDAQ: AAPL) AND CERTAIN OFFICERS.   THE CLASS ACTION, FILED IN THE UNITED STATES DISTRICT COURT FOR THE NORTHERN DISTRICT OF CALIFORNIA, AND DOCKETED UNDER 25-CV-05197, IS ON BEHALF OF A CLASS CONSISTING OF ALL PERSONS AND ENTITIES OTHER THAN DEFENDANTS THAT PURCHASED OR OTHERWISE ACQUIRED APPLE SECURITIES BETWEEN JUNE 10, 2024 AND JUNE 9, 2025, BOTH DATES INCLUSIVE (THE \"CLASS PERIOD\"), SEEKING TO RECOVER DAMAGES CAUSED BY DEFENDANTS' VIOLATIONS OF THE FEDERAL SECURITIES LAWS AND TO PURSUE REMEDIES UNDER SECTIONS 10(B) AND 20(A) OF THE SECURITIES EXCHANGE ACT OF 1934 AND RULE 10B-5 PROMULGATED THEREUNDER, AGAINST THE COMPANY AND CERTAIN OF ITS TOP OFFICIALS."}, {"symbol": "AAPL", "date": "2025-08-15 16:00:00", "title": "AAPL INVESTOR ALERT: BRONSTEIN, GEWIRTZ & GROSSMAN LLC ANNOUNCES THAT APPLE INC. INVESTORS WITH SUBSTANTIAL LOSSES HAVE OPPORTUNITY TO LEAD CLASS ACTION LAWSUIT", "text": "NEW YORK, AUG. 15, 2025 (GLOBE NEWSWIRE) -- ATTORNEY ADVERTISING -- BRONSTEIN, GEWIRTZ & GROSSMAN, LLC, A NATIONALLY RECOGNIZED LAW FIRM, NOTIFIES INVESTORS THAT A CLASS ACTION LAWSUIT HAS BEEN FILED AGAINST APPLE INC. (“APPLE” OR “THE COMPANY”) (NASDAQ: AAPL) AND CERTAIN OF ITS OFFICERS."}, {"symbol": "AAPL", "date": "2025-08-15 08:18:00", "title": "AAPL FRAUD REMINDER: APPLE INC. STOCK DROP TRIGGERS SECURITIES FRAUD CLASS ACTION – CONTACT BFA LAW BEFORE IMMINENT AUGUST 19 DEADLINE (NASDAQ:AAPL)", "text": "NEW YORK, AUG. 15, 2025 (GLOBE NEWSWIRE) -- LEADING SECURITIES LAW FIRM BLEICHMAR FONTI & AULD LLP ANNOUNCES THAT A LAWSUIT HAS BEEN FILED AGAINST APPLE INC. (NASDAQ: AAPL) AND CERTAIN OF THE COMPANY'S SENIOR EXECUTIVES FOR POTENTIAL VIOLATIONS OF THE FEDERAL SECURITIES LAWS. IF YOU INVESTED IN APPLE, YOU ARE ENCOURAGED TO OBTAIN ADDITIONAL INFORMATION BY VISITING: HTTPS://WWW.BFALAW.COM/CASES-INVESTIGATIONS/APPLE-INC-CLASS-ACTION-LAWSUIT."}, {"symbol": "AAPL", "date": "2025-08-14 15:59:00", "title": "APPLE INC. INVESTORS: PLEASE CONTACT THE PORTNOY LAW FIRM TO RECOVER YOUR LOSSES. AUGUST 19, 2025 DEADLINE TO FILE LEAD PLAINTIFF MOTION", "text": "INVESTORS CAN CONTACT THE LAW FIRM AT NO COST TO LEARN MORE ABOUT RECOVERING THEIR LOSSES"}, {"symbol": "AAPL", "date": "2025-08-13 09:42:00", "title": "POMERANTZ LAW FIRM ANNOUNCES THE FILING OF A CLASS ACTION AGAINST APPLE INC. AND CERTAIN OFFICERS – AAPL", "text": "NEW YORK, AUG. 13, 2025 (GLOBE NEWSWIRE) -- POMERANTZ LLP ANNOUNCES THAT A CLASS ACTION LAWSUIT HAS BEEN FILED AGAINST APPLE INC. (“APPLE” OR THE “COMPANY”) (NASDAQ: AAPL) AND CERTAIN OFFICERS.   THE CLASS ACTION, FILED IN THE UNITED STATES DISTRICT COURT FOR THE NORTHERN DISTRICT OF CALIFORNIA, AND DOCKETED UNDER 25-CV-05197, IS ON BEHALF OF A CLASS CONSISTING OF ALL PERSONS AND ENTITIES OTHER THAN DEFENDANTS THAT PURCHASED OR OTHERWISE ACQUIRED APPLE SECURITIES BETWEEN JUNE 10, 2024 AND JUNE 9, 2025, BOTH DATES INCLUSIVE (THE “CLASS PERIOD”), SEEKING TO RECOVER DAMAGES CAUSED BY DEFENDANTS' VIOLATIONS OF THE FEDERAL SECURITIES LAWS AND TO PURSUE REMEDIES UNDER SECTIONS 10(B) AND 20(A) OF THE SECURITIES EXCHANGE ACT OF 1934 AND RULE 10B-5 PROMULGATED THEREUNDER, AGAINST THE COMPANY AND CERTAIN OF ITS TOP OFFICIALS."}, {"symbol": "AAPL", "date": "2025-08-13 09:20:00", "title": "APPLE DEVICES PROPEL RI AVAILABILITY TO OVER 5B WORLDWIDE - REELTIME'S REEL INTELLIGENCE LEADS IN POTENTIAL REACH, CAPABILITY, AND SUSTAINABILITY", "text": "REELTIME'S REEL INTELLIGENCE \"RI\" ADDS APPLE'S BILLION-PLUS DEVICES TO REELTIME'S POTENTIAL REACH, JOINING 2.8 BILLION ANDROID DEVICES IN UNPRECEDENTED AI ROLLOUT DELIVERING HIGH-PERFORMANCE AI WITHOUT DATA CENTERS. BOTHELL, WASHINGTON / ACCESS NEWSWIRE / AUGUST 13, 2025 / REELTIME MEDIA (OTCID:RLTR) TODAY ANNOUNCED THAT ITS FLAGSHIP AI PLATFORM, REEL INTELLIGENCE (RI), IS NOW AVAILABLE TO NEARLY ALL IPHONE AND IPAD USERS WORLDWIDE THROUGH DIRECT WEB ACCESS, NO APP STORE OR GOOGLE PLAY INSTALLATION REQUIRED."}, {"symbol": "AAPL", "date": "2025-08-13 08:30:00", "title": "APPLE STOCK: LOSE MONEY ON YOUR APPLE INC. (NASDAQ:AAPL) INVESTMENT? CONTACT BFA LAW BEFORE THE AUGUST 19 LEGAL DEADLINE", "text": "NEW YORK, AUG. 13, 2025 (GLOBE NEWSWIRE) -- LEADING SECURITIES LAW FIRM BLEICHMAR FONTI & AULD LLP ANNOUNCES THAT A LAWSUIT HAS BEEN FILED AGAINST APPLE INC. (NASDAQ: AAPL) AND CERTAIN OF THE COMPANY'S SENIOR EXECUTIVES FOR POTENTIAL VIOLATIONS OF THE FEDERAL SECURITIES LAWS. IF YOU INVESTED IN APPLE, YOU ARE ENCOURAGED TO OBTAIN ADDITIONAL INFORMATION BY VISITING: HTTPS://WWW.BFALAW.COM/CASES-INVESTIGATIONS/APPLE-INC-CLASS-ACTION-LAWSUIT."}, {"symbol": "AAPL", "date": "2025-08-12 13:40:00", "title": "MACNICA AMERICAS AND SOFTRON TO SHOWCASE APPLE PRORES WITH ST 2110-22 ON 100GBPS MEP100 SMART NIC AT IBC2025", "text": "SOLANA BEACH, CALIF.--(BUSINESS WIRE)--MACNICA AMERICAS, A GLOBAL TECHNOLOGY INNOVATOR OF IP DESIGN, NETWORKING SOLUTIONS AND AI/IOT TECHNOLOGIES, WILL TEAM WITH SOFTRON MEDIA SERVICES AT IBC2025 TO DEMONSTRATE APPLE PRORES COMPRESSED VIDEO OVER ST 2110-22, COMBINED WITH THE MACOS SEQUOIA (15+) AND THE MACNICA 100GBPS MEP100 SMART NIC. THE JOINT DEVELOPMENT BETWEEN MACNICA AND SOFTRON IS EXPECTED TO BE THE FIRST DELIVERY OF APPLE PRORES COMPRESSED VIDEO OVER THE ST 2110-22 FRAMEWORK AND IP NETW."}, {"symbol": "AAPL", "date": "2025-08-12 08:00:00", "title": "SEVERANCE AT 30,000 FEET: AWARD-WINNING APPLE ORIGINALS NOW PLAYING ON UNITED", "text": "FULL SEASONS OF AWARD-WINNING SHOWS LIKE SEVERANCE, SHRINKING, TED LASSO, SLOW HORSES AND SILO ARE NOW AVAILABLE ON DEMAND ON SEATBACK SCREENS AND UNITED MOBILE APP, AND NEW SHOWS WILL BE ADDED EVERY MONTH UNITED PLANS TO HAVE 300,000+ SCREENS ACROSS ITS FLEET – MORE THAN ANY OTHER U.S. AIRLINE – AS IT TAKES DELIVERY OF HUNDREDS OF NEW AIRPLANES AND RETROFITS EXISTING AIRCRAFT CHICAGO , AUG. 12, 2025 /PRNEWSWIRE/ -- UNITED TODAY ANNOUNCED THAT FULL SEASONS OF SELECT APPLE TV+ GLOBAL HITS WILL NOW BE AVAILABLE FOR FREE ON THE AIRLINE'S 130,000+ SEATBACK SCREENS AND IN THE UNITED APP, INCLUDING AWARD-WINNING SHOWS SUCH AS SEVERANCE, SHRINKING, TED LASSO, SLOW HORSES AND SILO AND MORE. UNITED HAS MADE A SERIES OF INVESTMENTS IN THE SEATBACK EXPERIENCE IN RECENT YEARS, INCLUDING INSTALLING SEATBACK SCREENS IN EVERY SEAT AS PART OF ITS UNITED NEXT GROWTH PLAN AND MOST RECENTLY ANNOUNCING A NEW AIRCRAFT INTERIOR THAT INCLUDES HUGE, BLUETOOTH-ENABLED, 27-INCH, 4K OLED SEATBACK SCREENS, THE LARGEST AMONG U.S. CARRIERS."}, {"symbol": "AAPL", "date": "2025-08-12 06:15:00", "title": "EPSON INTRODUCES NEW HOME CINEMA AND MODERN WORKSPACE PROJECTORS WITH BUILT-IN SUPPORT FOR APPLE AIRPLAY", "text": "NEW 3-CHIP 3LCD PROJECTORS DELIVER BRIGHT, DETAILED DISPLAYS FOR HOME ENTERTAINMENT, BUSINESS PRESENTATIONS, HYBRID MEETINGS AND MORE LOS ALAMITOS, CALIF. , AUG. 12, 2025 /PRNEWSWIRE/ -- AS CONSUMERS LOOK FOR LARGE DISPLAYS THAT ARE NOT ONLY AFFORDABLE, BUT VERSATILE IN ADAPTING TO DIFFERENT ENVIRONMENTS AND VIEWING NEEDS, EPSON TODAY ANNOUNCED FOUR NEW PROJECTORS FOR HOME ENTERTAINMENT AND MODERN WORKSPACES."}, {"symbol": "AAPL", "date": "2025-08-12 04:00:00", "title": "VALUEDYNAMX COMMERCE PLATFORM OFFERS APPLE PRODUCTS FOR PREMIUM SHOPPING EXPERIENCES AND REWARDS TO DEEPEN CUSTOMER ENGAGEMENT", "text": "LONDON--(BUSINESS WIRE)--VALUEDYNAMX, A COLLINSON COMPANY AND LEADING PROVIDER OF PURCHASE REWARDS, IS TRANSFORMING LOYALTY REWARD OFFERINGS BY ENABLING BANKS, HOTELS, AND AIRLINES TO OPTIMIZE THEIR REWARDS PROGRAMS BY OFFERING APPLE PRODUCTS TO DRIVE CUSTOMER LOYALTY, ACQUISITION AND ENGAGEMENT THROUGH AN UNRIVALED RETAIL EXPERIENCE BUILT FOR TODAY'S MOST VALUABLE AUDIENCES. LIVE IN THREE CONTINENTS WITH ADDITIONAL GROWTH UNDERWAY, THIS ALLOWS FINANCIAL SERVICES AND TRAVEL COMPANIES TO DIRECTL."}, {"symbol": "AAPL", "date": "2025-08-11 19:00:00", "title": "APPLE CINEMAS ADDRESSES TRADEMARK DISPUTE WITH APPLE INC.", "text": "SAN FRANCISCO--(BUSINESS WIRE)--TODAY, APPLE CINEMAS ISSUED THE FOLLOWING STATEMENT IN RESPONSE TO A TRADEMARK LAWSUIT FILED BY APPLE INC: “FOR OVER A DECADE, APPLE CINEMAS HAS PROUDLY DELIVERED A BEST-IN-CLASS MOVIEGOING EXPERIENCE TO AUDIENCES ACROSS OUR GROWING NETWORK OF THEATERS. OUR NAME REFLECTS OUR ROOTS, BEGINNING WITH OUR FIRST PLANNED LOCATION AT THE APPLE VALLEY MALL IN NEW ENGLAND—A PROJECT THAT INSPIRED THE LAUNCH OF THE APPLE CINEMAS BRAND AND SET THE FOUNDATION FOR OUR EXPANSION."}, {"symbol": "AAPL", "date": "2025-08-11 10:00:00", "title": "POMERANTZ LAW FIRM ANNOUNCES THE FILING OF A CLASS ACTION AGAINST APPLE INC. AND CERTAIN OFFICERS - AAPL", "text": "NEW YORK , AUG. 11, 2025 /PRNEWSWIRE/ -- POMERANTZ LLP ANNOUNCES THAT A CLASS ACTION LAWSUIT HAS BEEN FILED AGAINST APPLE INC. (\"APPLE\" OR THE \"COMPANY\") (NASDAQ: AAPL) AND CERTAIN OFFICERS.   THE CLASS ACTION, FILED IN THE UNITED STATES DISTRICT COURT FOR THE NORTHERN DISTRICT OF CALIFORNIA, AND DOCKETED UNDER 25-CV-05197, IS ON BEHALF OF A CLASS CONSISTING OF ALL PERSONS AND ENTITIES OTHER THAN DEFENDANTS THAT PURCHASED OR OTHERWISE ACQUIRED APPLE SECURITIES BETWEEN JUNE 10, 2024 AND JUNE 9, 2025, BOTH DATES INCLUSIVE (THE \"CLASS PERIOD\"), SEEKING TO RECOVER DAMAGES CAUSED BY DEFENDANTS' VIOLATIONS OF THE FEDERAL SECURITIES LAWS AND TO PURSUE REMEDIES UNDER SECTIONS 10(B) AND 20(A) OF THE SECURITIES EXCHANGE ACT OF 1934 AND RULE 10B-5 PROMULGATED THEREUNDER, AGAINST THE COMPANY AND CERTAIN OF ITS TOP OFFICIALS."}, {"symbol": "AAPL", "date": "2025-08-11 08:30:00", "title": "SHAREHOLDER ALERT BERNSTEIN LIEBHARD LLP ANNOUNCES A SECURITIES FRAUD CLASS ACTION LAWSUIT HAS BEEN FILED AGAINST APPLE INC. (NASDAQ: AAPL)", "text": "NEW YORK, AUG. 11, 2025 (GLOBE NEWSWIRE) -- BERNSTEIN LIEBHARD LLP ANNOUNCES THAT A SHAREHOLDER HAS FILED A SECURITIES CLASS ACTION LAWSUIT ON BEHALF OF INVESTORS (THE “CLASS”) WHO PURCHASED OR ACQUIRED THE SECURITIES OF APPLE INC. (“APPLE” OR THE “COMPANY”) (NASDAQ: AAPL) BETWEEN JUNE 10 , 202 4 AND JUNE 9 , 202 5, INCLUSIVE. SHOULD YOU JOIN THIS CLASS ACTION LAWSUIT?"}, {"symbol": "AAPL", "date": "2025-08-11 08:18:00", "title": "AAPL COURT NOTICE: APPLE INC. INVESTORS MAY HAVE BEEN AFFECTED BY FRAUD -- CONTACT BFA LAW BEFORE AUGUST 19 IF YOU SUFFERED LOSSES (NASDAQ:AAPL)", "text": "NEW YORK, AUG. 11, 2025 (GLOBE NEWSWIRE) -- LEADING SECURITIES LAW FIRM BLEICHMAR FONTI & AULD LLP ANNOUNCES THAT A LAWSUIT HAS BEEN FILED AGAINST APPLE INC. (NASDAQ: AAPL) AND CERTAIN OF THE COMPANY'S SENIOR EXECUTIVES FOR POTENTIAL VIOLATIONS OF THE FEDERAL SECURITIES LAWS. IF YOU INVESTED IN APPLE, YOU ARE ENCOURAGED TO OBTAIN ADDITIONAL INFORMATION BY VISITING: HTTPS://WWW.BFALAW.COM/CASES-INVESTIGATIONS/APPLE-INC-CLASS-ACTION-LAWSUIT."}, {"symbol": "AAPL", "date": "2025-08-10 16:00:00", "title": "AAPL INVESTOR ALERT: BRONSTEIN, GEWIRTZ & GROSSMAN LLC ANNOUNCES THAT APPLE INC. INVESTORS WITH SUBSTANTIAL LOSSES HAVE OPPORTUNITY TO LEAD CLASS ACTION LAWSUIT", "text": "NEW YORK, AUG. 10, 2025 (GLOBE NEWSWIRE) -- ATTORNEY ADVERTISING -- BRONSTEIN, GEWIRTZ & GROSSMAN, LLC, A NATIONALLY RECOGNIZED LAW FIRM, NOTIFIES INVESTORS THAT A CLASS ACTION LAWSUIT HAS BEEN FILED AGAINST APPLE INC. (“APPLE” OR “THE COMPANY”) (NASDAQ: AAPL) AND CERTAIN OF ITS OFFICERS."}, {"symbol": "AAPL", "date": "2025-08-09 10:17:00", "title": "POMERANTZ LAW FIRM ANNOUNCES THE FILING OF A CLASS ACTION AGAINST APPLE INC. AND CERTAIN OFFICERS – AAPL", "text": "NEW YORK, AUG. 09, 2025 (GLOBE NEWSWIRE) -- POMERANTZ LLP ANNOUNCES THAT A CLASS ACTION LAWSUIT HAS BEEN FILED AGAINST APPLE INC. (“APPLE” OR THE “COMPANY”) (NASDAQ: AAPL) AND CERTAIN OFFICERS.   THE CLASS ACTION, FILED IN THE UNITED STATES DISTRICT COURT FOR THE NORTHERN DISTRICT OF CALIFORNIA, AND DOCKETED UNDER 25-CV-05197, IS ON BEHALF OF A CLASS CONSISTING OF ALL PERSONS AND ENTITIES OTHER THAN DEFENDANTS THAT PURCHASED OR OTHERWISE ACQUIRED APPLE SECURITIES BETWEEN JUNE 10, 2024 AND JUNE 9, 2025, BOTH DATES INCLUSIVE (THE “CLASS PERIOD”), SEEKING TO RECOVER DAMAGES CAUSED BY DEFENDANTS' VIOLATIONS OF THE FEDERAL SECURITIES LAWS AND TO PURSUE REMEDIES UNDER SECTIONS 10(B) AND 20(A) OF THE SECURITIES EXCHANGE ACT OF 1934 AND RULE 10B-5 PROMULGATED THEREUNDER, AGAINST THE COMPANY AND CERTAIN OF ITS TOP OFFICIALS."}, {"symbol": "AAPL", "date": "2025-08-09 07:36:00", "title": "AAPL NEWS: DID APPLE INC. MISLEAD INVESTORS? CONTACT BFA LAW BY AUGUST 19 CLASS ACTION DEADLINE (NASDAQ:AAPL)", "text": "NEW YORK, AUG. 09, 2025 (GLOBE NEWSWIRE) -- LEADING SECURITIES LAW FIRM BLEICHMAR FONTI & AULD LLP ANNOUNCES THAT A LAWSUIT HAS BEEN FILED AGAINST APPLE INC. (NASDAQ: AAPL) AND CERTAIN OF THE COMPANY'S SENIOR EXECUTIVES FOR POTENTIAL VIOLATIONS OF THE FEDERAL SECURITIES LAWS. IF YOU INVESTED IN APPLE, YOU ARE ENCOURAGED TO OBTAIN ADDITIONAL INFORMATION BY VISITING: HTTPS://WWW.BFALAW.COM/CASES-INVESTIGATIONS/APPLE-INC-CLASS-ACTION-LAWSUIT."}, {"symbol": "AAPL", "date": "2025-08-07 16:54:00", "title": "APPLE INC. INVESTORS: PLEASE CONTACT THE PORTNOY LAW FIRM TO RECOVER YOUR LOSSES. AUGUST 19, 2025 DEADLINE TO FILE LEAD PLAINTIFF MOTION.", "text": "INVESTORS CAN CONTACT THE LAW FIRM AT NO COST TO LEARN MORE ABOUT RECOVERING THEIR LOSSES"}, {"symbol": "AAPL", "date": "2025-08-07 13:09:00", "title": "FINTIV FILES RICO AND TRADE SECRET MISAPPROPRIATION SUIT AGAINST APPLE STEMMING FROM ALLEGED THEFT OF MOBILE WALLET TECHNOLOGY USED TO CREATE APPLE PAY", "text": "AUSTIN, TEXAS--(BUSINESS WIRE)--FINTIV, INC., A GLOBAL LEADER IN PATENTED, DIGITAL WALLET ECOSYSTEMS, ANNOUNCED TODAY THE FILING OF A CIVIL LAWSUIT AGAINST APPLE, INC. IN THE NORTHERN DISTRICT OF GEORGIA, ATLANTA DIVISION, ALLEGING VIOLATIONS OF THE RACKETEER INFLUENCED AND CORRUPT ORGANIZATIONS (RICO) ACT, GEORGIA'S RICO ACT, THE DEFEND TRADE SECRETS ACT, AND GEORGIA'S TRADE SECRET ACT. THE LAWSUIT, FILED BY KASOWITZ LLP, ALLEGES THAT APPLE ENGAGED IN A PATTERN OF RACKETEERING ACTIVITY, INCLUD."}, {"symbol": "AAPL", "date": "2025-08-07 08:30:00", "title": "APPLE CINEMAS AND IMAX EXPAND PARTNERSHIP WITH AGREEMENT FOR FIVE NEW AND UPGRADED IMAX WITH LASER LOCATIONS ACROSS U.S.", "text": "NEW YORK--(BUSINESS WIRE)--APPLE CINEMAS AND IMAX® CORPORATION (NYSE: IMAX) TODAY ANNOUNCED AN AGREEMENT FOR FIVE IMAX WITH LASER SYSTEMS IN THE UNITED STATES — DOUBLING THE CURRENT IMAX FOOTPRINT IN APPLE CINEMAS LOCATIONS. UNDER THE AGREEMENT, IMAX WILL RETURN TO PHILADELPHIA FOR THE FIRST TIME SINCE 2020 IN APPLE CINEMAS FORTHCOMING RIVERVIEW PLAZA – A RENOVATION TO THE CITY'S HIGHEST-GROSSING MULTIPLEX BEFORE IT CLOSED IN 2020 THAT WILL REOPEN AS THE LARGEST CINEMA IN THE CENTER CITY DOWNTO."}, {"symbol": "AAPL", "date": "2025-08-07 08:18:00", "title": "AAPL SHAREHOLDERS: APPLE INC. STOCK DROP TRIGGERS SECURITIES FRAUD CLASS ACTION – CONTACT BFA LAW BY AUGUST 19 IF YOU LOST MONEY (NASDAQ:AAPL)", "text": "NEW YORK, AUG. 07, 2025 (GLOBE NEWSWIRE) -- LEADING SECURITIES LAW FIRM BLEICHMAR FONTI & AULD LLP ANNOUNCES THAT A LAWSUIT HAS BEEN FILED AGAINST APPLE INC. (NASDAQ: AAPL) AND CERTAIN OF THE COMPANY'S SENIOR EXECUTIVES FOR POTENTIAL VIOLATIONS OF THE FEDERAL SECURITIES LAWS. IF YOU INVESTED IN APPLE, YOU ARE ENCOURAGED TO OBTAIN ADDITIONAL INFORMATION BY VISITING: HTTPS://WWW.BFALAW.COM/CASES-INVESTIGATIONS/APPLE-INC-CLASS-ACTION-LAWSUIT."}, {"symbol": "AAPL", "date": "2025-08-06 17:34:00", "title": "GLOBALFOUNDRIES EXPANDS PARTNERSHIP WITH APPLE TO ADVANCE WIRELESS CONNECTIVITY AND POWER MANAGEMENT, REINFORCING U.S. CHIP MANUFACTURING LEADERSHIP", "text": "MALTA, N.Y., AUG. 06, 2025 (GLOBE NEWSWIRE) -- GLOBALFOUNDRIES (NASDAQ: GFS) (GF) TODAY ANNOUNCED IT HAS ENTERED INTO AN AGREEMENT WITH APPLE FOR A DEEPER COLLABORATION THAT WILL ADVANCE SEMICONDUCTOR TECHNOLOGIES AND STRENGTHEN U.S. MANUFACTURING."}, {"symbol": "AAPL", "date": "2025-08-06 16:55:00", "title": "APPLIED MATERIALS JOINS APPLE AND TEXAS INSTRUMENTS IN STRENGTHENING U.S. CHIP MANUFACTURING", "text": "SANTA CLARA, CALIF., AUG. 06, 2025 (GLOBE NEWSWIRE) -- APPLIED MATERIALS, INC. IS WORKING WITH APPLE AND TEXAS INSTRUMENTS (TI) TO BOLSTER THE SEMICONDUCTOR MANUFACTURING SUPPLY CHAIN IN THE UNITED STATES. APPLIED IS SUPPORTING APPLE'S PARTNERSHIP WITH TI, ANNOUNCED TODAY, BY SUPPLYING AMERICAN-MADE CHIPMAKING EQUIPMENT FROM AUSTIN, TEXAS TO TI'S U.S. FACTORIES. AUSTIN IS HOME TO APPLIED'S LARGEST MANUFACTURING AND LOGISTICS FACILITY. IN ADDITION, APPLIED PLANS TO INVEST MORE THAN $200 MILLION IN ARIZONA TO ESTABLISH A STATE-OF-THE-ART FACILITY FOR MANUFACTURING CRITICAL COMPONENTS FOR SEMICONDUCTOR EQUIPMENT. THIS INVESTMENT BUILDS ON THE MORE THAN $400 MILLION APPLIED HAS INVESTED IN ITS U.S. EQUIPMENT MANUFACTURING INFRASTRUCTURE OVER THE PAST FIVE YEARS."}, {"symbol": "AAPL", "date": "2025-08-06 16:40:00", "title": "APPLE INCREASES U.S. COMMITMENT TO $600 BILLION, ANNOUNCES AMERICAN MANUFACTURING PROGRAM", "text": "CUPERTINO, CALIF.--(BUSINESS WIRE)--APPLE® TODAY ANNOUNCED A NEW $100 BILLION COMMITMENT TO AMERICA, A SIGNIFICANT ACCELERATION OF ITS U.S. INVESTMENT THAT NOW TOTALS $600 BILLION OVER THE NEXT FOUR YEARS. TODAY'S ANNOUNCEMENT INCLUDES THE AMBITIOUS NEW AMERICAN MANUFACTURING PROGRAM (AMP), DEDICATED TO BRINGING EVEN MORE OF APPLE'S SUPPLY CHAIN AND ADVANCED MANUFACTURING TO THE U.S. THROUGH AMP, APPLE WILL INCREASE ITS INVESTMENT ACROSS AMERICA AND INCENTIVIZE GLOBAL COMPANIES TO MANUFACTURE E."}, {"symbol": "AAPL", "date": "2025-08-06 16:40:00", "title": "APPLE AND CORNING PARTNER TO MANUFACTURE 100 PERCENT OF IPHONE AND APPLE WATCH COVER GLASS IN KENTUCKY", "text": "CUPERTINO, CALIF.--(BUSINESS WIRE)--APPLE® AND CORNING TODAY ANNOUNCED A MAJOR EXPANSION OF THEIR LONG-STANDING PARTNERSHIP TO MAKE PRECISION GLASS FOR APPLE PRODUCTS. APPLE IS MAKING A NEW $2.5 BILLION COMMITMENT TO PRODUCE ALL OF THE COVER GLASS FOR IPHONE® AND APPLE WATCH® IN CORNING'S HARRODSBURG, KENTUCKY, MANUFACTURING FACILITY. THIS MEANS THAT 100 PERCENT OF THE COVER GLASS ON IPHONE AND APPLE WATCH UNITS SOLD WORLDWIDE WILL BE MADE IN THE U.S. FOR THE FIRST TIME. CORNING IS CREATING THE."}, {"symbol": "AAPL", "date": "2025-08-06 10:00:00", "title": "POMERANTZ LAW FIRM ANNOUNCES THE FILING OF A CLASS ACTION AGAINST APPLE INC. AND CERTAIN OFFICERS - AAPL", "text": "NEW YORK , AUG. 6, 2025 /PRNEWSWIRE/ -- POMERANTZ LLP ANNOUNCES THAT A CLASS ACTION LAWSUIT HAS BEEN FILED AGAINST APPLE INC. (\"APPLE\" OR THE \"COMPANY\") (NASDAQ: AAPL) AND CERTAIN OFFICERS.  THE CLASS ACTION, FILED IN THE UNITED STATES DISTRICT COURT FOR THE NORTHERN DISTRICT OF CALIFORNIA, AND DOCKETED UNDER 25-CV-05197, IS ON BEHALF OF A CLASS CONSISTING OF ALL PERSONS AND ENTITIES OTHER THAN DEFENDANTS THAT PURCHASED OR OTHERWISE ACQUIRED APPLE SECURITIES BETWEEN JUNE 10, 2024 AND JUNE 9, 2025, BOTH DATES INCLUSIVE (THE \"CLASS PERIOD\"), SEEKING TO RECOVER DAMAGES CAUSED BY DEFENDANTS' VIOLATIONS OF THE FEDERAL SECURITIES LAWS AND TO PURSUE REMEDIES UNDER SECTIONS 10(B) AND 20(A) OF THE SECURITIES EXCHANGE ACT OF 1934 AND RULE 10B-5 PROMULGATED THEREUNDER, AGAINST THE COMPANY AND CERTAIN OF ITS TOP OFFICIALS."}, {"symbol": "AAPL", "date": "2025-08-05 18:08:00", "title": "APPLE INC. INVESTORS: PLEASE CONTACT THE PORTNOY LAW FIRM TO RECOVER YOUR LOSSES. AUGUST 19, 2025 DEADLINE TO FILE LEAD PLAINTIFF MOTION.", "text": "INVESTORS CAN CONTACT THE LAW FIRM AT NO COST TO LEARN MORE ABOUT RECOVERING THEIR LOSSES"}, {"symbol": "AAPL", "date": "2025-08-05 18:02:00", "title": "APPLE ISPORTS SECURES UP TO $25 MILLION CAPITAL FACILITY FROM LDA CAPITAL GROUP, LLC TO PROPEL GAMING AND ENTERTAINMENT ACQUISITIONS", "text": "IRVINE, CALIF., AUG. 05, 2025 (GLOBE NEWSWIRE) -- APPLE ISPORTS (OTC-QB: AAPI) (“COMPANY” OR “APPLE ISPORTS” OR “AIS”), A GAMING, ENTERTAINMENT, MEDIA AND TECHNOLOGY SERVICES COMPANY, IS PLEASED TO ANNOUNCE THE COMMITMENT OF A GROWTH CAPITAL FACILITY (THE “FACILITY”) BY LDA CAPITAL GROUP, LLC (“LDA CAPITAL”)."}, {"symbol": "AAPL", "date": "2025-08-05 16:00:00", "title": "AAPL INVESTOR ALERT: BRONSTEIN, GEWIRTZ & GROSSMAN LLC ANNOUNCES THAT APPLE INC. INVESTORS WITH SUBSTANTIAL LOSSES HAVE OPPORTUNITY TO LEAD CLASS ACTION LAWSUIT", "text": "NEW YORK, AUG. 05, 2025 (GLOBE NEWSWIRE) -- ATTORNEY ADVERTISING -- BRONSTEIN, GEWIRTZ & GROSSMAN, LLC, A NATIONALLY RECOGNIZED LAW FIRM, NOTIFIES INVESTORS THAT A CLASS ACTION LAWSUIT HAS BEEN FILED AGAINST APPLE INC. (“APPLE” OR “THE COMPANY”) (NASDAQ: AAPL) AND CERTAIN OF ITS OFFICERS."}, {"symbol": "AAPL", "date": "2025-08-05 10:00:00", "title": "POMERANTZ LAW FIRM ANNOUNCES THE FILING OF A CLASS ACTION AGAINST APPLE INC. AND CERTAIN OFFICERS – AAPL", "text": "NEW YORK, AUG. 05, 2025 (GLOBE NEWSWIRE) -- POMERANTZ LLP ANNOUNCES THAT A CLASS ACTION LAWSUIT HAS BEEN FILED AGAINST APPLE INC. (“APPLE” OR THE “COMPANY”) (NASDAQ: AAPL) AND CERTAIN OFFICERS.   THE CLASS ACTION, FILED IN THE UNITED STATES DISTRICT COURT FOR THE NORTHERN DISTRICT OF CALIFORNIA, AND DOCKETED UNDER 25-CV-05197, IS ON BEHALF OF A CLASS CONSISTING OF ALL PERSONS AND ENTITIES OTHER THAN DEFENDANTS THAT PURCHASED OR OTHERWISE ACQUIRED APPLE SECURITIES BETWEEN JUNE 10, 2024 AND JUNE 9, 2025, BOTH DATES INCLUSIVE (THE “CLASS PERIOD”), SEEKING TO RECOVER DAMAGES CAUSED BY DEFENDANTS' VIOLATIONS OF THE FEDERAL SECURITIES LAWS AND TO PURSUE REMEDIES UNDER SECTIONS 10(B) AND 20(A) OF THE SECURITIES EXCHANGE ACT OF 1934 AND RULE 10B-5 PROMULGATED THEREUNDER, AGAINST THE COMPANY AND CERTAIN OF ITS TOP OFFICIALS."}, {"symbol": "AAPL", "date": "2025-08-05 08:19:00", "title": "AAPL CLASS ACTION: APPLE INC. INVESTORS THAT LOST MONEY MAY HAVE BEEN AFFECTED BY FRAUD – CONTACT BFA LAW BY AUGUST 19 LEGAL DEADLINE (NASDAQ:AAPL)", "text": "NEW YORK, AUG. 05, 2025 (GLOBE NEWSWIRE) -- LEADING SECURITIES LAW FIRM BLEICHMAR FONTI & AULD LLP ANNOUNCES THAT A LAWSUIT HAS BEEN FILED AGAINST APPLE INC. (NASDAQ: AAPL) AND CERTAIN OF THE COMPANY'S SENIOR EXECUTIVES FOR POTENTIAL VIOLATIONS OF THE FEDERAL SECURITIES LAWS. IF YOU INVESTED IN APPLE, YOU ARE ENCOURAGED TO OBTAIN ADDITIONAL INFORMATION BY VISITING: HTTPS://WWW.BFALAW.COM/CASES-INVESTIGATIONS/APPLE-INC-CLASS-ACTION-LAWSUIT."}, {"symbol": "AAPL", "date": "2025-08-04 18:00:00", "title": "APPLE INC. INVESTORS: PLEASE CONTACT THE PORTNOY LAW FIRM TO RECOVER YOUR LOSSES. AUGUST 19, 2025 DEADLINE TO FILE LEAD PLAINTIFF MOTION", "text": "INVESTORS CAN CONTACT THE LAW FIRM AT NO COST TO LEARN MORE ABOUT RECOVERING THEIR LOSSES"}, {"symbol": "AAPL", "date": "2025-08-04 17:47:00", "title": "AAPL INVESTORS HAVE OPPORTUNITY TO LEAD APPLE INC. SECURITIES FRAUD LAWSUIT", "text": "NEW YORK , AUG. 4, 2025 /PRNEWSWIRE/ -- WHY: ROSEN LAW FIRM, A GLOBAL INVESTOR RIGHTS LAW FIRM, REMINDS PURCHASERS OF SECURITIES OF APPLE INC. (NASDAQ: AAPL) BETWEEN JUNE 10, 2024 AND JUNE 9, 2025, BOTH DATES INCLUSIVE (THE \"CLASS PERIOD\"), OF THE IMPORTANT AUGUST 19, 2025 LEAD PLAINTIFF DEADLINE. SO WHAT: IF YOU PURCHASED APPLE SECURITIES DURING THE CLASS PERIOD YOU MAY BE ENTITLED TO COMPENSATION WITHOUT PAYMENT OF ANY OUT OF POCKET FEES OR COSTS THROUGH A CONTINGENCY FEE ARRANGEMENT."}, {"symbol": "AAPL", "date": "2025-08-04 08:00:00", "title": "SYNCHRON DEBUTS FIRST THOUGHT-CONTROLLED IPAD EXPERIENCE USING APPLE'S NEW BCI HUMAN INTERFACE DEVICE PROTOCOL", "text": "NEW YORK--(BUSINESS WIRE)-- #BCI--SYNCHRON DEBUTS FIRST THOUGHT-CONTROLLED IPAD EXPERIENCE USING APPLE'S NEW BCI HUMAN INTERFACE DEVICE PROTOCOL."}]