[{"symbol": "AVGO", "date": "2025-12-11 16:15:00", "title": "BROADCOM INC. ANNOUNCES FOURTH QUARTER AND FISCAL YEAR 2025 FINANCIAL RESULTS AND QUARTERLY DIVIDEND", "text": "REVENUE OF $18,015 MILLION FOR THE FOURTH QUARTER, UP 28 PERCENT FROM THE PRIOR YEAR PERIOD GAAP NET INCOME OF $8,518 MILLION FOR THE FOURTH QUARTER; NON-GAAP NET INCOME OF $9,714 MILLION FOR THE FOURTH QUARTER ADJUSTED EBITDA OF $12,218 MILLION FOR THE FOURTH QUARTER, OR 68 PERCENT OF REVENUE GAAP DILUTED EPS OF $1.74 FOR THE FOURTH QUARTER; NON-GAAP DILUTED EPS OF $1.95 FOR THE FOURTH QUARTER CASH FROM OPERATIONS OF $7,703 MILLION FOR THE FOURTH QUARTER, LESS CAPITAL EXPENDITURES OF $237 MILLION, RESULTED IN $7,466 MILLION OF FREE CASH FLOW, OR 41 PERCENT OF REVENUE QUARTERLY COMMON STOCK DIVIDEND INCREASED BY 10 PERCENT FROM THE PRIOR QUARTER TO $0.65 PER SHARE FIRST QUARTER FISCAL YEAR 2026 REVENUE GUIDANCE OF APPROXIMATELY $19.1 BILLION, AN INCREASE OF 28 PERCENT FROM THE PRIOR YEAR PERIOD FIRST QUARTER FISCAL YEAR 2026 ADJUSTED EBITDA GUIDANCE OF 67 PERCENT OF PROJECTED REVENUE (1) PALO ALTO, CALIF. , DEC. 11, 2025 /PRNEWSWIRE/ -- BROADCOM INC. (NASDAQ: AVGO), A GLOBAL TECHNOLOGY LEADER THAT DESIGNS, DEVELOPS AND SUPPLIES SEMICONDUCTOR AND INFRASTRUCTURE SOFTWARE SOLUTIONS, TODAY REPORTED FINANCIAL RESULTS FOR ITS FOURTH QUARTER AND FISCAL YEAR ENDED NOVEMBER 2, 2025, PROVIDED GUIDANCE FOR ITS FIRST QUARTER OF FISCAL YEAR 2026 AND ANNOUNCED ITS QUARTERLY DIVIDEND."}, {"symbol": "AVGO", "date": "2025-12-02 03:01:00", "title": "ING SELECTS VMWARE CLOUD FOUNDATION 9.0 AS STRATEGIC PLATFORM FOR PRIVATE CLOUD MODERNIZATION", "text": "BROADCOM INC. (NASDAQ: AVGO) AND ING TODAY ANNOUNCED THE EXTENSION OF THE COMPANIES' STRATEGIC COLLABORATION TO UPDATE ING'S PRIVATE CLOUD INFRASTRUCTURE."}, {"symbol": "AVGO", "date": "2025-11-19 09:00:00", "title": "BROADCOM INTRODUCES THE WORLD'S FIRST QUANTUM-SAFE GEN 8 128G SAN SWITCH PORTFOLIO", "text": "NEW BROCADE GEN 8 DIRECTORS AND MID-RANGE SWITCH POWER THE INDUSTRY'S MOST SECURE, HIGH-PERFORMANCE STORAGE NETWORK FOR ENTERPRISE AI NEW BROCADE GEN 8 DIRECTORS AND MID-RANGE SWITCH POWER THE INDUSTRY'S MOST SECURE, HIGH-PERFORMANCE STORAGE NETWORK FOR ENTERPRISE AI"}, {"symbol": "AVGO", "date": "2025-11-12 03:01:00", "title": "BROADCOM ADVANCES OPEN ECOSYSTEM FOR VMWARE CLOUD FOUNDATION", "text": "NEW ODM SELF-CERTIFICATION PROGRAM, OPEN NETWORKING INITIATIVE, AND OPEN SOURCE SOFTWARE CONTRIBUTIONS FUEL FLEXIBLE, ADAPTABLE PRIVATE CLOUDS NEW AND EXPANDED COLLABORATIONS ANNOUNCED WITH CISCO, INTEL, OVHCLOUD, SNUC AND SUPERMICRO PALO ALTO, CALIF., NOV. 12, 2025 (GLOBE NEWSWIRE) -- TODAY, BROADCOM INC. (NASDAQ: AVGO) ANNOUNCED IT IS ADVANCING AN OPEN, EXTENSIBLE ECOSYSTEM FOR VMWARE CLOUD FOUNDATION (VCF), ENABLING CUSTOMERS TO BUILD, CONNECT, PROTECT, AND EXTEND THEIR MODERN PRIVATE CLOUDS."}, {"symbol": "AVGO", "date": "2025-11-11 08:00:00", "title": "BROADCOM INC. TO ANNOUNCE FOURTH QUARTER AND FISCAL YEAR 2025 FINANCIAL RESULTS ON THURSDAY, DECEMBER 11, 2025", "text": "PALO ALTO, CALIF. , NOV. 11, 2025 /PRNEWSWIRE/ -- BROADCOM INC. (NASDAQ: AVGO), A GLOBAL TECHNOLOGY LEADER THAT DESIGNS, DEVELOPS AND SUPPLIES SEMICONDUCTOR AND INFRASTRUCTURE SOFTWARE SOLUTIONS, TODAY ANNOUNCED IT WILL REPORT ITS FOURTH QUARTER AND FISCAL YEAR 2025 FINANCIAL RESULTS AND BUSINESS OUTLOOK ON THURSDAY, DECEMBER 11, 2025 AFTER THE CLOSE OF THE MARKET."}, {"symbol": "AVGO", "date": "2025-10-14 03:01:00", "title": "BROADCOM INTRODUCES INDUSTRY'S FIRST WI-FI 8 SILICON ECOSYSTEM POWERING THE AI ERA", "text": "NEW LICENSE OPTION TO HELP SCALE VIBRANT EDGE OF SMARTPHONES, PCS, AUTOMOTIVES AND IOT DEVICES IN SUPPORT OF AI-FIRST ACCESS DEVICES NEW LICENSE OPTION TO HELP SCALE VIBRANT EDGE OF SMARTPHONES, PCS, AUTOMOTIVES AND IOT DEVICES IN SUPPORT OF AI-FIRST ACCESS DEVICES"}, {"symbol": "AVGO", "date": "2025-10-13 09:00:00", "title": "OPENAI AND BROADCOM ANNOUNCE STRATEGIC COLLABORATION TO DEPLOY 10 GIGAWATTS OF OPENAI-DESIGNED AI ACCELERATORS", "text": "MULTI-YEAR PARTNERSHIP ENABLES OPENAI AND BROADCOM TO DELIVER ACCELERATOR AND NETWORK SYSTEMS FOR NEXT-GENERATION AI CLUSTERS NEWS: OPENAI AND BROADCOM WILL CO-DEVELOP SYSTEMS THAT INCLUDE ACCELERATORS AND ETHERNET SOLUTIONS FROM BROADCOM FOR SCALE-UP AND SCALE-OUT BROADCOM TO DEPLOY RACKS OF AI ACCELERATOR AND NETWORK SYSTEMS TARGETED TO START IN THE SECOND HALF OF 2026, TO COMPLETE BY END OF 2029 SAN FRANCISCO AND PALO ALTO, CALIF., OCT. 13, 2025 (GLOBE NEWSWIRE) -- OPENAI AND BROADCOM INC. (NASDAQ: AVGO) TODAY ANNOUNCED A COLLABORATION FOR 10 GIGAWATTS OF CUSTOM AI ACCELERATORS."}, {"symbol": "AVGO", "date": "2025-10-08 09:01:00", "title": "BROADCOM ANNOUNCES TOMAHAWK® 6 – DAVISSON, THE INDUSTRY'S FIRST 102.4-TBPS ETHERNET SWITCH WITH CO-PACKAGED OPTICS", "text": "BREAKTHROUGH 102.4-TBPS CPO ETHERNET SWITCH DELIVERS UNMATCHED POWER EFFICIENCY AND LINK STABILITY TO ENABLE CLUSTER SCALE-UP AND SCALE-OUT BREAKTHROUGH 102.4-TBPS CPO ETHERNET SWITCH DELIVERS UNMATCHED POWER EFFICIENCY AND LINK STABILITY TO ENABLE CLUSTER SCALE-UP AND SCALE-OUT"}, {"symbol": "AVGO", "date": "2025-09-17 03:00:00", "title": "LLOYDS BANKING GROUP EXTENDS STRATEGIC PARTNERSHIP WITH BROADCOM TO ACCELERATE DIGITAL TRANSFORMATION", "text": "LONDON, SEPT. 17, 2025 (GLOBE NEWSWIRE) -- VMWARE EXPLORE ON TOUR – LLOYDS BANKING GROUP AND BROADCOM INC. (NASDAQ: AVGO) TODAY ANNOUNCED A SIGNIFICANT EXPANSION OF THEIR LONG-STANDING PARTNERSHIP, UNDERPINNED BY A NEW MULTI-YEAR AGREEMENT THAT WILL SUPPORT THE DELIVERY OF THE GROUP'S AMBITIOUS STRATEGIC TRANSFORMATION."}, {"symbol": "AVGO", "date": "2025-09-04 16:15:00", "title": "BROADCOM INC. ANNOUNCES THIRD QUARTER FISCAL YEAR 2025 FINANCIAL RESULTS AND QUARTERLY DIVIDEND", "text": "REVENUE OF $15,952 MILLION FOR THE THIRD QUARTER, UP 22 PERCENT FROM THE PRIOR YEAR PERIOD GAAP NET INCOME OF $4,140 MILLION FOR THE THIRD QUARTER; NON-GAAP NET INCOME OF $8,404 MILLION FOR THE THIRD QUARTER ADJUSTED EBITDA OF $10,702 MILLION FOR THE THIRD QUARTER, OR 67 PERCENT OF REVENUE GAAP DILUTED EPS OF $0.85 FOR THE THIRD QUARTER; NON-GAAP DILUTED EPS OF $1.69 FOR THE THIRD QUARTER CASH FROM OPERATIONS OF $7,166 MILLION FOR THE THIRD QUARTER, LESS CAPITAL EXPENDITURES OF $142 MILLION, RESULTED IN $7,024 MILLION OF FREE CASH FLOW, OR 44 PERCENT OF REVENUE QUARTERLY COMMON STOCK DIVIDEND OF $0.59 PER SHARE FOURTH QUARTER FISCAL YEAR 2025 REVENUE GUIDANCE OF APPROXIMATELY $17.4 BILLION, AN INCREASE OF 24 PERCENT FROM THE PRIOR YEAR PERIOD FOURTH QUARTER FISCAL YEAR 2025 ADJUSTED EBITDA GUIDANCE OF 67 PERCENT OF PROJECTED REVENUE (1) PALO ALTO, CALIF. , SEPT. 4, 2025 /PRNEWSWIRE/ -- BROADCOM INC. (NASDAQ: AVGO), A GLOBAL TECHNOLOGY LEADER THAT DESIGNS, DEVELOPS AND SUPPLIES SEMICONDUCTOR AND INFRASTRUCTURE SOFTWARE SOLUTIONS, TODAY REPORTED FINANCIAL RESULTS FOR ITS THIRD QUARTER OF FISCAL YEAR 2025, ENDED AUGUST 3, 2025, PROVIDED GUIDANCE FOR ITS FOURTH QUARTER OF FISCAL YEAR 2025 AND ANNOUNCED ITS QUARTERLY DIVIDEND."}, {"symbol": "AVGO", "date": "2025-09-03 12:00:00", "title": "BROADCOM FOUNDATION JOINS FORCES WITH THE RASPBERRY PI FOUNDATION TO BRING EXPERIENCE AI TO CLASSROOMS", "text": "IRVINE, CALIF.--(BUSINESS WIRE)--AT A MEETING WITH PENANG CHIEF MINISTER CHOW KON YEOW ON JULY 1, BROADCOM FOUNDATION PRESIDENT PAULA GOLDEN SHARED NEWS OF THE FOUNDATION'S EXPANDED PARTNERSHIP WITH THE RASPBERRY PI FOUNDATION AND PENANG SCIENCE CLUSTER TO ASSUME SPONSORSHIP OF EXPERIENCE AI IN MALAYSIA, AN ARTIFICIAL INTELLIGENCE (AI) LITERACY PROGRAM ORIGINALLY PILOTED IN 2024 WITH FUNDING FROM GOOGLE DEEPMIND. BUILDING ON THE SUCCESS OF THAT PILOT, THIS NEW PHASE WILL CONTINUE TO EXPAND AI E."}, {"symbol": "AVGO", "date": "2025-08-26 13:00:00", "title": "BROADCOM SELECTED AS STRATEGIC VENDOR FOR VIRTUALIZATION SOFTWARE SOLUTIONS FOR WALMART", "text": "VMWARE CLOUD FOUNDATION TO UNIFY AND SECURE CLOUD AND EDGE OPERATIONS ACROSS WALMART'S INFRASTRUCTURE, AND ENABLE A FRICTIONLESS DEVELOPER EXPERIENCE THAT ACCELERATES INNOVATION VMWARE CLOUD FOUNDATION TO UNIFY AND SECURE CLOUD AND EDGE OPERATIONS ACROSS WALMART'S INFRASTRUCTURE, AND ENABLE A FRICTIONLESS DEVELOPER EXPERIENCE THAT ACCELERATES INNOVATION"}, {"symbol": "AVGO", "date": "2025-08-26 09:04:00", "title": "BROADCOM MAKES VMWARE CLOUD FOUNDATION AN AI NATIVE PLATFORM AND ACCELERATES DEVELOPER PRODUCTIVITY", "text": "NEWEST VCF INNOVATIONS FOR AI WORKLOADS AND AI DEVELOPERS HELP SPEED ENTERPRISE ADOPTION OF PRIVATE AI AS A SERVICE CUSTOMERS GLOBALLY ARE ADOPTING VMWARE CLOUD FOUNDATION FOR THE MODERN PRIVATE CLOUD LAS VEGAS, AUG. 26, 2025 (GLOBE NEWSWIRE) -- VMWARE EXPLORE 2025 -- BROADCOM INC. (NASDAQ: AVGO) CONTINUES TO DRIVE CUSTOMER MOMENTUM FOR VMWARE CLOUD FOUNDATION (VCF) AND AN INNOVATION ROADMAP THAT DELIVERS A MODERN PRIVATE CLOUD. TODAY, NINE OF THE TOP 10 FORTUNE 500 COMPANIES HAVE COMMITTED TO VCF, WITH CUSTOMERS WORLDWIDE HAVING LICENSED MORE THAN 100 MILLION CORES OF VCF."}, {"symbol": "AVGO", "date": "2025-08-26 09:03:00", "title": "VMWARE CLOUD FOUNDATION ELEVATES CYBER RESILIENCE, COMPLIANCE, AND SECURITY FOR THE MODERN PRIVATE CLOUD", "text": "NEW VCF AND ADVANCED SERVICES INNOVATIONS ADDRESS COMPLIANCE COMPLEXITIES IN REGULATED INDUSTRIES AND SECURITY GAPS POSED BY NEW AGENTIC AI WORKLOADS NEW VCF AND ADVANCED SERVICES INNOVATIONS ADDRESS COMPLIANCE COMPLEXITIES IN REGULATED INDUSTRIES AND SECURITY GAPS POSED BY NEW AGENTIC AI WORKLOADS"}, {"symbol": "AVGO", "date": "2025-08-26 09:02:00", "title": "BROADCOM ACCELERATES AI INNOVATION IN THE MODERN PRIVATE CLOUD WITH NVIDIA", "text": "VMWARE CLOUD FOUNDATION SUPPORTS LATEST NVIDIA BLACKWELL TO FUEL AI ADOPTION AT SCALE VMWARE CLOUD FOUNDATION SUPPORTS LATEST NVIDIA BLACKWELL TO FUEL AI ADOPTION AT SCALE"}, {"symbol": "AVGO", "date": "2025-08-11 09:00:00", "title": "BROADCOM UNVEILS EVENT HIGHLIGHTS FOR VMWARE EXPLORE 2025", "text": "VMWARE EXPLORE 2025 WILL FEATURE A VARIETY OF BREAKOUT SESSIONS AND PANEL DISCUSSIONS, EXPERT ROUNDTABLES, CERTIFICATION TRAINING, HANDS-ON LABS, AND MORE."}, {"symbol": "AVGO", "date": "2025-08-07 05:40:00", "title": "OPTIONS RECOGNIZED IN BROADCOM / VMWARE'S GLOBAL PARTNER PROGRAM, CEMENTING POSITION AMONG LEADING PRIVATE CLOUD PROVIDERS WORLDWIDE", "text": "LONDON & NEW YORK & HONG KONG--(BUSINESS WIRE)--OPTIONS RECOGNIZED IN BROADCOM / VMWARE'S GLOBAL PARTNER PROGRAM, CEMENTING POSITION AMONG LEADING PRIVATE CLOUD PROVIDERS WORLDWIDE."}, {"symbol": "AVGO", "date": "2025-08-04 17:00:00", "title": "BROADCOM SHIPS JERICHO4, ENABLING DISTRIBUTED AI COMPUTING ACROSS DATA CENTERS", "text": "PALO ALTO, CALIF., AUG. 04, 2025 (GLOBE NEWSWIRE) -- BROADCOM INC. (NASDAQ: AVGO), A GLOBAL LEADER IN SEMICONDUCTOR AND INFRASTRUCTURE SOFTWARE SOLUTIONS, TODAY ANNOUNCED IT IS NOW SHIPPING THE JERICHO4 ETHERNET FABRIC ROUTER — A PURPOSE-BUILT PLATFORM FOR THE NEXT GENERATION OF DISTRIBUTED AI INFRASTRUCTURE."}, {"symbol": "AVGO", "date": "2025-08-04 08:00:00", "title": "BROADCOM INC. TO ANNOUNCE THIRD QUARTER FISCAL YEAR 2025 FINANCIAL RESULTS ON THURSDAY, SEPTEMBER 4, 2025", "text": "PALO ALTO, CALIF. , AUG. 4, 2025 /PRNEWSWIRE/ -- BROADCOM INC. (NASDAQ: AVGO), A GLOBAL TECHNOLOGY LEADER THAT DESIGNS, DEVELOPS AND SUPPLIES SEMICONDUCTOR AND INFRASTRUCTURE SOFTWARE SOLUTIONS, TODAY ANNOUNCED IT WILL REPORT ITS THIRD QUARTER FISCAL YEAR 2025 FINANCIAL RESULTS AND BUSINESS OUTLOOK ON THURSDAY, SEPTEMBER 4, 2025 AFTER THE CLOSE OF THE MARKET."}, {"symbol": "AVGO", "date": "2025-07-15 09:00:00", "title": "BROADCOM SHIPS TOMAHAWK ULTRA: REIMAGINING THE ETHERNET SWITCH FOR HPC AND AI SCALE-UP", "text": "ULTRA-LOW LATENCY, 64B LINE-RATE SWITCHING, LOSSLESS FABRIC AND IN-NETWORK COLLECTIVES DEFINE A NEW LEVEL OF PERFORMANCE FOR ETHERNET IN HPC AND AI SCALE-UP ULTRA-LOW LATENCY, 64B LINE-RATE SWITCHING, LOSSLESS FABRIC AND IN-NETWORK COLLECTIVES DEFINE A NEW LEVEL OF PERFORMANCE FOR ETHERNET IN HPC AND AI SCALE-UP"}, {"symbol": "AVGO", "date": "2025-06-17 12:00:00", "title": "BROADCOM DELIVERS THE MODERN PRIVATE CLOUD WITH VMWARE CLOUD FOUNDATION 9.0", "text": "PALO ALTO, CALIF., JUNE 17, 2025 (GLOBE NEWSWIRE) -- BROADCOM INC. (NASDAQ: AVGO) IS ANNOUNCING THE GENERAL AVAILABILITY OF VMWARE CLOUD FOUNDATION (VCF) 9.0, THE PLATFORM FOR THE MODERN PRIVATE CLOUD."}, {"symbol": "AVGO", "date": "2025-06-05 16:15:00", "title": "BROADCOM INC. ANNOUNCES SECOND QUARTER FISCAL YEAR 2025 FINANCIAL RESULTS AND QUARTERLY DIVIDEND", "text": "REVENUE OF $15,004 MILLION FOR THE SECOND QUARTER, UP 20 PERCENT FROM THE PRIOR YEAR PERIOD GAAP NET INCOME OF $4,965 MILLION FOR THE SECOND QUARTER; NON-GAAP NET INCOME OF $7,787 MILLION FOR THE SECOND QUARTER ADJUSTED EBITDA OF $10,001 MILLION FOR THE SECOND QUARTER, OR 67 PERCENT OF REVENUE GAAP DILUTED EPS OF $1.03 FOR THE SECOND QUARTER; NON-GAAP DILUTED EPS OF $1.58 FOR THE SECOND QUARTER CASH FROM OPERATIONS OF $6,555 MILLION FOR THE SECOND QUARTER, LESS CAPITAL EXPENDITURES OF $144 MILLION, RESULTED IN $6,411 MILLION OF FREE CASH FLOW, OR 43 PERCENT OF REVENUE QUARTERLY COMMON STOCK DIVIDEND OF $0.59 PER SHARE REPURCHASED AND ELIMINATED 25.3 MILLION SHARES FOR $4,216 MILLION THIRD QUARTER FISCAL YEAR 2025 REVENUE GUIDANCE OF APPROXIMATELY $15.8 BILLION, AN INCREASE OF 21 PERCENT FROM THE PRIOR YEAR PERIOD THIRD QUARTER FISCAL YEAR 2025 ADJUSTED EBITDA GUIDANCE OF AT LEAST 66 PERCENT OF PROJECTED REVENUE (1) PALO ALTO, CALIF. , JUNE 5, 2025 /PRNEWSWIRE/ -- BROADCOM INC. (NASDAQ: AVGO), A GLOBAL TECHNOLOGY LEADER THAT DESIGNS, DEVELOPS AND SUPPLIES SEMICONDUCTOR AND INFRASTRUCTURE SOFTWARE SOLUTIONS, TODAY REPORTED FINANCIAL RESULTS FOR ITS SECOND QUARTER OF FISCAL YEAR 2025, ENDED MAY 4, 2025, PROVIDED GUIDANCE FOR ITS THIRD QUARTER OF FISCAL YEAR 2025 AND ANNOUNCED ITS QUARTERLY DIVIDEND."}, {"symbol": "AVGO", "date": "2025-05-16 10:00:00", "title": "LEVERAGE SHARES BY THEMES CONTINUES PRODUCT EXPANSION WITH A NEW SINGLE STOCK LEVERAGED ETF, BRINGING INVESTORS AN EXCITING OPPORTUNITY TO AMPLIFY EXPOSURE TO BROADCOM (AVGO)", "text": "GREENWICH, CONN., MAY 16, 2025 (GLOBE NEWSWIRE) -- LEVERAGE SHARES BY THEMES, AN ISSUER OF INNOVATIVE EXCHANGE-TRADED PRODUCTS, IS EXCITED TO ANNOUNCE THE LAUNCH OF A NEW SINGLE STOCK LEVERAGED ETF, AVAILABLE FOR TRADING STARTING MAY 16, 2025. THIS PRODUCT IS DESIGNED TO EQUIP INVESTORS TO AMPLIFY RETURNS (UP AND DOWN) AND DYNAMICALLY PARTICIPATE IN THE PERFORMANCE OF LEADING COMPANIES. THE NEW ETF IS TAILORED TO TARGET A 200% EXPOSURE TO THE DAILY PERFORMANCE OF ITS UNDERLYING STOCK, BROADCOM (AVGO), OFFERING SOPHISTICATED TRADERS AND THE RETAIL INVESTOR AN EFFICIENT TOOL TO CAPITALIZE ON MARKET MOVEMENTS AT AN INDUSTRY LOW MANAGEMENT FEE FOR SINGLE STOCK LEVERAGED ETFS AT .75%."}, {"symbol": "AVGO", "date": "2025-05-13 08:31:00", "title": "CORNING COLLABORATES WITH BROADCOM TO ACCELERATE AI DATA CENTER PROCESSING CAPACITY", "text": "CORNING, N.Y.--(BUSINESS WIRE)--CORNING INCORPORATED (NYSE:GLW), A WORLD LEADER IN GLASS SCIENCE AND OPTICAL PHYSICS, TODAY ANNOUNCED A COLLABORATION WITH BROADCOM INCORPORATED (NASDAQ:AVGO), A LEADING SUPPLIER IN THE SEMICONDUCTOR FIELD, ON A CO-PACKAGED OPTICS (CPO) INFRASTRUCTURE THAT WILL SIGNIFICANTLY INCREASE PROCESSING CAPACITY WITHIN DATA CENTERS. CORNING WILL SUPPLY CUTTING-EDGE OPTICAL COMPONENTS FOR BROADCOM'S BAILLY CPO SYSTEM, THE INDUSTRY'S FIRST CPO-BASED 51.2 TERABIT PER SECOND."}, {"symbol": "AVGO", "date": "2025-05-05 08:00:00", "title": "BROADCOM INC. TO ANNOUNCE SECOND QUARTER FISCAL YEAR 2025 FINANCIAL RESULTS ON THURSDAY, JUNE 5, 2025", "text": "PALO ALTO, CALIF. , MAY 5, 2025 /PRNEWSWIRE/ -- BROADCOM INC. (NASDAQ: AVGO), A GLOBAL TECHNOLOGY LEADER THAT DESIGNS, DEVELOPS AND SUPPLIES SEMICONDUCTOR AND INFRASTRUCTURE SOFTWARE SOLUTIONS, TODAY ANNOUNCED IT WILL REPORT ITS SECOND QUARTER FISCAL YEAR 2025 FINANCIAL RESULTS AND BUSINESS OUTLOOK ON THURSDAY, JUNE 5, 2025 AFTER THE CLOSE OF THE MARKET."}, {"symbol": "AVGO", "date": "2025-04-07 16:15:00", "title": "BROADCOM INC. ANNOUNCES $10 BILLION SHARE REPURCHASE AUTHORIZATION", "text": "PALO ALTO, CALIF. , APRIL 7, 2025 /PRNEWSWIRE/ -- BROADCOM INC. (NASDAQ: AVGO), A GLOBAL TECHNOLOGY LEADER THAT DESIGNS, DEVELOPS AND SUPPLIES SEMICONDUCTOR AND INFRASTRUCTURE SOFTWARE SOLUTIONS, TODAY ANNOUNCED THAT ITS BOARD OF DIRECTORS HAS AUTHORIZED A NEW SHARE REPURCHASE PROGRAM TO REPURCHASE UP TO $10 BILLION OF ITS COMMON STOCK THROUGH DECEMBER 31, 2025."}, {"symbol": "AVGO", "date": "2025-03-31 09:00:00", "title": "BROADCOM ADVANCES OPTICAL CONNECTIVITY FOR AI INFRASTRUCTURE WITH INDUSTRY-LEADING SOLUTIONS AT OFC 2025", "text": "BROADCOM SHOWCASES OPTICAL INTERCONNECT SOLUTIONS FOR NEXT GENERATION AI CLUSTERS; HIGHLIGHTS PATH TO 200T BROADCOM SHOWCASES OPTICAL INTERCONNECT SOLUTIONS FOR NEXT GENERATION AI CLUSTERS; HIGHLIGHTS PATH TO 200T"}, {"symbol": "AVGO", "date": "2025-03-27 04:00:00", "title": "BROADCOM TEAMS WITH AUDI TO DELIVER NEXT-GENERATION IT-BASED FACTORY AUTOMATION POWERED BY VMWARE CLOUD SOFTWARE", "text": "BROADCOM ANNOUNCED THAT AUDI'S EDGE CLOUD 4 PRODUCTION INITIATIVE, POWERED BY VMWARE CLOUD SOFTWARE, IS NOW LIVE AT THE BOELLINGER HOEFE PLANT IN GERMANY."}, {"symbol": "AVGO", "date": "2025-03-26 09:00:00", "title": "BROADCOM SIMPLIFIES AND ACCELERATES PRIVATE CLOUD LATERAL SECURITY WITH VMWARE VDEFEND INNOVATIONS", "text": "PALO ALTO, CALIF., MARCH 26, 2025 (GLOBE NEWSWIRE) -- BROADCOM INC. (NASDAQ: AVGO) TODAY INTRODUCED NEW UPDATES TO VMWARE VDEFEND THAT ENABLE ORGANIZATIONS TO UP-LEVEL SECURITY PLANNING AND ASSESSMENT, SIMPLIFY LIFECYCLE MANAGEMENT AND OPERATIONS, AND SEAMLESSLY SCALE SECURITY ACROSS APPLICATION ENVIRONMENTS."}, {"symbol": "AVGO", "date": "2025-03-18 09:00:00", "title": "VMWARE EXPLORE 2025, AN ESSENTIAL CLOUD EVENT FOR IT PROFESSIONALS, RETURNS TO LAS VEGAS AND EXTENDS TO NEW REGIONS", "text": "VMWARE EXPLORE ON TOUR TO BE NEWLY HELD IN FRANKFURT, LONDON, MUMBAI, PARIS, SYDNEY AND TOKYO IN FALL 2025 PALO ALTO, CALIF., MARCH 18, 2025 (GLOBE NEWSWIRE) -- BROADCOM INC. (NASDAQ: AVGO) TODAY ANNOUNCED HIGHLIGHTS AND NEW PROGRAM ELEMENTS OF VMWARE EXPLORE(R) 2025, AN ESSENTIAL CLOUD EVENT FOR IT PROFESSIONALS."}, {"symbol": "AVGO", "date": "2025-03-11 04:00:00", "title": "TELEFÓNICA GERMANY RENEWS ORACLE SUPPORT CONTRACT WITH SPINNAKER SUPPORT - AND EXTENDS CONTRACT TO INCLUDE BROADCOM-VMWARE THIRD-PARTY MAINTENANCE SUPPORT", "text": "DENVER--(BUSINESS WIRE)--SPINNAKER SUPPORT (SPINNAKER), TRUSTED BY COMPANIES WORLDWIDE TO SUPPORT THEIR ESSENTIAL ORACLE, SAP AND VMWARE SOFTWARE, TODAY ANNOUNCES THE RENEWAL OF ITS ORACLE SUPPORT CONTRACT WITH TELEFÓNICA GERMANY AFTER THE SUCCESS OF ITS INITIAL 2-YEAR CONTRACT PERIOD. IN ADDITION, SPINNAKER ALSO ANNOUNCES IT WILL BE PROVIDING THIRD-PARTY SOFTWARE SUPPORT FOR TELEFÓNICA GERMANY'S VMWARE ESTATE FOR THE NEXT 3 YEARS. TELEFÓNICA GERMANY IS ONE OF THE LEADING INTEGRATED TELECOMMUNI."}, {"symbol": "AVGO", "date": "2025-03-06 16:15:00", "title": "BROADCOM INC. ANNOUNCES FIRST QUARTER FISCAL YEAR 2025 FINANCIAL RESULTS AND QUARTERLY DIVIDEND", "text": "REVENUE OF $14,916 MILLION FOR THE FIRST QUARTER, UP 25 PERCENT FROM THE PRIOR YEAR PERIOD GAAP NET INCOME OF $5,503 MILLION FOR THE FIRST QUARTER; NON-GAAP NET INCOME OF $7,823 MILLION FOR THE FIRST QUARTER ADJUSTED EBITDA OF $10,083 MILLION FOR THE FIRST QUARTER, OR 68 PERCENT OF REVENUE GAAP DILUTED EPS OF $1.14 FOR THE FIRST QUARTER; NON-GAAP DILUTED EPS OF $1.60 FOR THE FIRST QUARTER CASH FROM OPERATIONS OF $6,113 MILLION FOR THE FIRST QUARTER, LESS CAPITAL EXPENDITURES OF $100 MILLION, RESULTED IN $6,013 MILLION OF FREE CASH FLOW, OR 40 PERCENT OF REVENUE QUARTERLY COMMON STOCK DIVIDEND OF $0.59 PER SHARE SECOND QUARTER FISCAL YEAR 2025 REVENUE GUIDANCE OF APPROXIMATELY $14.9 BILLION, AN INCREASE OF 19 PERCENT FROM THE PRIOR YEAR PERIOD SECOND QUARTER FISCAL YEAR 2025 ADJUSTED EBITDA GUIDANCE OF APPROXIMATELY 66 PERCENT OF PROJECTED REVENUE (1) PALO ALTO, CALIF. , MARCH 6, 2025 /PRNEWSWIRE/ -- BROADCOM INC. (NASDAQ: AVGO), A GLOBAL TECHNOLOGY LEADER THAT DESIGNS, DEVELOPS AND SUPPLIES SEMICONDUCTOR AND INFRASTRUCTURE SOFTWARE SOLUTIONS, TODAY REPORTED FINANCIAL RESULTS FOR ITS FIRST QUARTER OF FISCAL YEAR 2025, ENDED FEBRUARY 2, 2025, PROVIDED GUIDANCE FOR ITS SECOND QUARTER OF FISCAL YEAR 2025 AND ANNOUNCED ITS QUARTERLY DIVIDEND."}, {"symbol": "AVGO", "date": "2025-03-04 02:00:00", "title": "BROADCOM LAUNCHES VELOSKY TO DELIVER NETWORK CONVERGENCE, TRANSFORM CONNECTIVITY", "text": "VELOSKY IS A NEW CONVERGED NETWORKING SOLUTION THAT ENABLES CSPS TO OFFER INTEGRATED FIBER, CELLULAR, AND SATELLITE CONNECTIVITY VIA A SINGLE APPLIANCE"}, {"symbol": "AVGO", "date": "2025-02-06 08:00:00", "title": "BROADCOM INC. TO ANNOUNCE FIRST QUARTER FISCAL YEAR 2025 FINANCIAL RESULTS ON THURSDAY, MARCH 6, 2025", "text": "PALO ALTO, CALIF. , FEB. 6, 2025 /PRNEWSWIRE/ -- BROADCOM INC. (NASDAQ: AVGO), A GLOBAL TECHNOLOGY LEADER THAT DESIGNS, DEVELOPS AND SUPPLIES SEMICONDUCTOR AND INFRASTRUCTURE SOFTWARE SOLUTIONS, TODAY ANNOUNCED IT WILL REPORT ITS FIRST QUARTER FISCAL YEAR 2025 FINANCIAL RESULTS AND BUSINESS OUTLOOK ON THURSDAY, MARCH 6, 2025 AFTER THE CLOSE OF THE MARKET."}, {"symbol": "AVGO", "date": "2025-01-28 09:00:00", "title": "BROADCOM DELIVERS INDUSTRY'S FIRST QUANTUM RESISTANT NETWORK ENCRYPTION, ENABLING REAL-TIME RANSOMWARE DETECTION", "text": "EMULEX SECURE HOST BUS ADAPTERS ANSWER THE CALL BY GOVERNMENTS WORLDWIDE TO ENCRYPT ALL DATA WITH A QUANTUM-RESISTANT, ZERO TRUST SOLUTION EMULEX SECURE HOST BUS ADAPTERS ANSWER THE CALL BY GOVERNMENTS WORLDWIDE TO ENCRYPT ALL DATA WITH A QUANTUM-RESISTANT, ZERO TRUST SOLUTION"}, {"symbol": "AVGO", "date": "2024-12-12 16:15:00", "title": "BROADCOM INC. ANNOUNCES FOURTH QUARTER AND FISCAL YEAR 2024 FINANCIAL RESULTS AND QUARTERLY DIVIDEND", "text": "REVENUE OF $14,054 MILLION FOR THE FOURTH QUARTER, UP 51 PERCENT FROM THE PRIOR YEAR PERIOD GAAP NET INCOME OF $4,324 MILLION FOR THE FOURTH QUARTER; NON-GAAP NET INCOME OF $6,965 MILLION FOR THE FOURTH QUARTER ADJUSTED EBITDA OF $9,089 MILLION FOR THE FOURTH QUARTER, OR 65 PERCENT OF REVENUE GAAP DILUTED EPS OF $0.90 FOR THE FOURTH QUARTER; NON-GAAP DILUTED EPS OF $1.42 FOR THE FOURTH QUARTER CASH FROM OPERATIONS OF $5,604 MILLION FOR THE FOURTH QUARTER, LESS CAPITAL EXPENDITURES OF $122 MILLION, RESULTED IN $5,482 MILLION OF FREE CASH FLOW, OR 39 PERCENT OF REVENUE QUARTERLY COMMON STOCK DIVIDEND INCREASED BY 11 PERCENT FROM THE PRIOR QUARTER TO $0.59 PER SHARE FIRST QUARTER FISCAL YEAR 2025 REVENUE GUIDANCE OF APPROXIMATELY $14.6 BILLION, AN INCREASE OF 22 PERCENT FROM THE PRIOR YEAR PERIOD FIRST QUARTER FISCAL YEAR 2025 ADJUSTED EBITDA GUIDANCE OF APPROXIMATELY 66 PERCENT OF PROJECTED REVENUE (1) PALO ALTO, CALIF. , DEC. 12, 2024 /PRNEWSWIRE/ -- BROADCOM INC. (NASDAQ: AVGO), A GLOBAL TECHNOLOGY LEADER THAT DESIGNS, DEVELOPS AND SUPPLIES SEMICONDUCTOR AND INFRASTRUCTURE SOFTWARE SOLUTIONS, TODAY REPORTED FINANCIAL RESULTS FOR ITS FOURTH QUARTER AND FISCAL YEAR ENDED NOVEMBER 3, 2024, PROVIDED GUIDANCE FOR ITS FIRST QUARTER OF FISCAL YEAR 2025 AND ANNOUNCED ITS QUARTERLY DIVIDEND."}, {"symbol": "AVGO", "date": "2024-12-05 09:00:00", "title": "BROADCOM DELIVERS INDUSTRY'S FIRST 3.5D F2F TECHNOLOGY FOR AI XPUS", "text": "COMBINATION OF 3D SILICON STACKING AND 2.5D PACKAGING TECHNOLOGY ENABLES CUSTOM COMPUTE PLATFORMS WITH BREAKTHROUGH PERFORMANCE, POWER AND COST COMBINATION OF 3D SILICON STACKING AND 2.5D PACKAGING TECHNOLOGY ENABLES CUSTOM COMPUTE PLATFORMS WITH BREAKTHROUGH PERFORMANCE, POWER AND COST"}, {"symbol": "AVGO", "date": "2024-11-12 08:00:00", "title": "BROADCOM INC. TO ANNOUNCE FOURTH QUARTER AND FISCAL YEAR 2024 FINANCIAL RESULTS ON THURSDAY, DECEMBER 12, 2024", "text": "PALO ALTO, CALIF. , NOV. 12, 2024 /PRNEWSWIRE/ -- BROADCOM INC. (NASDAQ: AVGO), A GLOBAL TECHNOLOGY LEADER THAT DESIGNS, DEVELOPS AND SUPPLIES SEMICONDUCTOR AND INFRASTRUCTURE SOFTWARE SOLUTIONS, TODAY ANNOUNCED IT WILL REPORT ITS FOURTH QUARTER AND FISCAL YEAR 2024 FINANCIAL RESULTS AND BUSINESS OUTLOOK ON THURSDAY, DECEMBER 12, 2024 AFTER THE CLOSE OF THE MARKET."}, {"symbol": "AVGO", "date": "2024-11-05 03:02:00", "title": "VMWARE CLOUD FOUNDATION DELIVERS A PRIVATE CLOUD PLATFORM TO ACCELERATE CUSTOMERS' AI, SOVEREIGNTY AND SECURITY OUTCOMES", "text": "BROADCOM UNVEILS NEW AND EXPANDED VMWARE CLOUD FOUNDATION ADVANCED SERVICES, ECOSYSTEM PARTNERSHIPS AND PRIVATE CLOUD MODERNIZATION PROGRAM BROADCOM UNVEILS NEW AND EXPANDED VMWARE CLOUD FOUNDATION ADVANCED SERVICES, ECOSYSTEM PARTNERSHIPS AND PRIVATE CLOUD MODERNIZATION PROGRAM"}, {"symbol": "AVGO", "date": "2024-11-05 03:01:00", "title": "BROADCOM UNVEILS VELORAIN, AN INDUSTRY-FIRST FOR ROBUST AI NETWORKING BEYOND THE DATA CENTER", "text": "BARCELONA, SPAIN, NOV. 05, 2024 (GLOBE NEWSWIRE) -- TO ACCELERATE ENTERPRISES' READINESS TO FURTHER CONNECT AND SUPPORT AI AND NON-AI WORKLOADS, BROADCOM INC. (NASDAQ: AVGO) TODAY ANNOUNCED MAJOR ADVANCEMENTS ACROSS ITS VELOCLOUD PRODUCT PORTFOLIO AS WELL AS A NEW PARTNER PROGRAM. THIS INCLUDES: THE LAUNCH OF THE VELORAIN (ROBUST AI NETWORKING) ARCHITECTURE THAT USES AI/ML TO IMPROVE THE PERFORMANCE AND SECURITY OF DISTRIBUTED AI WORKLOADS."}, {"symbol": "AVGO", "date": "2024-11-05 03:00:00", "title": "BROADCOM AND TELIA ANNOUNCE EXPANDED PARTNERSHIP TO FURTHER TRANSFORM TELCO AND CLOUD INFRASTRUCTURE", "text": "PALO ALTO, CALIF. AND SOLNA, SWEDEN, NOV. 05, 2024 (GLOBE NEWSWIRE) -- BROADCOM INC. (NASDAQ: AVGO) AND TELIA COMPANY (STO: TELIA) TODAY ANNOUNCED THE EXPANSION OF THEIR LONGTIME PARTNERSHIP WITH A NEW MULTI-YEAR AGREEMENT, WHICH WILL SEE TELIA FURTHER MODERNIZE AND TRANSFORM ITS TELCO AND CLOUD INFRASTRUCTURE WITH THE VMWARE PRODUCT PORTFOLIO."}, {"symbol": "AVGO", "date": "2024-11-01 09:00:00", "title": "LICENSEFORTRESS ACHIEVES 82.9% NPS IN 2024 AMID COMPLEX LICENSING CHANGES FOR JAVA AND BROADCOM CUSTOMERS", "text": "LOS ANGELES--(BUSINESS WIRE)-- #NPSSCORE--LICENSEFORTRESS CONTINUES TO DELIVER EXCEPTIONAL CUSTOMER SATISFACTION IN 2024, EARNING A NET PROMOTER SCORE (NPS) OF 82.9%, AN UPWARD TREND FROM 2023, INDEPENDENTLY VERIFIED BY CLEARLYRATED. THIS IMPRESSIVE SCORE SURPASSES THE TECHNOLOGY SERVICES INDUSTRY 2023 AVERAGE OF 42%, REFLECTING LICENSEFORTRESS' EXPERTISE IN GUIDING CUSTOMERS THROUGH SIGNIFICANT LICENSING CHALLENGES. THIS YEAR, ORACLE'S SHIFT TO AN EMPLOYEE-BASED JAVA LICENSING MODEL HAS CREATED NEW CHALLE."}, {"symbol": "AVGO", "date": "2024-10-22 03:00:00", "title": "BROADCOM TO HOST VMWARE EXPLORE 2024 BARCELONA FOR CUSTOMERS AND PARTNERS", "text": "PALO ALTO, CALIF., OCT. 22, 2024 (GLOBE NEWSWIRE) -- BROADCOM INC. (NASDAQ: AVGO), WHICH RECENTLY ACQUIRED VMWARE , IS HOSTING VMWARE EXPLORE 2024 BARCELONA NOVEMBER 4-7 AT THE FIRA GRAN VIA, FEATURING A VARIETY OF BREAKOUT SESSIONS, CERTIFICATION TRAINING, AND LABS SPANNING RELEVANT TECHNOLOGY AND INDUSTRY TOPICS."}, {"symbol": "AVGO", "date": "2024-09-25 00:00:00", "title": "FS UNVEILS 51.2T 400G AND 800G AI ETHERNET SWITCHES POWERED BY BROADCOM TOMAHAWK 5", "text": "NEW CASTLE, DEL.--(BUSINESS WIRE)-- #400G--FS INTRODUCES 400G AND 800G AI ETHERNET SWITCHES WITH BROADCOM TOMAHAWK 5, OFFERING 51.2 TBPS CAPACITY AND SUPPORTING LOSSLESS ROCEV2 NETWORKING."}, {"symbol": "AVGO", "date": "2024-09-23 09:00:00", "title": "BROADCOM DELIVERS INDUSTRY LEADING 200G/LANE DSP FOR GEN AI INFRASTRUCTURE", "text": "BROADCOM SIAN FAMILY OF DSPS ENABLE BEST-IN-CLASS 800G AND 1.6T OPTICAL TRANSCEIVERS BROADCOM SIAN FAMILY OF DSPS ENABLE BEST-IN-CLASS 800G AND 1.6T OPTICAL TRANSCEIVERS"}, {"symbol": "AVGO", "date": "2024-09-10 06:00:00", "title": "TOWER SEMICONDUCTOR SETS A NEW RFSOI STANDARD WITH BROADCOM'S WI-FI RF FRONT-END MODULES FOR NEXT-GEN MOBILE APPLICATIONS", "text": "LEADING-EDGE WI-FI 7 RF FEMS BASED ON TOWER'S ADVANCED 300MM RFSOI TECHNOLOGY DELIVER ENHANCED MOBILE CONNECTIVITY PERFORMANCE AND EFFICIENCY"}, {"symbol": "AVGO", "date": "2024-09-05 16:15:00", "title": "BROADCOM INC. ANNOUNCES THIRD QUARTER FISCAL YEAR 2024 FINANCIAL RESULTS AND QUARTERLY DIVIDEND", "text": "REVENUE OF $13,072 MILLION FOR THE THIRD QUARTER, UP 47 PERCENT FROM THE PRIOR YEAR PERIOD GAAP NET LOSS OF $1,875 MILLION FOR THE THIRD QUARTER (1); NON-GAAP NET INCOME OF $6,120 MILLION FOR THE THIRD QUARTER ADJUSTED EBITDA OF $8,223 MILLION FOR THE THIRD QUARTER, OR 63 PERCENT OF REVENUE GAAP DILUTED LOSS PER SHARE OF $0.40 FOR THE THIRD QUARTER; NON-GAAP DILUTED EPS OF $1.24 FOR THE THIRD QUARTER CASH FROM OPERATIONS OF $4,963 MILLION FOR THE THIRD QUARTER, LESS CAPITAL EXPENDITURES OF $172 MILLION, RESULTED IN $4,791 MILLION OF FREE CASH FLOW, OR 37 PERCENT OF REVENUE QUARTERLY COMMON STOCK DIVIDEND OF $0.53 PER SHARE FOURTH QUARTER FISCAL YEAR 2024 REVENUE GUIDANCE OF APPROXIMATELY $14.0 BILLION INCLUDING CONTRIBUTION FROM VMWARE, AN INCREASE OF 51 PERCENT FROM THE PRIOR YEAR PERIOD FOURTH QUARTER FISCAL YEAR 2024 ADJUSTED EBITDA GUIDANCE OF APPROXIMATELY 64 PERCENT OF PROJECTED REVENUE (2) PALO ALTO, CALIF. , SEPT. 5, 2024 /PRNEWSWIRE/ -- BROADCOM INC. (NASDAQ: AVGO), A GLOBAL TECHNOLOGY LEADER THAT DESIGNS, DEVELOPS AND SUPPLIES SEMICONDUCTOR AND INFRASTRUCTURE SOFTWARE SOLUTIONS, TODAY REPORTED FINANCIAL RESULTS FOR ITS THIRD QUARTER OF FISCAL YEAR 2024, ENDED AUGUST 4, 2024, PROVIDED GUIDANCE FOR ITS FOURTH QUARTER OF FISCAL YEAR 2024 AND ANNOUNCED ITS QUARTERLY DIVIDEND."}, {"symbol": "AVGO", "date": "2024-08-27 09:02:00", "title": "BROADCOM UNVEILS THE FUTURE OF VMWARE CLOUD FOUNDATION", "text": "LAS VEGAS, AUG. 27, 2024 (GLOBE NEWSWIRE) -- VMWARE EXPLORE 2024 -- AT VMWARE EXPLORE 2024 LAS VEGAS, BROADCOM INC. (NASDAQ: AVGO) TODAY UNVEILED VMWARE CLOUD FOUNDATION (VCF) 9, THE FUTURE OF VCF THAT WILL ACCELERATE CUSTOMERS' TRANSITION FROM SILOED IT ARCHITECTURES TO A UNIFIED AND INTEGRATED PRIVATE CLOUD PLATFORM THAT LOWERS COST AND RISK. VMWARE CLOUD FOUNDATION 9 WILL RADICALLY SIMPLIFY THE DEPLOYMENT, CONSUMPTION AND OPERATIONS OF A SECURE AND COST-EFFECTIVE PRIVATE CLOUD."}, {"symbol": "AVGO", "date": "2024-08-27 09:01:00", "title": "BROADCOM INTRODUCES VMWARE TANZU PLATFORM 10 TO ACCELERATE INTELLIGENT APPLICATION DELIVERY IN THE PRIVATE CLOUD", "text": "LAS VEGAS, AUG. 27, 2024 (GLOBE NEWSWIRE) -- VMWARE EXPLORE 2024 – BROADCOM INC. (NASDAQ: AVGO) ANNOUNCED VMWARE TANZU PLATFORM 10, A CLOUD NATIVE APPLICATION PLATFORM THAT ACCELERATES SOFTWARE DELIVERY, PROVIDING PLATFORM ENGINEERING TEAMS ENHANCED GOVERNANCE AND OPERATIONAL EFFICIENCY WHILE REDUCING TOIL AND COMPLEXITY FOR DEVELOPMENT TEAMS. THE COMPANY ALSO INTRODUCED TANZU AI SOLUTIONS, A SET OF CAPABILITIES WITHIN TANZU PLATFORM THAT HELP APPLICATION TEAMS DELIVER GENAI-POWERED, INTELLIGENT APPLICATIONS QUICKLY, SAFELY, AND AT SCALE."}, {"symbol": "AVGO", "date": "2024-08-26 11:05:00", "title": "RACKSPACE INTRODUCES ON-DEMAND SOFTWARE AS A SERVICE TO SEAMLESSLY SIMULATE COMPLEX ENVIRONMENTS", "text": "RACKSPACE LAB SERVICES MERGES BROADCOM VMWARE LAB PLATFORM AND RACKSPACE SDDC FLEX FOR A CUTTING-EDGE CLOUD SOLUTION TO TRANSFORM ORGANIZATIONS WORLDWIDE RACKSPACE LAB SERVICES MERGES BROADCOM VMWARE LAB PLATFORM AND RACKSPACE SDDC FLEX FOR A CUTTING-EDGE CLOUD SOLUTION TO TRANSFORM ORGANIZATIONS WORLDWIDE"}, {"symbol": "AVGO", "date": "2024-08-26 09:00:00", "title": "HITACHI VANTARA AND BROADCOM ANNOUNCE ADVANCED PRIVATE AND HYBRID CLOUD SOLUTIONS WITH VMWARE CLOUD FOUNDATION", "text": "NEW CO-ENGINEERED SOLUTIONS ACCELERATE INNOVATION, ENHANCE OPERATIONAL FLEXIBILITY, AND PROMOTE SUSTAINABILITY ACROSS MULTIPLE ENVIRONMENTS LAS VEGAS , AUG. 26, 2024 /PRNEWSWIRE/ -- VMWARE EXPLORE 2024 HITACHI VANTARA , THE DATA STORAGE, INFRASTRUCTURE, AND HYBRID CLOUD MANAGEMENT SUBSIDIARY OF HITACHI, LTD. (TSE: 6501) AND BROADCOM INC. (NASDAQ: AVGO) , TODAY ANNOUNCED A POWERFUL NEW PRIVATE AND HYBRID CLOUD SOLUTION."}, {"symbol": "AVGO", "date": "2024-08-16 09:00:00", "title": "BROADCOM ANNOUNCES VMWARE EXPLORE 2024 LAS VEGAS GENERAL SESSION", "text": "BROADCOM ANNOUNCED THE GENERAL SESSION KEYNOTE SPEAKERS AT VMWARE EXPLORE 2024 LAS VEGAS TAKING PLACE AT THE VENETIAN CONVENTION & EXPO CENTER (AUG. 26-29)"}, {"symbol": "AVGO", "date": "2024-08-05 08:00:00", "title": "BROADCOM INC. TO ANNOUNCE THIRD QUARTER FISCAL YEAR 2024 FINANCIAL RESULTS ON THURSDAY, SEPTEMBER 5, 2024", "text": "PALO ALTO, CALIF. , AUG. 5, 2024 /PRNEWSWIRE/ -- BROADCOM INC. (NASDAQ: AVGO), A GLOBAL TECHNOLOGY LEADER THAT DESIGNS, DEVELOPS AND SUPPLIES SEMICONDUCTOR AND INFRASTRUCTURE SOFTWARE SOLUTIONS, TODAY ANNOUNCED IT WILL REPORT ITS THIRD QUARTER FISCAL YEAR 2024 FINANCIAL RESULTS AND BUSINESS OUTLOOK ON THURSDAY, SEPTEMBER 5, 2024 AFTER THE CLOSE OF THE MARKET."}, {"symbol": "AVGO", "date": "2024-06-24 09:00:00", "title": "VMWARE EXPLORE 2024, THE INDUSTRY'S ESSENTIAL CLOUD CONFERENCE, RETURNS TO LAS VEGAS AND BARCELONA", "text": "BROADCOM TODAY PREVIEWED HIGHLIGHTS OF VMWARE EXPLORE 2024, THE INDUSTRY'S ESSENTIAL CLOUD EVENT, WHICH WILL KICKOFF IN LAS VEGAS ON AUGUST 26–29, 2024"}, {"symbol": "AVGO", "date": "2024-06-20 09:00:00", "title": "BROADCOM'S SYMANTEC CLOUD SECURE WEB GATEWAY RECEIVES FEDRAMP AUTHORIZATION", "text": "PALO ALTO, CALIF., JUNE 20, 2024 (GLOBE NEWSWIRE) -- BROADCOM INC. (NASDAQ: AVGO) TODAY ANNOUNCED ITS SYMANTEC CLOUD SECURE WEB GATEWAY (SWG) SOLUTION RECEIVED FEDERAL RISK AND AUTHORIZATION MANAGEMENT PROGRAM (FEDRAMP®) AUTHORIZATION, FURTHER EXPANDING BROADCOM'S PORTFOLIO OF FEDRAMP AUTHORIZED SOLUTIONS FOR THE U.S. SECTOR."}, {"symbol": "AVGO", "date": "2024-06-18 18:00:00", "title": "SYMANTEC CYBERSECURITY SOLUTIONS ASSESSED TO COMBAT RANSOMWARE AND EMERGING THREATS FOR AUSTRALIAN GOVERNMENT ENTITIES", "text": "PALO ALTO, CALIF., JUNE 18, 2024 (GLOBE NEWSWIRE) -- BROADCOM INC. (NASDAQ: AVGO) TODAY ANNOUNCED THAT SYMANTEC ENDPOINT SECURITY, SYMANTEC NETWORK PROTECTION AND SYMANTEC DLP CLOUD SOLUTIONS HAVE COMPLETED THE INFORMATION SECURITY REGISTERED ASSESSORS PROGRAM (IRAP) ASSESSMENT."}, {"symbol": "AVGO", "date": "2024-06-13 09:00:00", "title": "BROADCOM SEES POSITIVE MOMENTUM AS MORE PARTNERS JOIN THE BROADCOM ADVANTAGE PARTNER PROGRAM FOR VMWARE CLOUD SERVICE PROVIDERS IN EUROPE", "text": "PALO ALTO, CALIF., JUNE 13, 2024 (GLOBE NEWSWIRE) -- BROADCOM INC. (NASDAQ: AVGO) TODAY ANNOUNCED IT IS FURTHER ENHANCING CUSTOMER-FOCUSED INNOVATION THROUGH THE EXPANSION OF THE BROADCOM ADVANTAGE PARTNER PROGRAM FOR VMWARE CLOUD SERVICE PROVIDERS (VCSPS) IN EUROPE."}, {"symbol": "AVGO", "date": "2024-06-12 16:15:00", "title": "BROADCOM INC. ANNOUNCES SECOND QUARTER FISCAL YEAR 2024 FINANCIAL RESULTS AND QUARTERLY DIVIDEND", "text": "REVENUE OF $12,487 MILLION FOR THE SECOND QUARTER, UP 43 PERCENT FROM THE PRIOR YEAR PERIOD GAAP NET INCOME OF $2,121 MILLION FOR THE SECOND QUARTER; NON-GAAP NET INCOME OF $5,394 MILLION FOR THE SECOND QUARTER ADJUSTED EBITDA OF $7,429 MILLION FOR THE SECOND QUARTER, OR 59 PERCENT OF REVENUE GAAP DILUTED EPS OF $4.42 FOR THE SECOND QUARTER; NON-GAAP DILUTED EPS OF $10.96 FOR THE SECOND QUARTER CASH FROM OPERATIONS OF $4,580 MILLION FOR THE SECOND QUARTER, LESS CAPITAL EXPENDITURES OF $132 MILLION, RESULTED IN $4,448 MILLION OF FREE CASH FLOW, OR 36 PERCENT OF REVENUE QUARTERLY COMMON STOCK DIVIDEND OF $5.25 PER SHARE FISCAL 2024 ANNUAL REVENUE GUIDANCE OF APPROXIMATELY $51.0 BILLION INCLUDING CONTRIBUTION FROM VMWARE, AN INCREASE OF 42 PERCENT FROM THE PRIOR YEAR PERIOD FISCAL 2024 ANNUAL ADJUSTED EBITDA GUIDANCE OF APPROXIMATELY 61 PERCENT OF PROJECTED REVENUE (1) TEN-FOR-ONE FORWARD STOCK SPLIT; TRADING ON A SPLIT-ADJUSTED BASIS IS EXPECTED TO COMMENCE ON JULY 15, 2024  PALO ALTO, CALIF. , JUNE 12, 2024 /PRNEWSWIRE/ -- BROADCOM INC. (NASDAQ: AVGO), A GLOBAL TECHNOLOGY LEADER THAT DESIGNS, DEVELOPS AND SUPPLIES SEMICONDUCTOR AND INFRASTRUCTURE SOFTWARE SOLUTIONS, TODAY REPORTED FINANCIAL RESULTS FOR ITS SECOND QUARTER OF FISCAL YEAR 2024, ENDED MAY 5, 2024, PROVIDED GUIDANCE FOR ITS FISCAL YEAR 2024 AND ANNOUNCED ITS QUARTERLY DIVIDEND."}, {"symbol": "AVGO", "date": "2024-06-06 09:00:00", "title": "OVHCLOUD US BECOMES NEW VMWARE CLOUD SERVICE PROVIDER PINNACLE TIER PARTNER IN THE BROADCOM ADVANTAGE PARTNER PROGRAM", "text": "RESTON, VA.--(BUSINESS WIRE)--OVHCLOUD® US ANNOUNCED THAT THE COMPANY IS NOW A VMWARE CLOUD SERVICE PROVIDER (VCSP) PINNACLE TIER PARTNER IN THE BROADCOM ADVANTAGE PARTNER PROGRAM FOR NORTH AMERICA TO HELP MUTUAL ENTERPRISE CUSTOMERS TO INNOVATE BY ADOPTING VMWARE CLOUD FOUNDATION (VCF) AS THEIR PRIVATE CLOUD INFRASTRUCTURE. OVHCLOUD US WILL DELIVER NEW MANAGED VMWARE CLOUD FOUNDATION PRIVATE CLOUD SERVICES, INCLUDING SOVEREIGN CLOUD SERVICES THAT SUPPORT DATA RESIDENCY AND OTHER JURISDICTIONAL."}, {"symbol": "AVGO", "date": "2024-05-20 09:00:00", "title": "BROADCOM REVOLUTIONIZES AI NETWORKING LANDSCAPE WITH HIGH-PERFORMANCE 400G ROCE/RDMA ETHERNET NICS", "text": "CUTTING-EDGE PCIE TECHNOLOGY EMPOWERS SEAMLESS INTEGRATION OF OPEN STANDARDS AND FABRIC INTERCONNECTS FOR AI CLUSTERS CUTTING-EDGE PCIE TECHNOLOGY EMPOWERS SEAMLESS INTEGRATION OF OPEN STANDARDS AND FABRIC INTERCONNECTS FOR AI CLUSTERS"}, {"symbol": "AVGO", "date": "2024-05-17 09:00:00", "title": "BROADCOM ANNOUNCES ACCELERATE PROGRAM TO DELIVER ENHANCED CUSTOMER EXPERIENCE", "text": "PALO ALTO, CALIF., MAY 17, 2024 (GLOBE NEWSWIRE) -- BROADCOM INC. (NASDAQ: AVGO) TODAY ANNOUNCED ITS ACCELERATE PROGRAM, DELIVERED THROUGH SOLE-PROVIDER DISTRIBUTION AGREEMENTS."}, {"symbol": "AVGO", "date": "2024-05-08 09:00:00", "title": "BROADCOM DELIVERS INDUSTRY-LEADING WORKLOAD AUTOMATION AND ORCHESTRATION WITH LAUNCH OF AUTOMIC SAAS", "text": "PALO ALTO, CALIF., MAY 08, 2024 (GLOBE NEWSWIRE) -- BROADCOM INC. (NASDAQ:AVGO) TODAY ANNOUNCED ITS AUTOMIC® AUTOMATION SOLUTION IS NOW AVAILABLE AS SOFTWARE AS A SERVICE (SAAS)."}, {"symbol": "AVGO", "date": "2024-05-06 08:00:00", "title": "BROADCOM INC. TO ANNOUNCE SECOND QUARTER FISCAL YEAR 2024 FINANCIAL RESULTS ON WEDNESDAY, JUNE 12, 2024", "text": "PALO ALTO, CALIF. , MAY 6, 2024 /PRNEWSWIRE/ -- BROADCOM INC. (NASDAQ: AVGO), A GLOBAL TECHNOLOGY LEADER THAT DESIGNS, DEVELOPS AND SUPPLIES SEMICONDUCTOR AND INFRASTRUCTURE SOFTWARE SOLUTIONS, TODAY ANNOUNCED IT WILL REPORT ITS SECOND QUARTER FISCAL YEAR 2024 FINANCIAL RESULTS AND BUSINESS OUTLOOK ON WEDNESDAY, JUNE 12, 2024 AFTER THE CLOSE OF THE MARKET."}, {"symbol": "AVGO", "date": "2024-04-09 09:00:00", "title": "BROADCOM WINS TWO 2024 GOOGLE CLOUD TECHNOLOGY PARTNER OF THE YEAR AWARDS FOR NETWORKING AND VIRTUALIZATION", "text": "BROADCOM INC. (NASDAQ: AVGO) TODAY ANNOUNCED THAT IT HAS RECEIVED 2024 GOOGLE CLOUD TECHNOLOGY PARTNER OF THE YEAR AWARDS FOR INFRASTRUCTURE IN THE CATEGOR"}, {"symbol": "AVGO", "date": "2024-04-09 08:02:00", "title": "BROADCOM AND GOOGLE CLOUD ANNOUNCE EXPANDED PARTNERSHIP TO HELP ACCELERATE INNOVATION FOR ENTERPRISES", "text": "BROADCOM WILL MIGRATE ITS VMWARE WORKLOADS TO GOOGLE CLOUD, COLLABORATE ON JOINT GO-TO-MARKET INITIATIVES, AND DELIVER NEW GEN AI CAPABILITIES LAS VEGAS , APRIL 9, 2024 /PRNEWSWIRE/ -- CLOUD NEXT '24, LAS VEGAS -- BROADCOM INC. (NASDAQ: AVGO) AND GOOGLE CLOUD TODAY ANNOUNCED AN EXPANDED PARTNERSHIP THAT WILL INVOLVE OPTIMIZING BROADCOM'S VMWARE WORKLOADS FOR GOOGLE CLOUD, JOINTLY COLLABORATING ON GO-TO-MARKET INITIATIVES, ADDING MORE BROADCOM PRODUCTS AND SERVICES TO GOOGLE CLOUD MARKETPLACE, AND BROADCOM INFUSING GOOGLE CLOUD'S GENERATIVE AI CAPABILITIES. \"GOOGLE CLOUD HAS BEEN A TRUSTED PARTNER IN OUR DIGITAL TRANSFORMATION JOURNEY AT BROADCOM,\" SAID RICH JARDINE, VICE PRESIDENT, CLOUD PLATFORM ENGINEERING AND OPERATIONS, BROADCOM."}, {"symbol": "AVGO", "date": "2024-03-14 09:00:00", "title": "BROADCOM DELIVERS INDUSTRY'S FIRST 51.2-TBPS CO-PACKAGED OPTICS ETHERNET SWITCH PLATFORM FOR SCALABLE AI SYSTEMS", "text": "BAILLY 51.2T CPO SWITCH DELIVERS 70% IMPROVEMENT IN OPTICAL INTERCONNECT POWER BAILLY 51.2T CPO SWITCH DELIVERS 70% IMPROVEMENT IN OPTICAL INTERCONNECT POWER"}, {"symbol": "AVGO", "date": "2024-03-13 09:00:00", "title": "BROADCOM EXTENDS TECHNOLOGY AND VOLUME LEADERSHIP ON AI OPTICAL COMPONENTS", "text": "INDUSTRY-LEADING VCSEL, EML AND CW LASER TECHNOLOGIES ENABLE TERABIT CONNECTIVITY AND DRIVE LARGE-SCALE AI INFRASTRUCTURE INDUSTRY-LEADING VCSEL, EML AND CW LASER TECHNOLOGIES ENABLE TERABIT CONNECTIVITY AND DRIVE LARGE-SCALE AI INFRASTRUCTURE"}, {"symbol": "AVGO", "date": "2024-03-07 16:15:00", "title": "BROADCOM INC. ANNOUNCES FIRST QUARTER FISCAL YEAR 2024 FINANCIAL RESULTS AND QUARTERLY DIVIDEND", "text": "REVENUE OF $11,961 MILLION FOR THE FIRST QUARTER, UP 34 PERCENT FROM THE PRIOR YEAR PERIOD CASH FROM OPERATIONS OF $4,815 MILLION FOR THE FIRST QUARTER, LESS CAPITAL EXPENDITURES OF $122 MILLION, RESULTED IN $4,693 MILLION OF FREE CASH FLOW, OR 39 PERCENT OF REVENUE GAAP NET INCOME OF $1,325 MILLION FOR THE FIRST QUARTER; NON-GAAP NET INCOME OF $5,254 MILLION FOR THE FIRST QUARTER ADJUSTED EBITDA OF $7,156 MILLION FOR THE FIRST QUARTER, OR 60 PERCENT OF REVENUE GAAP DILUTED EPS OF $2.84 FOR THE FIRST QUARTER; NON-GAAP DILUTED EPS OF $10.99 FOR THE FIRST QUARTER QUARTERLY COMMON STOCK DIVIDEND OF $5.25 PER SHARE REPURCHASED AND ELIMINATED 7.7 MILLION SHARES FOR $8,290 MILLION FISCAL 2024 ANNUAL REVENUE GUIDANCE OF APPROXIMATELY $50.0 BILLION INCLUDING CONTRIBUTION FROM VMWARE, AN INCREASE OF 40 PERCENT FROM THE PRIOR YEAR PERIOD FISCAL 2024 ANNUAL ADJUSTED EBITDA GUIDANCE OF APPROXIMATELY 60 PERCENT OF PROJECTED REVENUE (1) PALO ALTO, CALIF. , MARCH 7, 2024 /PRNEWSWIRE/ -- BROADCOM INC. (NASDAQ: AVGO), A GLOBAL TECHNOLOGY LEADER THAT DESIGNS, DEVELOPS AND SUPPLIES SEMICONDUCTOR AND INFRASTRUCTURE SOFTWARE SOLUTIONS, TODAY REPORTED FINANCIAL RESULTS FOR ITS FIRST QUARTER OF FISCAL YEAR 2024, ENDED FEBRUARY 4, 2024, PROVIDED GUIDANCE FOR ITS FISCAL YEAR 2024 AND ANNOUNCED ITS QUARTERLY DIVIDEND."}, {"symbol": "AVGO", "date": "2024-03-06 09:00:00", "title": "BROADCOM EXTENDS AI WORKLOAD SCALE WITH INDUSTRY-FIRST PCI EXPRESS GEN5/GEN6 RETIMERS", "text": "INDUSTRY'S FIRST END-TO-END PCIE CONNECTIVITY PORTFOLIO OFFERS LOWEST POWER SOLUTIONS AND UNPARALLELED EFFICIENCY TO INTERCONNECT AI INFRASTRUCTURE INDUSTRY'S FIRST END-TO-END PCIE CONNECTIVITY PORTFOLIO OFFERS LOWEST POWER SOLUTIONS AND UNPARALLELED EFFICIENCY TO INTERCONNECT AI INFRASTRUCTURE"}, {"symbol": "AVGO", "date": "2024-03-05 09:00:00", "title": "BROADCOM DEBUTS GROUNDBREAKING WATCHTOWER PLATFORM FOR MAINFRAME OBSERVABILITY", "text": "ADVANCES IN PROBLEM IDENTIFICATION AND RESOLUTION ENABLE OPERATIONS TO PROACTIVELY AVOID COSTLY BUSINESS IMPACTS ADVANCES IN PROBLEM IDENTIFICATION AND RESOLUTION ENABLE OPERATIONS TO PROACTIVELY AVOID COSTLY BUSINESS IMPACTS"}, {"symbol": "AVGO", "date": "2024-02-29 01:00:00", "title": "SOFTBANK CORP., NEC AND BROADCOM JOINTLY VALIDATE RAN MODERNIZATION WITH VIRTUALIZATION BY UNIFYING O-RAN ARCHITECTURE AND TELCO CLOUD", "text": "BARCELONA, SPAIN, FEB. 29, 2024 (GLOBE NEWSWIRE) -- MOBILE WORLD CONGRESS—SOFTBANK CORP. (“SOFTBANK”), NEC CORPORATION (“NEC”) AND VMWARE, RECENTLY ACQUIRED BY BROADCOM INC., HAVE JOINTLY VERIFIED THE VIRTUALIZATION OF THE RADIO ACCESS NETWORK (“RAN”), WHICH IS THE FRONT END OF THE MOBILE NETWORK. THE COMPANIES CONFIRMED THE FEASIBILITY OF RAN MODERNIZATION BY CONVERGING O-RAN ARCHITECTURE (1) AND TELCO CLOUD (2)."}, {"symbol": "AVGO", "date": "2024-02-27 02:04:00", "title": "BROADCOM UNVEILS PRODUCT INNOVATIONS ACROSS ITS SOFTWARE-DEFINED EDGE PORTFOLIO FOR TELCOS AND ENTERPRISES AT MOBILE WORLD CONGRESS 2024", "text": "BARCELONA, SPAIN, FEB. 27, 2024 (GLOBE NEWSWIRE) -- MOBILE WORLD CONGRESS 2024 -- TODAY, VMWARE, RECENTLY ACQUIRED BY BROADCOM INC. , ANNOUNCED SIGNIFICANT NEW DEVELOPMENTS ACROSS ITS 5G, SD-WAN, SASE AND EDGE COMPUTE, COLLECTIVELY THE SOFTWARE-DEFINED EDGE PORTFOLIO, TO ENABLE COMMUNICATIONS SERVICE PROVIDERS (CSPS) TO MODERNIZE THEIR NETWORKS AND CREATE NEW MONETIZABLE SERVICES. THE NEW DEVELOPMENTS ARE ALSO CO-INNOVATED WITH ECOSYSTEM PARTNERS AND ENABLE ENTERPRISES TO RUN WORKLOADS AT THE EDGE AT SCALE WITH AUTOMATION AND UNPRECEDENTED OBSERVABILITY."}, {"symbol": "AVGO", "date": "2024-02-27 02:03:00", "title": "COMMUNICATIONS SERVICE PROVIDERS MODERNIZE NETWORKS VIA BROADCOM, PARTNER ECOSYSTEM COLLABORATION", "text": "BARCELONA, FEB. 27, 2024 (GLOBE NEWSWIRE) -- TODAY AT MOBILE WORLD CONGRESS (MWC) 2024, VMWARE, RECENTLY ACQUIRED BY BROADCOM INC. , HIGHLIGHTED COMMUNICATIONS SERVICE PROVIDERS (CSPS) DEPLOYING VMWARE TELCO CLOUD AND VMWARE SERVICE MANAGEMENT AND ORCHESTRATION (SMO) SOLUTIONS AS WELL AS CO-INNOVATIONS WITH ITS PARTNER ECOSYSTEM TO HELP GLOBAL CSPS TO MODERNIZE THEIR NETWORKS AND CREATE MONETIZABLE SERVICES QUICKLY. THROUGH ADVANCEMENTS THAT ENABLE NETWORK PROGRAMMABILITY, OPTIMIZE NETWORK PERFORMANCE, AND TRANSFORM RADIO ACCESS NETWORKS (RAN) AND THE TELCO CORE, VMWARE IS ENABLING CSPS TO BUILD A SOFTWARE-DEFINED EDGE NETWORK."}, {"symbol": "AVGO", "date": "2024-02-27 02:02:00", "title": "BROADCOM AND VODAFONE DEMONSTRATE NETWORK PROGRAMMABILITY TO OPTIMIZE NETWORK PERFORMANCE FOR SHORT-FORM VIDEO CONTENT", "text": "BARCELONA, SPAIN, FEB. 27, 2024 (GLOBE NEWSWIRE) -- MOBILE WORLD CONGRESS 2024 — TODAY, VMWARE, RECENTLY ACQUIRED BY BROADCOM INC., ANNOUNCED A COMPELLING PROOF OF CONCEPT (POC) TO BE DEMONSTRATED AT MOBILE WORLD CONGRESS IN BARCELONA, HIGHLIGHTING A NEW TECHNICAL COLLABORATION WITH VODAFONE (NASDAQ: VOD). THE JOINT EFFORT SHOWCASES THE BENEFITS OF APPLYING NETWORK PROGRAMMABILITY AND INTELLIGENCE INTO THE RADIO ACCESS NETWORK (RAN), ENHANCING OVERALL PERFORMANCE FOR CUSTOMERS."}, {"symbol": "AVGO", "date": "2024-02-27 02:01:00", "title": "VMWARE TELCO CLOUD SERVICE ASSURANCE PROVIDES DISH WIRELESS WITH DETAILED NETWORK INSIGHTS AND AUTOMATION", "text": "BARCELONA, SPAIN, FEB. 27, 2024 (GLOBE NEWSWIRE) -- MOBILE WORLD CONGRESS 2024 — VMWARE, RECENTLY ACQUIRED BY BROADCOM INC. , TODAY ANNOUNCED THAT DISH WIRELESS HAS DEPLOYED VMWARE TELCO CLOUD SERVICE ASSURANCE ACROSS THE BOOST WIRELESS NETWORK IN A PILOT PRODUCTION ENVIRONMENT TO DELIVER REAL-TIME NETWORK MONITORING, ASSURANCE AND AUTOMATION, PROVIDING A SUPERIOR 5G NETWORK AND SUBSCRIBER EXPERIENCE."}, {"symbol": "AVGO", "date": "2024-02-27 02:00:00", "title": "SINGTEL AND BROADCOM PARTNER TO BRING SEAMLESS CONNECTIVITY AND EDGE COMPUTING TO MISSION-CRITICAL APPLICATIONS", "text": "JOINT INNOVATION LAB SET UP TO HELP CUSTOMERS BUILD AND TEST APPLICATIONS JOINT INNOVATION LAB SET UP TO HELP CUSTOMERS BUILD AND TEST APPLICATIONS"}, {"symbol": "AVGO", "date": "2024-02-26 08:30:00", "title": "KKR TO ACQUIRE BROADCOM'S END-USER COMPUTING DIVISION", "text": "MENLO PARK, CALIF.--(BUSINESS WIRE)--KKR TO ACQUIRE BROADCOM'S END-USER COMPUTING DIVISION."}, {"symbol": "AVGO", "date": "2024-02-20 08:00:00", "title": "BROADCOM INC. TO HOST ENABLING AI IN INFRASTRUCTURE INVESTOR MEETING", "text": "PALO ALTO, CALIF. , FEB. 20, 2024 /PRNEWSWIRE/ -- BROADCOM INC. (NASDAQ: AVGO), A GLOBAL TECHNOLOGY LEADER THAT DESIGNS, DEVELOPS AND SUPPLIES SEMICONDUCTOR AND INFRASTRUCTURE SOFTWARE SOLUTIONS, WILL HOST AN INVESTOR MEETING, BROADCOM ENABLING AI IN INFRASTRUCTURE, IN SAN JOSE, CALIFORNIA, ON WEDNESDAY, MARCH 20, 2024."}, {"symbol": "AVGO", "date": "2024-02-16 08:00:00", "title": "BROADCOM INC. TO ANNOUNCE FIRST QUARTER FISCAL YEAR 2024 FINANCIAL RESULTS ON THURSDAY, MARCH 7, 2024; CONFERENCE CALL AT 2:15 P.M. PACIFIC TIME", "text": "PALO ALTO, CALIF. , FEB. 16, 2024 /PRNEWSWIRE/ -- BROADCOM INC. (NASDAQ: AVGO), A GLOBAL TECHNOLOGY LEADER THAT DESIGNS, DEVELOPS AND SUPPLIES SEMICONDUCTOR AND INFRASTRUCTURE SOFTWARE SOLUTIONS, ANNOUNCED IT WILL REPORT ITS FIRST QUARTER FISCAL YEAR 2024 FINANCIAL RESULTS AND BUSINESS OUTLOOK ON THURSDAY, MARCH 7, 2024 AFTER THE CLOSE OF THE MARKET."}, {"symbol": "AVGO", "date": "2024-02-14 16:30:00", "title": "“TECH FOR GOOD” SPONSOR BROADCOM FOUNDATION BRINGS TWENTY-FIVE CHAMPIONS TO THE NATIONAL STEM FESTIVAL", "text": "IRVINE, CALIF. & PALO ALTO, CALIF.--(BUSINESS WIRE)--BROADCOM FOUNDATION ANNOUNCES ITS “TECH FOR GOOD” SPONSORSHIP OF THE INAUGURAL NATIONAL STEM CHALLENGE AND IS FUNDING TWENTY-FIVE OF THE ONE HUNDRED AND TWENTY-SIX NATIONAL STEM CHAMPIONS. THESE STUDENTS WILL BE RECOGNIZED AT THE FIRST-EVER NATIONAL STEM FESTIVAL IN WASHINGTON, D.C., CO-PRESENTED BY EXPLR AND THE U.S. DEPARTMENT OF EDUCATION FROM APRIL 13-14, 2024. MEET THEM HERE. “BROADCOM FOUNDATION HAS TAKEN A LEADERSHIP ROLE IN THE NATION."}, {"symbol": "AVGO", "date": "2024-02-14 08:00:00", "title": "BROADCOM AND GOOGLE CLOUD ANNOUNCE LICENSE PORTABILITY SUPPORT FOR VMWARE CLOUD FOUNDATION ON GOOGLE CLOUD VMWARE ENGINE", "text": "CUSTOMERS WILL BE ABLE TO DEPLOY THEIR OWN VMWARE CLOUD FOUNDATION SUBSCRIPTIONS TO GOOGLE CLOUD VMWARE ENGINE WHILE MAINTAINING LICENSE ENTITLEMENTS CUSTOMERS WILL BE ABLE TO DEPLOY THEIR OWN VMWARE CLOUD FOUNDATION SUBSCRIPTIONS TO GOOGLE CLOUD VMWARE ENGINE WHILE MAINTAINING LICENSE ENTITLEMENTS"}, {"symbol": "AVGO", "date": "2024-02-07 08:00:00", "title": "BROADCOM INC. TO ANNOUNCE FIRST QUARTER FISCAL YEAR 2024 FINANCIAL RESULTS ON THURSDAY, MARCH 7, 2024", "text": "PALO ALTO, CALIF. , FEB. 7, 2024 /PRNEWSWIRE/ -- BROADCOM INC. (NASDAQ: AVGO), A DELAWARE CORPORATION HEADQUARTERED IN PALO ALTO, CA, AND A GLOBAL TECHNOLOGY LEADER THAT DESIGNS, DEVELOPS AND SUPPLIES SEMICONDUCTOR AND INFRASTRUCTURE SOFTWARE SOLUTIONS, TODAY ANNOUNCED IT WILL REPORT ITS FIRST QUARTER FISCAL YEAR 2024 FINANCIAL RESULTS AND BUSINESS OUTLOOK ON THURSDAY, MARCH 7, 2024 AFTER THE CLOSE OF THE MARKET."}, {"symbol": "AVGO", "date": "2024-01-24 08:00:00", "title": "FLEET LETS IT DEPARTMENTS REPLACE BROADCOM'S WORKSPACE ONE WITH OPEN-SOURCE DEVICE MANAGEMENT", "text": "SAN FRANCISCO--(BUSINESS WIRE)-- #ENDPOINTMANAGEMENT--OPEN-SOURCE DEVICE MANAGEMENT PIONEER FLEET TODAY ANNOUNCED A NEW VERSION WITH SIMPLIFIED SUPPORT FOR MANAGING EVERY KIND OF CORPORATE DEVICE IN ONE PLACE: APPLE, WINDOWS, AND EVEN LINUX. THIS RELEASE ENABLES ENTERPRISE IT DEPARTMENTS TO CONSOLIDATE AND REMOVE THE NEED FOR PROPRIETARY ALTERNATIVES SUCH AS JAMF PRO, JAMF PROTECT, MICROSOFT INTUNE, IVANTI MOBILEIRON, AND BROADCOM'S RECENTLY ACQUIRED WORKSPACE ONE (ORIGINALLY KNOWN AS \"AIRWATCH\"). INFINITELY CUSTOMI."}, {"symbol": "AVGO", "date": "2023-12-22 09:00:00", "title": "GERMAN COURT FINES NETFLIX €7.05 MILLION FOR CONTINUED INFRINGEMENT OF BROADCOM HEVC PATENT", "text": "PALO ALTO, CALIF., DEC. 22, 2023 (GLOBE NEWSWIRE) -- BROADCOM INC. (NASDAQ: AVGO) ANNOUNCED TODAY THAT THE DISTRICT COURT IN MUNICH, GERMANY FINED NETFLIX €7.05 MILLION FOR ITS INFRINGEMENT OF A BROADCOM PATENT. THIS FINE WAS FOR NETFLIX'S CONTINUED INFRINGEMENT OF THE PATENT IN DELIBERATE VIOLATION OF THE COURT'S SEPTEMBER 14, 2023 JUDGMENT THAT NETFLIX INFRINGES THE PATENT AND MUST CEASE AND DESIST ALL FURTHER INFRINGEMENT IN GERMANY. THE EUROPEAN PATENT AT ISSUE, EP 2 575 366, COVERS KEY FEATURES OFTEN USED IN HEVC/H.265 VIDEO CODING, WHICH NETFLIX USES TO ENCODE AND STREAM ULTRA HD CONTENT TO SUBSCRIBERS."}, {"symbol": "AVGO", "date": "2023-12-15 16:15:00", "title": "BROADCOM ANNOUNCES INDUCEMENT GRANTS UNDER NASDAQ LISTING RULE 5635(C)(4)", "text": "PALO ALTO, CALIF. , DEC. 15, 2023 /PRNEWSWIRE/ -- BROADCOM INC. (NASDAQ: AVGO), A GLOBAL TECHNOLOGY LEADER THAT DESIGNS, DEVELOPS, AND SUPPLIES SEMICONDUCTOR AND INFRASTRUCTURE SOFTWARE SOLUTIONS, TODAY ANNOUNCED THAT THE COMPENSATION COMMITTEE OF BROADCOM'S BOARD OF DIRECTORS APPROVED GRANTING ON DECEMBER 15, 2023 RESTRICTED STOCK UNIT AWARDS COVERING 4,394,353 SHARES OF ITS COMMON STOCK TO 13,831 NEW EMPLOYEES AND PERFORMANCE STOCK UNIT AWARDS COVERING 91,930 SHARES OF ITS COMMON STOCK AT TARGET TO 25 NEW EMPLOYEES (OF WHICH UP TO TWO TIMES THE NUMBER OF TARGET SHARES CAN BE EARNED UPON THE ACHIEVEMENT OF SPECIFIED PERFORMANCE GOALS) UNDER BROADCOM'S 2023 INDUCEMENT PLAN."}, {"symbol": "AVGO", "date": "2023-12-11 18:18:00", "title": "CALTECH AND BROADCOM ANNOUNCE QUANTUM RESEARCH AND DEVELOPMENT PARTNERSHIP", "text": "INVESTMENT WILL CREATE AN INNOVATION, COLLABORATION HUB TO SUPPORT WORLD-LEADING SCIENTISTS AND ENGINEERS IN QUANTUM SCIENCE, COMPUTING, AND RELATED FIELDS. PASADENA, CALIF."}, {"symbol": "AVGO", "date": "2023-12-07 16:15:00", "title": "BROADCOM INC. ANNOUNCES FOURTH QUARTER AND FISCAL YEAR 2023 FINANCIAL RESULTS AND QUARTERLY DIVIDEND", "text": "REVENUE OF $9,295 MILLION FOR THE FOURTH QUARTER, UP 4 PERCENT FROM THE PRIOR YEAR PERIOD CASH FROM OPERATIONS OF $4,828 MILLION FOR THE FOURTH QUARTER, LESS CAPITAL EXPENDITURES OF $105 MILLION, RESULTED IN $4,723 MILLION OF FREE CASH FLOW, OR 51 PERCENT OF REVENUE QUARTERLY COMMON STOCK DIVIDEND INCREASED BY 14 PERCENT FROM THE PRIOR QUARTER TO $5.25 ADJUSTED EBITDA OF $6,048 MILLION FOR THE FOURTH QUARTER, OR 65 PERCENT OF REVENUE NON-GAAP DILUTED EPS OF $11.06 FOR THE FOURTH QUARTER; GAAP DILUTED EPS OF $8.25 FOR THE FOURTH QUARTER FISCAL 2024 ANNUAL REVENUE GUIDANCE OF APPROXIMATELY $50.0 BILLION INCLUDING CONTRIBUTION FROM VMWARE, AN INCREASE OF 40 PERCENT FROM THE PRIOR YEAR PERIOD FISCAL 2024 ANNUAL ADJUSTED EBITDA GUIDANCE OF APPROXIMATELY 60 PERCENT OF PROJECTED REVENUE (1) PALO ALTO, CALIF. , DEC. 7, 2023 /PRNEWSWIRE/ -- BROADCOM INC. (NASDAQ: AVGO), A GLOBAL TECHNOLOGY LEADER THAT DESIGNS, DEVELOPS AND SUPPLIES SEMICONDUCTOR AND INFRASTRUCTURE SOFTWARE SOLUTIONS, TODAY REPORTED FINANCIAL RESULTS FOR ITS FOURTH QUARTER AND FISCAL YEAR ENDED OCTOBER 29, 2023, PROVIDED GUIDANCE FOR ITS FISCAL YEAR 2024 AND ANNOUNCED ITS QUARTERLY DIVIDEND."}, {"symbol": "AVGO", "date": "2023-11-30 09:00:00", "title": "BROADCOM INTRODUCES INDUSTRY'S FIRST SWITCH WITH ON-CHIP NEURAL NETWORK", "text": "THE NEW TRIDENT 5-X12 DOUBLES BANDWIDTH, REDUCES POWER BY 25%, AND ADDS NEURAL NETWORK TO ENABLE NEXT-GENERATION TELEMETRY, SECURITY AND TRAFFIC ENGINEERING THE NEW TRIDENT 5-X12 DOUBLES BANDWIDTH, REDUCES POWER BY 25%, AND ADDS NEURAL NETWORK TO ENABLE NEXT-GENERATION TELEMETRY, SECURITY AND TRAFFIC ENGINEERING"}, {"symbol": "AVGO", "date": "2023-11-27 14:56:00", "title": "AXINN ADVISES VMWARE IN SECURING GLOBAL ANTITRUST CLEARANCE FOR $69 BILLION ACQUISITION BY BROADCOM", "text": "NEW YORK--(BUSINESS WIRE)--BROADCOM INC., A GLOBAL TECHNOLOGY LEADER IN SEMICONDUCTOR, DATA CENTER HARDWARE, AND INFRASTRUCTURE SOFTWARE SOLUTIONS, ANNOUNCED THAT IT HAD CLOSED ITS $69 BILLION ACQUISITION OF VMWARE, INC., A LEADING VIRTUALIZATION SOFTWARE PROVIDER. AS GLOBAL LEAD ANTITRUST COUNSEL TO VMWARE IN WHAT THE WALL STREET JOURNAL HAS CALLED “ONE OF THE LARGEST TECHNOLOGY MERGERS EVER,” AXINN, VELTROP & HARKRIDER LLP HELPED VMWARE SECURE GLOBAL REGULATORY CLEARANCES IN MORE THAN 10."}, {"symbol": "AVGO", "date": "2023-11-22 08:30:00", "title": "BROADCOM COMPLETES ACQUISITION OF VMWARE", "text": "SAN JOSE, CALIF. , NOV. 22, 2023 /PRNEWSWIRE/ -- BROADCOM INC. (NASDAQ: AVGO), A GLOBAL TECHNOLOGY LEADER THAT DESIGNS, DEVELOPS, AND SUPPLIES SEMICONDUCTOR AND INFRASTRUCTURE SOFTWARE SOLUTIONS, TODAY ANNOUNCED THAT IT HAS COMPLETED ITS ACQUISITION OF VMWARE, INC. VMWARE'S COMMON STOCK WILL NOW CEASE TO BE TRADED ON THE NEW YORK STOCK EXCHANGE (NYSE)."}, {"symbol": "AVGO", "date": "2023-11-21 07:48:00", "title": "BROADCOM AND VMWARE INTEND TO CLOSE TRANSACTION ON NOVEMBER 22, 2023", "text": "SAN JOSE, CALIF. & PALO ALTO, CALIF.--(BUSINESS WIRE)--BROADCOM INC. (NASDAQ: AVGO) AND VMWARE, INC. (NYSE: VMW) TODAY ANNOUNCED THAT THEY HAVE RECEIVED ALL REQUIRED REGULATORY APPROVALS AND INTEND TO CLOSE BROADCOM'S ACQUISITION OF VMWARE ON NOVEMBER 22, 2023. BROADCOM HAS RECEIVED LEGAL MERGER CLEARANCE IN AUSTRALIA, BRAZIL, CANADA, CHINA, THE EUROPEAN UNION, ISRAEL, JAPAN, SOUTH AFRICA, SOUTH KOREA, TAIWAN, THE UNITED KINGDOM, AND FOREIGN INVESTMENT CONTROL CLEARANCE IN ALL NECESSARY JURISDI."}, {"symbol": "AVGO", "date": "2023-11-21 07:45:00", "title": "BROADCOM AND VMWARE INTEND TO CLOSE TRANSACTION ON NOVEMBER 22, 2023", "text": "RECEIVES FINAL REGULATORY APPROVAL FOR TRANSACTION SAN JOSE, CALIF. AND PALO ALTO, CALIF."}, {"symbol": "AVGO", "date": "2023-11-07 08:00:00", "title": "BROADCOM INC. TO ANNOUNCE FOURTH QUARTER AND FISCAL YEAR 2023 FINANCIAL RESULTS ON THURSDAY, DECEMBER 7, 2023", "text": "SAN JOSE, CALIF. , NOV. 7, 2023 /PRNEWSWIRE/ -- BROADCOM INC. (NASDAQ: AVGO), A DELAWARE CORPORATION HEADQUARTERED IN SAN JOSE, CA, AND A GLOBAL TECHNOLOGY LEADER THAT DESIGNS, DEVELOPS AND SUPPLIES SEMICONDUCTOR AND INFRASTRUCTURE SOFTWARE SOLUTIONS, TODAY ANNOUNCED IT WILL REPORT ITS FOURTH QUARTER AND FISCAL YEAR 2023 FINANCIAL RESULTS AND BUSINESS OUTLOOK ON THURSDAY, DECEMBER 7, 2023 AFTER THE CLOSE OF THE MARKET."}, {"symbol": "AVGO", "date": "2023-11-03 09:00:00", "title": "GERMAN COURT'S PRELIMINARY OPINION FINDS BROADCOM PATENT VALID; NETFLIX FOUND TO INFRINGE", "text": "SAN JOSE, CALIF., NOV. 03, 2023 (GLOBE NEWSWIRE) -- BROADCOM INC. (NASDAQ: AVGO) ANNOUNCED TODAY THAT THE GERMAN FEDERAL PATENT COURT ISSUED A PRELIMINARY OPINION FINDING THAT A BROADCOM PATENT RELATED TO HEVC/H.265 VIDEO CODING IS VALID. THIS OPINION FOLLOWS A SEPTEMBER 19, 2023 JUDGMENT BY THE DISTRICT COURT OF MUNICH THAT NETFLIX INFRINGES THIS PATENT. THE MUNICH COURT ALSO ISSUED AN INJUNCTION REQUIRING NETFLIX TO CEASE AND DESIST ALL FURTHER INFRINGEMENT IN GERMANY."}, {"symbol": "AVGO", "date": "2023-10-30 05:02:00", "title": "BROADCOM AND VMWARE PROVIDE UPDATE ON PENDING TRANSACTION", "text": "SAN JOSE, CALIF. & PALO ALTO, CALIF.--(BUSINESS WIRE)--BROADCOM INC. (NASDAQ: AVGO) AND VMWARE, INC. (NYSE: VMW) TODAY ANNOUNCED THEIR EXPECTATION THAT BROADCOM'S ACQUISITION OF VMWARE (THE “TRANSACTION”) WILL CLOSE SOON, BUT IN ANY EVENT PRIOR TO THE EXPIRATION OF THEIR MERGER AGREEMENT. THE PARTIES HAVE RECEIVED LEGAL MERGER CLEARANCE IN AUSTRALIA, BRAZIL, CANADA, THE EUROPEAN UNION, ISRAEL, JAPAN, SOUTH AFRICA, SOUTH KOREA, TAIWAN, THE UNITED KINGDOM, AND FOREIGN INVESTMENT CONTROL CLEARANCE."}, {"symbol": "AVGO", "date": "2023-10-30 05:00:00", "title": "BROADCOM AND VMWARE PROVIDE UPDATE ON PENDING TRANSACTION", "text": "COMPANIES WILL CLOSE TRANSACTION PROMPTLY FOLLOWING SATISFACTION OF REMAINING CONDITION SAN JOSE, CALIF. AND PALO ALTO, CALIF."}, {"symbol": "AVGO", "date": "2023-10-18 08:00:00", "title": "BROADCOM AND VMWARE ANNOUNCE ELECTION DEADLINE FOR VMWARE STOCKHOLDERS TO ELECT MERGER CONSIDERATION", "text": "SAN JOSE, CALIF. AND PALO ALTO, CALIF."}, {"symbol": "AVGO", "date": "2023-10-17 09:00:00", "title": "BROADCOM SHIPS INDUSTRY'S FIRST 5NM SINGLE-CHIP 25.6TB/S ROUTER TO ADDRESS GROWING BANDWIDTH AND SECURITY DEMANDS", "text": "QUMRAN3D ACCELERATES TRANSITION TO MERCHANT SILICON ROUTERS BY SIGNIFICANTLY REDUCING CARRIER AND CLOUD OPERATOR TCO WITH UNPRECEDENTED SCALE QUMRAN3D ACCELERATES TRANSITION TO MERCHANT SILICON ROUTERS BY SIGNIFICANTLY REDUCING CARRIER AND CLOUD OPERATOR TCO WITH UNPRECEDENTED SCALE"}, {"symbol": "AVGO", "date": "2023-10-10 09:00:00", "title": "BROADCOM SHOWCASES VISION FOR AI ACCELERATION AND DEMOCRATIZATION AT THE 2023 OPEN COMPUTE PROJECT GLOBAL SUMMIT", "text": "UBIQUITOUS CONNECTIVITY, INNOVATIVE SILICON, OPEN STANDARDS ARE KEY TO ACHIEVING AI AT SCALE UBIQUITOUS CONNECTIVITY, INNOVATIVE SILICON, OPEN STANDARDS ARE KEY TO ACHIEVING AI AT SCALE"}, {"symbol": "AVGO", "date": "2023-10-02 09:00:00", "title": "SEMTECH AND BROADCOM SHOWCASE 200G/LANE OPTICAL TRANSCEIVER AT ECOC 2023", "text": "CAMARILLO, CALIF.--(BUSINESS WIRE)--SEMTECH AND BROADCOM PAVE THE WAY FOR SUCCESSFUL DEPLOYMENT OF NEXT GENERATION 51.2T AND 102.4T SWITCH PLATFORMS."}]