[{"symbol": "AS", "price": 37.03, "beta": 2.851886, "volAvg": 4094377, "mktCap": 20535780645, "lastDiv": 0, "range": "20.21-42.36", "changes": -0.26, "companyName": "Amer Sports, Inc.", "currency": "USD", "cik": "0001988894", "isin": "KYG0260P1028", "cusip": null, "exchange": "New York Stock Exchange", "exchangeShortName": "NYSE", "industry": "Leisure", "website": "https://www.amersports.com", "description": "Amer Sports, Inc. designs, manufactures, markets, distributes, and sells sports equipment, apparel, footwear, and accessories in Europe, the Middle East, Africa, the Americas, China, and the Asia Pacific. The company operates through three segments: Technical Apparel, Outdoor Performance, and Ball & Racquet Sports. The Technical Apparel segment offers outdoor apparel, footwear, and accessories under the Arc'teryx and Peak Performance brands. The Outdoor Performance segment provides outdoor apparel, footwear, accessories, and winter sports equipment under the Salomon, Atomic, Armada, and ENVE brands. The Ball & Racquet Sports segment offers sports equipment, apparel, and accessories under the Wilson, DeMarini, Louisville Slugger, EvoShield, and ATEC brands. The company also provides climbing gears, hiking and running footwear, skiing and snowboarding gears, functional athletic apparel, and lifestyle footwear, as well as sporting equipment for tennis, baseball, American football, basketball, golf, and various other professional and recreational sports. It sells its products through its retail stores, general sporting goods retailers, specialty stores, independently operated partner stores, and distributors, as well as its e-commerce websites, and retailer-owned and third-party e-commerce websites. The company was formerly known as Amer Sports Management Holding (Cayman) Limited and changed its name to Amer Sports, Inc. in August 2023. Amer Sports, Inc. was founded in 1950 and is based in Helsinki, Finland.", "ceo": "Jie Zheng", "sector": "Consumer Cyclical", "country": "FI", "fullTimeEmployees": "13400", "phone": "358 20 712 2500", "address": "Konepajankuja 6", "city": "Helsinki", "state": null, "zip": "00511", "dcfDiff": 35.17492, "dcf": 1.8550787007403524, "image": "https://images.financialmodelingprep.com/symbol/AS.png", "ipoDate": "2024-02-01", "defaultImage": false, "isEtf": false, "isActivelyTrading": true, "isAdr": false, "isFund": false}]