[{"symbol": "RYTM", "price": 101.63, "beta": 2.008, "volAvg": 765780, "mktCap": 6782385371, "lastDiv": 0, "range": "45.905-122.2", "changes": -4.43, "companyName": "Rhythm Pharmaceuticals, Inc.", "currency": "USD", "cik": "0001649904", "isin": "US76243J1051", "cusip": "76243J105", "exchange": "NASDAQ Global Market", "exchangeShortName": "NASDAQ", "industry": "Biotechnology", "website": "https://www.rhythmtx.com", "description": "Rhythm Pharmaceuticals, Inc., a commercial-stage biopharmaceutical company, focuses on the development and commercialization of therapeutics for the treatment of rare genetic diseases of obesity. The company's lead product candidate is IMCIVREE, a potent melanocortin-4 receptor for the treatment of pro-opiomelanocortin (POMC), proprotein convertase subtilisin/kexin type 1, leptin receptor (LEPR) deficiency obesity, and Bardet-Biedl and Alström syndrome. It is also developing setmelanotide, which is in Phase II clinical trials for treating POMC or LEPR heterozygous deficiency obesities, steroid receptor coactivator 1 deficiency obesity, SH2B1 deficiency obesity, MC4 receptor deficiency obesity, Smith-Magenis syndrome obesity, POMC epigenetic disorders, and other MC4R disorders. Rhythm Pharmaceuticals, Inc. has a collaborative research agreement with the Clinical Registry Investigating Bardet-Biedl Syndrome. The company was formerly known as Rhythm Metabolic, Inc. and changed its name to Rhythm Pharmaceuticals, Inc. in October 2015. Rhythm Pharmaceuticals, Inc. was founded in 2008 and is headquartered in Boston, Massachusetts.", "ceo": "David Meeker", "sector": "Healthcare", "country": "US", "fullTimeEmployees": "283", "phone": "857 264 4280", "address": "222 Berkeley Street", "city": "Boston", "state": "MA", "zip": "02116", "dcfDiff": 77.08351, "dcf": -24.163510994340992, "image": "https://images.financialmodelingprep.com/symbol/RYTM.png", "ipoDate": "2017-10-09", "defaultImage": false, "isEtf": false, "isActivelyTrading": true, "isAdr": false, "isFund": false}]