[{"symbol": "POWL", "price": 419.98, "beta": 0.859, "volAvg": 236198, "mktCap": 5098760050, "lastDiv": 1.07, "range": "146.02-446.11", "changes": 14.43, "companyName": "Powell Industries, Inc.", "currency": "USD", "cik": "0000080420", "isin": "US7391281067", "cusip": "739128106", "exchange": "NASDAQ Global Select", "exchangeShortName": "NASDAQ", "industry": "Electrical Equipment & Parts", "website": "https://www.powellind.com", "description": "Powell Industries, Inc., together with its subsidiaries, designs, develops, manufactures, sells, and services custom-engineered equipment and systems for the distribution, control, and monitoring of electrical energy. The company's principal products include integrated power control room substations, custom-engineered modules, electrical houses, medium-voltage circuit breakers, monitoring and control communications systems, motor control centers, and bus duct systems, as well as traditional and arc-resistant distribution switchgears and control gears. Its products have application in voltages ranging from 480 volts to 38,000 volts; and are used in oil and gas refining, onshore and offshore oil and gas production, petrochemical, liquid natural gas terminals, pipeline, terminal, mining and metals, light rail traction power, electric utility, pulp and paper, and other heavy industrial markets. It also provides value-added services, such as spare parts, field service inspection, installation, commissioning, modification and repair, retrofit and retrofill components for existing systems, and replacement circuit breakers for switchgear. The company has operations in the United States, Canada, the Middle East, Africa, Europe, Mexico, and Central and South America. Powell Industries, Inc. was founded in 1947 and is headquartered in Houston, Texas.", "ceo": "Brett A. Cope", "sector": "Industrials", "country": "US", "fullTimeEmployees": "2748", "phone": "713 944 6900", "address": "8550 Mosley Road", "city": "Houston", "state": "TX", "zip": "77075-1180", "dcfDiff": -30.55125, "dcf": 450.53124889903586, "image": "https://images.financialmodelingprep.com/symbol/POWL.png", "ipoDate": "1980-03-17", "defaultImage": false, "isEtf": false, "isActivelyTrading": true, "isAdr": false, "isFund": false}]